[
    "For taste and friendliness this deserves more stars. But as a whole experience, three is the best I can offer. It was just a little too much of a do it yourself affair for my own taste. You may like that, though so read on.First of all, I went in August. Big mistake. No, or virtually, no air conditioning. So even with 9:30 p.m. reservations, it was quite uncomfortable - probably mid-eighties Fahrenheit, 30 C.The waiter was very friendly, but his delivery was weak. He got my wife's order wrong in a way that was particularly irksome. She just ordered ala carte and had a salad and the mussels - both were starters on the menu. First he brought her the wrong salad and when it came out, they had already delivered the mussels. So she had two large plates in front of her for the whole time there rather than receiving them in courses like the other four of us were doing.I ordered off the fixed-price menu and got  prawns for the starter, sea bass for the main course and Catalan cream (think Creme Brulee) for dessert. The prawns arrived steaming hot, likely in the pan in which they were cooked that sat on a plate that made it possible to carry it. There was no preparation. The whole prawn was offered (six or eight of them, in fact). So I had to remove the head, legs, tail, shell and the vein. It was really too hot to do by hand and my only tools were a soup spoon and knife, which I found more than a bit awkward. So I took them out of the pan and let them cool on the plate and then did the work by hand. They were absolutely delicious, but it took a while to get my hands clean and dried in their rest room afterwards.When the sea bass arrived, it was just like the prawns. Cooked and steaming hot, but still the whole fish - head, tail, bones and all. I hadn't dealt with this before and I wasn't very good at it. I think a seafood fork would have been useful here, too. But I still had a fork and knife. It was absolutely wonderful to eat, but I missed a few bones in my inefficient preparation and that spoiled a few bites (including one I shared with my son).My son ordered the sole and had the same chore I had to prepare it. But he was more adept than I.Sister in law had the big steak and it was terrific. But it was quite rare and pre-sliced, as others here have noted. They bring you a hot pan and she just loaded the pieces in and finished cooking it to her liking. It was fantastic. Her husband's skirt steak was a real disappointment, though. The piece of beef had a lot of bristle and he put it aside as soon as he tried to cut into it in two different places and never took a bite. The waiter never asked him about it until he cleared our dishes at the end of the main course. When we gave him the news about the bristle (did he know the word \"bristle\" in English?), he made a face but that was all he did. And we paid for it along with the rest of the meal.Dessert were all terrific and no preparation work necessary!So if you like to take part in preparation of some terrific food, and if you can go when the weather is milder, you will really love this place.", 
    "3.0", 
    "Robert J.", 
    "Round Rock, TX", 
    "0", 
    "1", 
    "336-barcelona-2", 
    23, 
    [
        "Spanish", 
        "Mediterranean", 
        "Steakhouses"
    ], 
    2
]