[
    "This was a last minute decision to dine here due to unexpected wet weather.  While shopping in the area, the onset of heavy showers encouraged me to look for a dining option other than the one originally planned  (way across town).  After a quick scan of the window menu, the fare seemed decent, and from the damp exterior looking in, the restaurant the interior seemed modern and well designed.  I decided to try their prix fixe menu -19 Euros per person. A few courses in, I thought I had made a mistake.  The first three courses and our drink orders flew out of the kitchen - beating the efficient of fast food joints. Also, there were not that many diners at the restaurant - it seemed a bit quiet - perhaps due to the weather, or being a few blocks away from the touristy Passage de gracia.  This restaurant had more a neighborhood vibe too it.  Despite the rapid pace of food coming out, the quality, taste, and presentation were spot on. Luckily the kitchen slowed down but because of the earlier lighting fast order delivery, slowing down back to normal pace seemed like it was going in slow motion.  Once the pace was stabilized, it was fine. I particularly enjoyed the blood sausage - flavorful, juicy, well seasoned, and paired well with the chorizo.  The deconstructed spanish omelette was fun - creative interpretation of a traditional dish.  The last savory dish was the succulent grilled prawns.  A good place to dine a few blocks from shopper's paradise.  Insulated enough to provide a brief respite before exploring the stores a few blocks away.  I'm assuming the fast pace of the first three order was an anomaly - and that with a decent pace of service, this place would be that much better to an already solid dining experience.", 
    "4.0", 
    "John L.", 
    "San Francisco, CA", 
    "14", 
    "91", 
    "336-barcelona-2", 
    4, 
    [
        "Spanish", 
        "Mediterranean", 
        "Steakhouses"
    ], 
    2
]