[
    "If you are American, avoid at all costs.  Enter place and find it pretty empty.  Ask if they have availability for dinner (one person).  Told to sit at empty table in bar area and wait, and will be seated.  While waiting three other groups come in (all without reservations) and are told same thing.  So, we all wait in empty bar area (with no servers) for fifteen minutes.  Then, chef/owner says ok we can be seated now.  (No other tables had left the place in meantime, and place was pretty empty, so think we were forced to wait just to wait.). After being seated, waited ten minutes.  No service.  Everyone else seated around me at same time taken care of.  I ask passing waiter if I can get service, he says will be right back.  Wait another ten minutes, nothing.  So, I go ask hostess if I can get a waiter.  Immediately, chef comes running from kitchen, pushes his belly into me and starts screaming and spitting at me.  Says I must be American, and says he is going to go get his gun and shoot me.  Says, \"I mean it.\"  No joke, his words verbatim.  He tells me he no longer wants me to be served in his restaurant.  On way out, I take picture of him for my own safety given his gun threat.  He then starts screaming all over again and says he's calling police.  Best part is he has fifteen empty tables, but says I'm lucky he seated me without a reservation.  Fyi, three other groups seated at same time all without reservation, and restaurant was still half empty.  I leave.  Am sure food is good, but if you are American and value avoiding bigotry and getting threats about being shot, suggest you go to one of many excellent other choices nearby.  Jaime Beriestain is a good choice in this neighborhood.In terms of chef/owner's reply below, he is lying and demonstrating his craziness.  I did not enter the premises drunk, as I had just finished a day of business meetings and had not consumed anything alcoholic.  He says I ordered martinis while waiting??  I have never had a martini in my life, I don't like martinis.  The truth is there was zero service while waiting in the empty bar, so even if I had wanted to order a drink, I couldn't.  In terms of waiting, I had no problem and in fact waited quietly with three other groups who also had no reservations (despite one dining room being totally empty and the other being only half full).  In terms of him saying I came to hostess yelling, again not true.  After watching the others get served and after asking a waiter for help and not getting service still, I went to the hostess stand and asked politely could I get a waitress.  This is after sitting at table for twenty minutes which is after waiting to be seated for twenty minutes (with an empty restaurant).  As reported in my review above, hostess didn't say anything and instead went to the kitchen, and the next thing is this chef/owner comes running out, yelling and spewing spit on my face, pushing his belly into me, and tells me verbatim \"I am going to go get my gun and shoot you.  I mean it.  You are American.  Leave my restaurant.\". He apologized and asked if he could do anything??  Never happened.  Would have been right and expected response, but never happened.  Instead, when I took his picture to protect myself on way out, he came running and yelling again, tried to physically grab me and phone, and told me he is calling police (again after he told me he is going to get a gun and shoot me).  Now he says he doesn't own a gun and that he served me drinks, etc.  He is very confused.  No receipt for anything served me because this is my point -- I got ZERO service from time I first entered premises.  Believe me, I could not make this up if I tried.Suggest readers note that most of the positive reviews on this restaurant focus on cheap price, and that there are numerous negative reviews (look at what the one and two star raters say) that say similar things as I do about this guy.  Again, suggest you avoid him, avoid his establishment, and avoid his craziness.  His reply alone proves the point.", 
    "1.0", 
    "B A.", 
    "Chicago, IL", 
    "0", 
    "76", 
    "336-barcelona-2", 
    35, 
    [
        "Spanish", 
        "Mediterranean", 
        "Steakhouses"
    ], 
    2
]