[
    "NOTE: This review is for the bar only, and not for the eating / drinking \"experience.\" My wife and I were really excited to try 41 degrees on our last night in Barcelona, to see what kind of creative drinks they would make and just enjoy the whole bar experience. We showed up about 10 minutes before midnight -- their website says they allow people who don't have dinner reservations in at midnight to enjoy the bar -- and at midnight there was no indication that they were letting people in. Only after peering into the door for awhile did someone come out and tell us that there were a couple open seats at the bar. The room and the bar were beautiful, and everyone finishing up their meals looked very happy, which made us even more excited. Sadly, that was the \"climax\" of our \"experience\" at 41 degrees.Once we sat down at the bar, it took 5 minutes to get drink menus, another 10+ minutes before anyone took our drink order (note, there were only about 6 people sitting at the bar, and 3-4 bartenders making drinks), and another 15-20 minutes before we got our drinks. Our first round of drinks were good, but nothing mind-blowing and definitely not worth the 14 Euros each. I thought San Francisco cocktails were expensive, but nothing compared to 41 degrees!  However, since we had made such an effort to go to 41 degrees and since it was our last night, we decided to try one more drink. We were hoping that as we finished our first round that someone would ask us if we wanted another -- nope. Then we kept trying to eye any and all or the bartenders to get their attention. About 15-20 minutes later, we finally got the attention of a very un-interested bartender, who 15 minutes later brought us another underwhelming cocktail. We should've just gone home. Sadly, our \"experience\" at 41 degrees was negative in all respects. However, if we're back in Spain, we'll probably try to get the whole eating / drinking experience, and maybe it'll be completely different next time.", 
    "1.0", 
    "Pilan C.", 
    "San Francisco, CA", 
    "147", 
    "240", 
    "41-degrees-barcelona", 
    10, 
    [
        "Spanish"
    ], 
    4
]