[
    "I read many mixed reviews on yelp and travel advisor. And unfortunately our visit was one of the negative ones. Just getting seated in a nearly empty restaurant without reservations at the early dining time of 630pm took more effort than it should have. Why didn't we have a reservation? Because there were none available when we called earlier in the afternoon. No worries. Folks in Barcelona dine later in the evening so we'll beat the rush. Yet it still took a conference before our party of six was seated. We asked the server to help guide us through ordering and that we were hungry. We wanted wine, appetizers, and entrees to share. He appeared to understand English and replied appropriately, which was fortunate as we two Americans, and four Canadians spoke nearly no Catalan or Castilian.Unfortunately, as our meal was being served, we realized that much had been lost in the translation. We received fewer appetizers than we thought we had ordered. The Fideua was not nearly as attractive as some that we had seen during our two days of touring. And the Paella! Oh my gawd, the Paella. The dish that I had been looking forward to for months. The presentation was beautiful. The server brought it out in the Pealla pan and showed it to us and allowed us to take pictures before portioning it out into plates. It was so salty, it was almost inedible. There were none of the crunchy bits of overcooked rice at the bottom of the pan that we were hoping to experience. We all politely braved through our meal without sending any of it back or ordering items that had been missed. A couple of the items on the assorted appetizer plate were delicious. Too bad not everyone got to try each item as there were only two of each on the plate and they only brought us one plate instead of the two that we had ordered. We skipped dessert and headed back to our hotels, buying snacks along the way to tide us over until morning.", 
    "1.0", 
    "Dexter D.", 
    "San Leandro, CA", 
    "16", 
    "344", 
    "7-portes-barcelona", 
    74, 
    [
        "Mediterranean", 
        "Catalan", 
        "Arroceria / Paella"
    ], 
    3
]