[
    "YUM!!!Oh my! One word: fideua (fee-deh-oo-wah). My sister and I were in Barcelona on holiday and had experienced a few paella places before we headed here. Our guide book recommended that people who like paella should try fideua and this place had a reputation so we decided to try it. We also ordered a salad and skewers with monkfish, salmon, and langoustines.The salad was just lettuce, radishes, and tomatoes and it came plain and we were told to choose one of the many olive oils in the little caddy on the table to dress it ourselves. We'd tried all of the oils by dipping in our bread and decided to choose the most vibrant green oil, which was the fruitiest. We added it to the salad along with some salt and pepper and it was crazy delicious.We chose the skewers because both of us love monkfish but the langoustines were the star of the dish. It was our first time trying langoustine (and since langoustine is French for lobster, I didn't know it was a totally different creature). Though they look deceptively like shrimp, they're much more delicate, tender, and flavorful. The skewers came with some really thick pasta strips that were dressed in just olive oil - again, amazing because of the olive oil.The fideua was crazy! It looked like a pile of little matchsticks peppered with pieces of calamari and it was amazing. The flavors were insane - how can you not love saffron? The texture of the noodles was amazing and the calamari was so good.For dessert we got profiteroles which were filled with light, sweet, whipped cream and we were given a little gravy boat filled with chocolate sauce (chocolate sauce boat?) and got to drizzle our own dessert. The sauce was made with dark chocolate so it wasn't overly sweet and it was really decadent.Service was amazing too. The waiters were really tolerant of our touristy broken Spanish and actually seemed to enjoy giving us olive oil lessons. Prices are a bit steep (typical of the entire city, I think) but the food is definitely worth it.", 
    "5.0", 
    "Rach K.", 
    "New York, NY", 
    "192", 
    "879", 
    "7-portes-barcelona", 
    67, 
    [
        "Mediterranean", 
        "Catalan", 
        "Arroceria / Paella"
    ], 
    3
]