[
    "I had dinner with the family here tonight and have to say that I was not overly impressed. This is obviously a tourist oriented restaurant just by the location down by the marina / beach area. They have a nice outdoor seating area, but it can be loud as it is right on the street. Also later in the evening just around the corner there are several individuals sleeping along the side area, basically living there at night so it smells a little and does not feel super safe. As for the inside, very traditional and nice dining area. The staff are competent, but somewhat cold and distant in my opinion. We were sat at a nice table, but never really felt welcomed as I had been in so many other places. The menu is well varied, but I have to say the prices are at the very least double of most other restaurants in the area that we have gone to. For example, my daughter loves fried calamari and orders it whenever it is available. Most places have the appetizer for 8-10 €uros, but here they were 20. I expected it to be a super special dish, but upon serving, it was a small portion and just average to say the least. Many dishes are in the 30 to 45 €uro range and after being here for 3 weeks I have to say that these prices are outrageous. My father ordered a seafood paella and thought it was quite good. My wife had a meat and vegetable paella and thought it was just satisfactory. Overall I think the are much better places to go for much less money. I probably should have only given two stars as the prices are just over the top, but I am a nice guy and the food was not so bad that it justified less than three stars. At the end, mediocre quality food, high prices, and competent but very cold service. My recommendation is to eat here only if nothing else is available.", 
    "3.0", 
    "Peter R.", 
    "Scottsdale, AZ", 
    "0", 
    "81", 
    "7-portes-barcelona", 
    105, 
    [
        "Mediterranean", 
        "Catalan", 
        "Arroceria / Paella"
    ], 
    3
]