[
    "On our last day in Barcelona we were looking for good tapas and found this place on Yelp and happened to be close to it.The tapas was very good and the Thai sangia was excellent.Why two stars?  For two of the most egregious failures of good restaurant protocol I've ever seen.First, the bread.  Thanks to the Yelper who pointed this out to us!  With your meal they bring you a TINY basket of bread.  But when you get the bill, they've charged you over 5euros (about $7!) for it.  And this is Europe, which every American knows is famous for its great bread - dark, heavy pieces with grains and flavor that put our bread to shame.  But this tiny little basket of bread had the cheapest tiniest pieces of dried white bread - the kind kids feed to pigeons in the park.  When the bill came I just pointed at the bread and gave our (supposedly) non-English speaking old waiter my best WTF expression.  Obviously he'd heard this before because he just grumbled and walked away and came back with the bread off the bill.  Which made it worse, because it was obviously a scam and he knew it.Second, the most awesome display of rudeness I've ever encountered by a waiter.  We had already eaten a bit before we got there and, in any case, my date doesn't eat that much anyway.  So, while my date happened to be in the bathroom, I ordered the single order of paella, which we saw from the other patrons was more than enough.  The old curmudgeon waiter asked me if I wanted paella for two.  I repeated, \"No, I want a single serving.\"  I ordered a few more things and when he read back the order he said \"paella for two\".  Again, I said, no, I want paella for one.  Importantly, none of this was witnessed by my date. Sometime later when he brought my date and I the paella for one, he put it on the table and said in an annoyed tone \"Single paella\".  He then pointed to the next table and said \"Paella for two\" and pointed back to our paella and repeated \"Paella for one\" with disgust.  Spectacular!  I was half expecting him to reach into my wallet and grab some cash.I left him a tip for zero.", 
    "2.0", 
    "Vin F.", 
    "San Diego, CA", 
    "130", 
    "130", 
    "7-portes-barcelona", 
    88, 
    [
        "Mediterranean", 
        "Catalan", 
        "Arroceria / Paella"
    ], 
    3
]