[
    "Disclaimer: I live in NYC and dine out almost every day for the past 11 years and I travel overseas on a regular basis so I know what to and what not to expect. This place is simply overrated and unacceptable. The food is plain disappointing and borderline disgusting. I will not talk about the poor quality/lack of service because I came purely for the food so let me simply base this review off the food. After reading several mixed reviews of the paella in Barcelona from various sources, including Yelp, I decided to give this place a try because some of those reviews seemed to view the paella highly. I made a reservation through my hotels concierge and was seated promptly upon arrival. Knowing that properly cooked paella takes a while, we started off the dinner with an order of prawn cocktails, canelons 7 portes, and monkfish soup. Since I was the only one drinking at the table, I was forced to order the house wine, which is the only wine they serve by the glass. The prawn cocktails consisted of 6 very small shrimps on a bed of chopped lettuce \"drenched\" in thousand island dressing. Reminded me somewhat of a Big Mac minus the buns, cheese, and meat patty. The monkfish soup was so bland and watered down, it tasted like the soup was prepared separately from the monkfish or any of the other shellfish that appeared in the soup. The house red/white wine were both a waste of time and money. At this point, I figured this was the restaurants strategy to serve some mediocre starters so when the paella that everyone raves about finally comes out, BOOM! Tastes great!.... But that was just wishful thinking in my head.Our paella parellada was plain awful. Not only was it one ugly looking dish, it tasted horrible. Any possible flavor that could of came out of the ingredients used to make the dish was killed off by the overuse of salt. The \"lobster\" in the paella was simply half a tail of a tiny langoustine in the shell (I noticed one table had two halves of the tail. I wonder what happened to our other half?) Honestly, I lack the vocabulary to describe how poorly it tasted and thinking about it now upsets me so I'm going to stop. We finished with an order of creme brûlée with very low expectations and it managed to be lower than what I was expecting. They were unable to brûlée the top with only the half of the middle slightly crispy and the whole thing tasted like butane. The funny thing is, not a single person seemed to enjoy their food and I didn't see any expressions of satisfaction on anyones faces but when asked by the waiter, everyone said it was good. When the waiter asked me how the paella was, I simply said it was disgusting and disappointing. He smiled and said thank you without even thinking about what I said (he spoke fluent English the whole time). When I approached the manager with my complaints he simply shrugged and said it is what it is. The restaurant is obviously set on just raking in money from one time visitors aka tourist that walked in with a recommendation from their guide books. Being a tourist and foodie at the same time, I had my DSLR ready and my iPhone camera ready but I didn't deem a single dish worthy of a picture. I don't trust strangers very easily but I BEG YOU to TRUST ME when I say this place is a waste of your time and your money.", 
    "1.0", 
    "Edmund T.", 
    "New York, NY", 
    "27", 
    "28", 
    "7-portes-barcelona", 
    63, 
    [
        "Mediterranean", 
        "Catalan", 
        "Arroceria / Paella"
    ], 
    3
]