[
    "We ended up cancelling our paella and walking out after thumbing through a very overpriced, mediocre \"Salad of the season\" and some salt cod. Don't bother with this place. I would suggest getting a paella and nothing else. Perhaps it is considered a historic restaurant, but in reality this is no better than the junk on La Rambla. We unfortunately ended up here because everything else was closed and we wanted paella before leaving the next day.It's a tourist trap for tourists who want to think they are in the know. It's also expensive. The restaurant itself is really nice. Beautiful old wood interior and a nice outdoor space. Everything about it should tell you its good. Including the amount of people that will be waiting for a table ahead of you. Unfortunately the service is some serious bush league nonsense. We sat at our table for 15 minutes before anyone took our order. Another 15-20 minutes to bring us literally anything else (silverware, bread, water). After 45 minutes, our incredibly dull salad arrived. It was basically a basket of assorted vegetables. Like your mom just got back from the farmers market and you just pick at it and drizzle some olive oil. This wasn't a salad. It was more like a cold vegetable appetizer. Vegetables with absolutely nothing on them. And these veggies weren't like, wonderful fresh veggies that you commonly find in Spain. This was some lazy nonsense. The salt cod wasn't for me, and I love many, many things. I think the staff just has no idea how to manage their job. They were fumbling around everywhere, running back and forth acting flustered, but somehow not really attending to anyone. Like standing in a corner drying a bunch of wine glasses instead of bringing us our wine.Paella takes some time. I know. We eventually lost patience, asked the host where our paella was and how we had to be somewhere in a bit. His response was to point out how we didn't tell him we were in a \"rush\" and that we should have said something. Magically he was \"able to cancel\" our paella. Why? Probably because they hadn't started cooking it yet. It took another 15 minutes just to get the check. I bee lined out of here 44 euros lighter with an angry, not-really-full stomach of regret. Of course, I didn't leave a penny on the table. Screw this place. Avoid unless you like being a chump and eating with (possibly) rich posers who (possibly) just yacht'ed into town. Their table olive oil, from nearby Tarragona, is exquisite though. One star for the olive oil.", 
    "1.0", 
    "Joe B.", 
    "Maspeth, NY", 
    "5", 
    "20", 
    "7-portes-barcelona", 
    19, 
    [
        "Mediterranean", 
        "Catalan", 
        "Arroceria / Paella"
    ], 
    3
]