[
    "When I was planning my trip to Barcelona in 2009, I asked three people - Barcelona-philes all of them - what places they recommend I dine. The lists were all pretty diverse except for this one common thread - they all listed Restaurant 7 Portes as the must-try for seafood paella. Jamie W. and I decided to try it the second night we were there since we were strolling through Barceloneta anyway. It's definitely a historic place housed in a big graystone building replete with marble floors and ah yes, seven doors!We were seated immediately since we showed up at around 5:30PM, which in Barcelona time means the lunch hour had barely ended. There were white tablecloths and matching linens all subtly emblazoned with the restaurant logo. Even the plates had a little logo on the rim. Jamie and I shared a house specialty, the Paella Parellada (\"Rich Man's\" Paella, 18.70 Euros, see photo) - which was sparse on ingredients (one jumbo shrimp tail, one sausage, etc.) but packed with flavor. We also tried the Botifarra amb Mongetes del Ganxet 7 Portes (Catalan Sausage with \"7 Doors\" White Beans, 11.50 Euros, see photo). Good, hearty peasant-style fare.There was enough room for dessert, and we were quite pleased with the slice of Pastis de Coco i Gerd (Coconut and Raspberry Pie, 5.30 Euros, see photo). Despite the white linens and the natty look of the staff, the restaurant was not very dressy. The service was very old-school, as the waiter looked almost as established as the restaurant. The place got packed fairly quickly with quite a few tourists in the mix, and the decibel level followed suit. My advice would be to come before 6PM as if they had an Early Bird special but then reset your expectations back to the higher-than-moderate prices they do charge regardless of the hour. By the way, it's just a quick stroll from the Barceloneta subway station, so it's easy to get to from anywhere in the city.FOOD - 4 stars...flavorful paella even if it wasn't all that AMBIANCE - 4.5 stars...very old school...how many places have you been that have been in business for over 170 years and still has a toilet that flushes? SERVICE - 4 stars...also very old school, no English spoken unless they must TOTAL - 4 stars...I'll pass the word on 7 Portes...paella prepared with care", 
    "4.0", 
    "Ed U.", 
    "San Francisco, CA", 
    "3761", 
    "3341", 
    "7-portes-barcelona", 
    68, 
    [
        "Mediterranean", 
        "Catalan", 
        "Arroceria / Paella"
    ], 
    3
]