[
    "Wow, I came in expecting subpar service but I would do anything to get really good paella. Unfortunately, this place was so bad that it did not even reach my short expectations. We came in at around 6 when it was relatively empty, wanted to make a reservation for that night but of course it was completely booked. So we just decided to eat at that time just so we can see what the fuss is about this place. We asked if he had seating at that time and he said yes for now, but if it fills up then you have to wait. Within the span of 10 minutes that we took to chain our bikes, a waitlist appeared and we ended up waiting 20-30 minutes. Understandable considering how popular the place is but a little annoying.As soon as we got into the restaurant, we got some interesting looks from the service. I know this restaurant is supposed to be somewhat classy, but considering how touristy this place was and more than half of the customers seated in the restaurant were tourists in casual clothing, we were really confused what was wrong with us. Either or, the service was not good. We saw the waiter twice just to order and pay and that was about it. It also took forever to get the bill.Finally, the most disappointing part was the food. Considering the price and the hype, I came here for some good paella. 20 something euros for a paper thin layer of really salty paella definitely does not cut that. I've had paella on this trip 4 times and this was probably the worst in flavor, quantity, and service for the most expensive price. I'm so disappointed that I took the chance of going to this restaurant. Really, get your paella elsewhere, you are not missing out on anything.EXTRA TIP: As everyone has pointed out, the bread was 2.4 euros and absolutely horrible and stale. No idea what they were thinking with that...", 
    "1.0", 
    "Sherry X.", 
    "New York, NY", 
    "146", 
    "79", 
    "7-portes-barcelona", 
    16, 
    [
        "Mediterranean", 
        "Catalan", 
        "Arroceria / Paella"
    ], 
    3
]