[
    "Love it and more please...We decided to visit A Gianni for two reasons: very close to our hotel & to deviate from Spanish tapas.  I am so glad we did because we had a great dinner with excellent service.I enjoyed everything from the wine recommendation by Angelica, the design of the restaurant and the food!  We were not disappointed with any dish that we ordered.  And that includes our second visit.We love our wine so we ask for bottles with certain characteristics.  Angelica listened to what we like and was spot on with her recommendations.  An extra bonus was that the wine was served in a proper wine glass at the correct temperature.Now for the food...I don't know how such simple dishes can be sooooo good.  Our first visit there we started with a caprese salad.  It is large enough to split (see my picture) so save some space for other dishes.  I thought I was eating bufala mozzarella made that very day.  After the salad I had a great and simple steak.  It was season and cooked how I would cook my own steak.  My wife ordered a pizza from their menu.  Again the size was generous.  After I ate a slice I wanted to come back to try more of their dishes.Our second dinner.  I know it may sound weird that we ate here two times out of the five nights we stayed.  But our flight the next day was at 6:30am and we had to be packed and ready early the night before.  So we came back because we knew the food will be good.  We shared another starter, prosciutto with mozzarella.  I would recommend this dish over the caprese if you had to choose between the two.  Then we split an order of risotto and a pizza.  BEST RISOTTO EVER!  I couldn't believe how great it tasted.  And again it was no more than four or five ingredients.  We ordered the risotto special of the day, chicken risotto with lemon.  It was perfectly cooked, not over cooked or too al dente.  And it tasted amazing, just a hint of lemon to pair with the chicken and risotto.    I know we will be returning to A Gianni when we come back to Barcelona.", 
    "5.0", 
    "John V.", 
    "Houston, TX", 
    "53", 
    "154", 
    "a-gianni-barcelona", 
    21, 
    [
        "Italian", 
        "Pizza"
    ], 
    2
]