[
    "partial review see my blog for moreFood:-Chef Cruz's cuisine is best described as a satisfying balance of creativity and Spanish tradition. With his delicate plating, and moments of deconstructed textures, there is an element of modernist cuisine, but it's definitely understated.-The restaurant gives the option of a la carte (with items ranging in price from 15-72 €), the 13 course ABaC menu for 135 € or the 16 course grand tasting menu for 165 €. -We were already on our third tasting menu in a row, and knew that the day following would be a big one at El Celler de Can Roca, so we \"just\" opted to go with the 13 course spread.  It was more than enough.Bread[11]Delicious poppy-seed brioche was some the best I've had since Paris last year.Iced Bloody Mary with Cherries[6]If an appetizer is supposed to rev up your appetite, then consider this putting peddle to the medal. The granita had all of the distinct flavours of the popular drink- the acidic tomatoes, the aromatic celery salt, the solid hit of heat- and while it seemed strange at the time, the addition of the sweet ripe cherries really helped balance everything out. Foie Gras: Shaved with Pigeon Royales on Frico and Pigeon Consomme; Duck Broth with Cream of Foie Gras; Foie Gras Foccacia with Seared Foie[10]A decadent foie gras course felt a bit early in the meal, but it was delicious nonetheless. The delicately shaved foie gras melted like butter on the light ethereal crisp, pairing beautifully with the salty deeply flavoured consommé. [9]With a texture smoother than freshly whipped cream, the cream of foie was even more luxurious, while the tiny little \"slider\" turned out to be my favourite bite. [8]Don't judge me but we both felt it tasted a bit like McDonalds fries in the best way imaginable- addictive and unapologetically tasty.Oysters with Cured Mackerel Tartar with White Garlic Ice Cream and Watercress[12]I would have never thought to make a garlic ice cream, but it surprisingly wasn't offensive in the least. Rather the combination of sweet, meaty tartar with the aromatic cold cream made for a satisfying first fish course.Canarian Black Potatoes with Roasted Octopus, Curry Mojo Sauce, Lemon Brine and Acidified Broth[13]While admittedly I did find the octopus a touch overcooked and rubbery, the combination of the tangy curry mayo, lemon, and bright broth made up for any shortcomings in technique. Light, yet deeply comforting.Baby Lobster with Young Leeks with Coral Juice and Thai Coconut[14]One of my favourite dishes of the night. I absolutely loved the delicate sweet shellfish and leeks against the fragrant coconut sauce. I scraped that coconut clean with such gusto, I was actually worried it may break.Parmesan Egg with Chicken Stock, Truffle and Walnuts[15]A very delicious and comforting dish- the \"egg\" was made up of a runny egg yolk with a cheesy creamy bubble holding it all in. When broken, it engulfed the tiny matchsticks of aromatic truffles and walnuts, moistening them in luscious moisture and fat. I am not sure why, but both of us thought it reminded us of a bowl of shredded wheat cereal in the absolute best way possible.Squid Treated like Black Rice with Padron Sedes[16]I wasn't crazy about this dish- partially because it stained our mouths black (so naturally we took silly pictures of it), but mainly because it was just a bit overwhelmingly fishy for my tastes. A smaller portion of the ilk and squid would have been much more appropriate, while the dish could have used another component (other than the crunchy pepper seeds) to temper the overwhelming fish-flavour down.Prawn \"Suquet\" with Potato Gnocchi, Candied Tomatoes and Hazelnuts[17]I quite liked the rich suquet (traditional fish stew) with the delicate hit of sweet hazelnuts, but found the gnocchi soggy, and the tomatoes underwhelmingly bland. Mediterranean Red Mullet with Seaweed Foam, Fried Seaweed and Aioli[18]I am a big fan of mullet, which we don't see much at home, and enjoyed the crispy yet light preparation here.  Again, a clearly fish-forward flavor profile, but here the seaweed was mild enough to not overwhelm.Guinea Fowl with Foie Gras, Aubergine, Black Garlic and Kumquat[19]I loved the tender guinea fowl against the sweetness of the black garlic and caramelized aubergine. An already rich dish, I could have done without the added foie, but who really complains about foie? Kobe Beef with Foie Gras, Aubergine, Black Garlic and Kumquat[20]This was a supplemental charge to try the Kobe beef, which was so flavourful and unctuous it merely dissolved on the tongue- there one second and gone the next. Again, here more even so than with the fowl, the foie gras was surely overkill as it made for a bit of an overwhelmingly rich plate.Tonic Water Bubbles with Mango, Candied Lemon and Juniper[21]After tucking into this, I decided that in my opinion, desserts are where ABaC really shines. This de", 
    "4.0", 
    "Abbey S.", 
    "Toronto, Canada", 
    "17", 
    "134", 
    "abac-restaurante-barcelona", 
    7, 
    [
        "Spanish", 
        "Signature Cuisine", 
        "Hotel"
    ], 
    4
]