[
    "Mind. Blown. One of, if not the, greatest meal of my life. My wife and I ate there on June 4, 2013, and I will never forget that date. We also stayed at the hotel that evening, and it was worth the cost. They have very few rooms, and very many staff. You can do that math. We saw one other couple that was staying there during breakfast, but that was it.But I digress. Let's get back to the best meal of my life, yes? We opted for the first of two tasting menus. There are individual courses on the menu, but please do that right thing and just choose one of the tastings. I'll copy and paste ours here, if only so that every time I see my review, I will be reminded of how great it was.- Nitro cocktail - Mediterranean mussel curry with kaffir lime - Shellfish Bloody Mary snow and cured meats - Liquid Parmesan gnocchi with summer truffle with raw and roasted Mushrooms, cep water infusion with lemongrass - Foie-gras with figs, fig tree leaves ice cream and balsamic vinegar - Smoked steak tartare, seasoned snow-like beef, cooked egg yolk, veil of mustard and pepper bread brittle - Palamós prawn, Iberian pork tail and cutlet, coral consommé and curry bread - Casarecce Pasta with sea cucumbers, squid's water, \"Comté\" cheese and lemon basil - Salt-baked black grouper with a veil of glass, spicy roots purée and halophytes - Beef cooked in three ways, lemon thyme consommé, beef tendons and stir-fried mushrooms - Yuzu sorbet with yoghurt, basil and citrus zests - On a bed of smoked bread brittle, roast biscuit, banana, coffee, vanilla and bourbonThe Sommelier (totally deserves to be capitalized) recommended the Nun 2011 for our first bottle, and it was a terrifically clean and zesty white that played off of the multiple seafood plates perfectly. He recommended a second local wine, the Els Bassots 2010 Chenin Blanc that had a light mineral flavor (very good), though by this point in the meal I was too punch drunk by the food and wine to give it much thought.As for the plates, there was not a single low-light. The mussel curry tasted mainly of lemongrass until the curry sacks (I don't know how else to describe them) would burst in your mouth, and then the curry, mussels, lime and lemongrass combined into the most amazing flavor. The smoked steak tartare was covered in glass, so that we could see the smoke as it was placed on the table. Then, the waiters would lift off the lid and the smell of the smoke would waft around the table, so that the taste of the smoke in the tartare was amplified by the smell. Look, I could go over these dishes one by one, but it will just make me sad that I already had this meal, and won't be able to return there for some time.The serving plates were all stone, from quartz to slate, and there was also a ceramic plate in there somewhere. The plating was perfection. The service was perfection. The ambiance was perfection. The food was perfection. There was not a single flaw in this entire meal. I would argue that it deserves a third star, but that's for the Michelin guys to decide.", 
    "5.0", 
    "Stephen R.", 
    "Raleigh, NC", 
    "6", 
    "4", 
    "abac-restaurante-barcelona", 
    11, 
    [
        "Spanish", 
        "Signature Cuisine", 
        "Hotel"
    ], 
    4
]