[
    "We had a truly amazing dinner at Paco Meralgo on our first night in Barcelona.Without reservations we arrived precisely at 8:00 pm hoping to grab two seats at the bar. Lucky for us they had two seats open and we began a fantastic meal with dishes that relentlessly pleased and inspired.We started with a bottle of Luis Canas Rioja, which was one of the recommended house wines. For 26€ I thought it was an incredible value. Our first course was the tomato bread and Iberico ham, which were both superb. The tomato bread was actually better than the bread we had had at Tickets the next evening. Our next course was the stuffed meatball, which topped with a wonderfully creamy sauce. This was one of our favorite dishes of the evening and if we weren't so full at the end we would have definitely ordered another serving.The fried asparagus was very good. Lightly battered and fried crispy, they were like eating chips.The anchovy bruschetta was a bit of a challenge for my wife to like with very bold flavors, but I found it a unique dish that was a welcome departure from the typical foods we consume in America.The shrimp was by far the best dish we ate all night. When you walk in you can see the colorful shrimp sitting in a huge bowl on the counter. They actually grab these shrimp throughout the night and sauteed ours in garlic. A simple dish, but sensationally fresh and tasty shrimp. Just a wonderful dish.The porcini mushrooms were my wife's favorite. Sauteed in a rich sauce, the mushrooms were cooked beautifully and displayed a firm and slightly chewy texture. We couldn't stop eating these mushrooms!We ended our evening with the Catalonian french toast, which I highly recommend. Just the right amount of cinnamon and a light, fluffy and slightly crunchy texture. A perfect way to end the meal.Overall we had an amazing dinner at Paco Meralgo and would have loved to return for another visit had we had a few more days in Barcelona.", 
    "5.0", 
    "Pete V.", 
    "Alexandria, VA", 
    "248", 
    "407", 
    "alta-taberna-paco-meralgo-barcelona-2", 
    29, 
    [
        "Tapas/Small Plates"
    ], 
    2
]