[
    "I think reservations are recommended here. I say, \"I think\" because it was pretty packed when we arrived at 2:00pm on a Monday and we were barely seated. This was our first meal of the day and we were starving so we went a little crazy with ordering. We ordered the following:pan con tomate (1.85 euros per unit)like everyone here mentioned, their pan con tomate is some of the best found in the city. The bread pieces are huge and it's drowning in tomate, just the way I like it. It's not too oily and it isn't as soggy as it's found at most places.encenalls carxofes (4.90 euros)fried artichokes. these are found all over Spain and whenever you see it on the menu, order it! patates braves (3.90 euros)some of the best patates braves we've had. The potatoes were cooked all the way through, crispy, and we all loved that it was a bit spicy. croquetes pollo (1.40 euros per unit)The croquetes are not to be missed. My favorite! Perfectly crisp and fried and the insides are delicious. croquetes de sip (1.50 euros per unit)if I remember correctly, I think this was squid. It's black inside and rolled up into a ball. It's creamy and really good. montadito salmon (3.10 euros per unit)montadito are like crostinis, crusty bread topped with something. In this case, it was smoked salmon and because the salmon was of high quality, this was delectable.montadito brie (2.95 euros per unit)It's brie. You can't go wrong with a thick piece of melted brie. xipirons (11.90 euros)Fried baby squid. I really enjoyed this but my friends didn't. I don't think many people enjoy eating whole baby squids. trufes gelades (1.05 euros per unit)We ordered this as a desert. It's really small, not too sweet, and to be honest, probably wouldn't order it again. Overall, this is a must visit tapas restaurant. They have most of all the traditional Spanish tapas here and they do an excellent job. The restaurant is clean, customer service is good, and bottles of wine are cheap. What's to hate?", 
    "5.0", 
    "Rose C.", 
    "New York, NY", 
    "190", 
    "263", 
    "alta-taberna-paco-meralgo-barcelona-2", 
    22, 
    [
        "Tapas/Small Plates"
    ], 
    2
]