[
    "There aren't many places that are open late on a Sunday night, so I was glad we were able to make a reservation here, knowing our flight was getting in late.  The place looks very clean, and we had read it was more touristy and expensive, but I think it depends completely on what you order.We started off with glasses of Spanish red wines, which were very generous pours for under 5 Euros, I had a rioja reserva, and we also had a ribera del duero.  Para comer algo....- Tomato bread: perfectly crusty outside and soft inside, lots of tomato, good olive oil- Gazpacho: pureed nicely but still with some texture from the bread. It was almost creamy and wasn't overly acidic.  This was probably the best gazpacho I've had and the only one that did not taste like salsa - Patatas bravas: fried twice, nice and crisp, topped with a spicy garlicky aioli and chili oil. I don't like aioli, but the garlic flavor was nice, and this dish was pretty spicy- Padron peppers: nicely roasted and blistered, topped with large flakes of seasoning salt; this dish was a bit too oily for me- Ham and chicken croquettes: like chicken cordon bleu inside a fried exterior - good in a way, but one bite was enough- Cod fritters: a good amount of bacalao and smooth potato filling, not too fishy, more interesting than the croquettes- Grilled razor clams: these were grilled nicely with a subtle char flavor, good with a squeeze of lemon- Italiberico sandwich: a \"ham and cheese\" sandwich with amazing melty cheese. The bread outside wasn't over buttered like American grilled cheeses, and it was griddled perfectly and almost like a pita.The highlights were definitely the gazpacho and the \"ham and cheese\" sandwich.  In the end, it was about 48 Euros for the 2 of us, and we were stuffed.  It can get expensive if you venture out to more seafood, but I was satisfied and very full from our choices.", 
    "4.0", 
    "Marilyn T.", 
    "Mountain View, CA", 
    "339", 
    "1490", 
    "alta-taberna-paco-meralgo-barcelona-2", 
    18, 
    [
        "Tapas/Small Plates"
    ], 
    2
]