[
    "We found this place on Yelp by looking for a paella place.Walked in on New Year's Eve without a reservation.  They had a set menu for the night and let us sit at the bar and tried their best to get us a table.  Even though we couldn't order paella, the meal was very good!  The manager and staff were very friendly and accommodating, especially given that we did not have reservations and it was a holiday.  The pacing of the meal was a little weird, as we waited about 20-30 minutes in between the 4th and 5th (out of 8) courses.  I think the kitchen might have gotten backed up.  For the most part, they timed it well and passed out champagne and grapes a little before midnight.  As for the food:Foie Gras Mousse with apple, brioche, and litchi foamkind of weird but surprisingly tasty 4/5Sea Scallops Tataki, sweet corn cream, basil oil, lime oilmy favorite of the night. scallops were cooked perfectly and I loved the flavors 5/5Poularde Ravioli, wild mushrooms, onion cumin sauce, sproutsdelicious filling and great flavors 4.5/5Wild Sea Bass, truffled cauliflower puree and green cockles sauce and eggplantsThe green cockles sauce and eggplant on the side were not my favorite - just too many of my least favorite flavors - but the puree and the fish itself were wonderful. 3.5/5Iberian Pork Filet with artichokes and couscousThe meat was a little overcooked and tough but was seasoned like an American pot roast.  Couscous was also slightly under.  The artichokes were a nice addition.  3/5Pineapples in Mezcal The pineapples, despite being marinated in mezcal, were only slightly alcoholic and surprisingly delicious. 4/5Tarta de Santiago almond cake, smoked cheese sauce, peach ice creamThe cake was a tad dry for my taste, but I applauded the flavor combo of almonds, cheese, and fruit.  4/5Come for the interesting food and great service.  Thanks again to staff for a great last minute New Year's Eve menu and evening!", 
    "5.0", 
    "Christina G.", 
    "Walnut Creek, CA", 
    "42", 
    "204", 
    "arume-barcelona", 
    6, 
    [
        "Mediterranean", 
        "Tapas Bars", 
        "Galician"
    ], 
    2
]