[
    "Great place to stop after you've braved the lines at the nearby La Pedrera. Trust me, you'll need to sit down after spending an hour or two taking in Gaudi's masterpiece apartment. The high-topped marble tables and dark wood lend itself to a clubby feel. Complete with the club soda syphons I've come to recognize as accompaniments to Spanish vermut (vermouth), I had a feeling we were in for a treat. Since our first visit (we came back for dinner on a different night) was a mid-day snack, we opted for one dish to share - the Carpaccio d'Ou Ferrat. It's nothing I've seen before, and I'll be elated if I ever see it again on a menu. It can be best described as a plate of runny egg, shrimp, herbs and something that could be crispy fried onions on top. It was sublime; a dish I will file away in my memory banks, since I have a feeling I will never come across it again. Our second visit was for dinner and we made piggies of ourselves. It was heaven. Steak and foie - three tiny pieces of VERY rare (just like I like it and can never find it in the U.S.) topped with a generous piece of foie. Buttery, calorie-laden and delicious. And this is coming from someone who doesn't typically like the taste of foie gras. Clams steamed in a ton of garlic and wine - good follow up to rich steak. Fresh and tasty.Bar Mut's take on cannelloni - leek acted as the traditional pasta \"wrapper\" with fresh crab inside and topped with lobster sauce. Concept was great, but the leek was way too tough and hard to cut through. Steak tartare - goes with my love of rare steak. It doesn't get more rare than tartare. I don't order this very often, actually I don't know if I've ever had it in the U.S. Bar Mut's version was perfectly seasoned with lots of capers, mustard and worcestershire. well seasoned. Accompanied by a great glass of temporillo, Bar Mut was a Barcelona highlight.", 
    "5.0", 
    "Lee H.", 
    "Portland, OR", 
    "310", 
    "1080", 
    "bar-mut-barcelona", 
    36, 
    [
        "Wine Bars", 
        "Tapas Bars"
    ], 
    3
]