[
    "Creative tapas menu in a cozy and lively bar.  The chef is fantastic.  I'm not wild about the aperitivos we were given (a plate of olives and a shot of beer).  I liked them okay, but in the context of our meal I don't think they added much( except 5.50 Euro) to the overall meal and I doubt we would have ordered either one. It's also kind of weird to be charged for stuff you didn't order.  I personally dislike these kinds of cover charges, but the rest of the meal was delicious and mostly reasonably priced, although if the cost of what you are paying for is important you will need to interrogate your server or you won't know what you've spent until the check arrives, as not all the items were on the board. We had called for a reservation but were seated at the first-timer section of the bar in front of the cash register instead of the table we were promised on the phone. The place was full and we like to go with the flow so we scrunched in and waited a while until our server was free to ask us about drinks.There's a varied wine list and some good local wines by the glass.  I was wild about my Copa Coca I Ficto blend and the spouse enjoyed his Copa Page cab.  The server asked about allergies and dislikes and recommended we allow him to choose the dinner.  We started with a very fresh, very tasty Burrata and tomato and pesto and escarole salad with a mild and complex vinaigrette.  A perfect start.  Our server had insisted we try the scrambled eggs, the Carpaccio huevos Fritos, and that was amazing, with crispy shoestring potatoes, a raw egg yolk that was stirred around (scrambled) the plate, and some nice pieces of lobster (they called it prawns but it tasted like lobster). The next course was the Calamarcitos, perfectly grilled small squids with garlic and pepper.  Delicious.  The fourth course was an ox tail called Rabo de Bieu, and this was our least favorite.  I grew up in a poor family so I am famliar with ox tail dishes, and the flavor was good, but the meat had been stewed off the tailbone and sculpted into a cake patty that was held together with marrow and fat.  The cake patty was centered on a lukewarm potato puree and neither of us cared for the potatoes in that form.  The spouse just doesn't like stewed meat but I thought the flavor was good, it was just too fatty for my tastes and I think the potato puree didn't complement the richness of the ox tail. We were full so it didn't matter, though as the bar cleared out and we could see to the other side, we saw fresh fish and wished we had known that was an option instead of the ox tail.  For dessert we tried the Gianduja maracuya, which was a delicate hazelnut cookie with a large glop of very dark (85%?) chocolate and a passion fruit sauce.  Spouse liked this more than I did.  For me, the passion fruit wasn't as ripe and fruity as I prefer and there was too much chocolate (Am I really saying this about chocolate?).  The cappuccini were delicious--very good coffee.  The total cost of the meal was about 96 €.  Our meal was the best we've eaten in Barcelona.  I loved being able to see the edge of the oven and watch a bit of the show in the kitchen (mostly blocked, but I could see a little of the food prep).  Apart from the ox tail and the dessert and the appetizers, everything was completely delicious, and the things I disliked just weren't to my taste but weren't bad food.  I would recommend that if you go here you make sure to say the things you really like instead of your biggest dislikes.  I don't know that we'll have a chance to return but I probably would if we were staying longer in Barcelona.", 
    "4.0", 
    "Leslie W.", 
    "Portland, OR", 
    "19", 
    "212", 
    "bar-mut-barcelona", 
    38, 
    [
        "Wine Bars", 
        "Tapas Bars"
    ], 
    3
]