[
    "I'm a huge proponent of the 'save the best for last' philosophy - when I was a child, I carefully ate only the toasted oats in my Lucky Charms cereal so I could later indulge in the sweet rush which came from savoring a series of deliberately homogenous spoonfuls of straight marshmallow. So, it's no surprise that I saved what I knew would be our most dramatically delicious meal for our very last night in Barcelona.And it was SO much more special than every last sweet milk-soaked Lucky charm marshmallow in the entire world! I had no reason to doubt it would be, as two of my closest friends recommended Bar Mut after their own magical experience the year prior. So we made our reservation for a Saturday night (or more precisely, a Catalan-speaking colleague made the reservation for us) and we looked forward to our date with Barcelona's sexiest restaurant with wild anticipation for the next seven days.Tick, tock.Finally, Saturday night arrived and we dressed in our chicest ensembles - black everything, our highest heels and smoky eyes. Though we knew Bar Mut is more casual than that, we also knew that our end goal involved a dalliance with what many consider Europe's finest bar: Mutis, the clandestine couture cocktail lounge located directly above Bar Mut. More on that in a bit!Everything about Bar Mut is beautifully-done, in simple, vintage-chic styling. I loved that we were greeted by just about everyone working in the restaurant, and how the handsome servers crouch on the floor to talk with you at eye-level. This is a seriously intimate way of going about business; it certainly won our wide-eyed attention. Instead of offering a printed menu, the server goes over all the specials in full detail from memory (yes, they can speak English if you'd like). It's impressive, and it's hot!We started with a voluptuous bottle of Coma Vella wine, a vibrant blend comprised of Carinena, Garnacha Peluda, Garnacha Pais, Cabernet Sauvignon and Syrah grapes. It set the stage beautifully for the parade of somewhat decadent dishes to follow, including a rich risotto and the house specialty, the crispy-skin pork. Whoa! The most excellent piece of pork I've ever had the pleasure of trying is difficult to describe in words; you'll just have to examine the photo that I've added! But do know that if they are serving it, you should order it. Absolutely!As we finished dinner we were asked if we could want for anything at all, and we decided to go for it: We oh-so-sweetly requested access to the aforementioned members-only club, Mutis. After our server spoke to several of his colleagues and made a call (and what felt like FOREVER), we were personally escorted to the base of the steps leading up to the exclusive Mutis. Well, the wait was indeed worth it because Mutis turned out to be every bit as 'Midnight in Paris' as Brett D so eloquently described. From the painstakingly-crafted cocktails, to the gorgeous staff who dotes on everyone, to the jazz band imported from New Orleans, to the patrons dancing like it was the end of the world, we now need another word for 'sexy' because it's simply inadequate, too underwhelming. Dinner at Bar Mut = 80€ each including a nice bottle of wine.Cocktails at Mutis = 20€ a pop (they're strong; you only need one).Grand total for an unforgettable experience = priceless.Spendy, but so very special.", 
    "5.0", 
    "Jelena Z.", 
    "San Francisco, CA", 
    "5000", 
    "1732", 
    "bar-mut-barcelona", 
    25, 
    [
        "Wine Bars", 
        "Tapas Bars"
    ], 
    3
]