[
    "Please note that this review is solely based on our dining experience at the Bar Mut's sister restaurant, Bar Mutis, the exclusive jazz club located upstairs. Solely as an exclusive, private jazz club, I would give it 5 stars.  I would absolutely go back for their amazing live music, delicious cocktails, and the authentic décor.  Unfortunately, we had no desire to stay and enjoy it after our dining experience...  Our hotel supposedly made us an 8pm reservation for 4 people at Bar Mut, the tapas restaurant on the ground floor.  We knew about their exclusive club upstairs so we were hoping to enjoy another highly recommended tapas restaurant, Bar Mut, and try to gain access to Bar Mutis after dinner.  Unfortunately, the hostess could not find our dinner reservation.  Given that it was a Saturday night, we knew it would be difficult to get reservations anywhere else so we asked if there was any way they could accommodate us.  Fortunately, we had a fluent Spanish speaker with us who spent at least 20 minutes trying to speak to the staff to figure out if there were any other options.We were thrilled when Bar Mut decided to give us bar seating at Bar Mutis.  We were told that we would be offered the same menu as Bar Mut so we were incredibly thankful.  Somehow, even with a Spanish speaker, either we were lied to or something was lost in translation.  When we asked for a menu, the server told us that HE was our menu.  Interesting.  He then proceeds to tell us that we would be served a set menu consisting of 4 courses that were to be shared.  We were confused and annoyed by this news but it was so late (almost 10pm) that we had no choice but to stay put.  On top of that, no accommodation was made for our friend who did not eat meat.  The food took forever to be served.  The first two courses were the only items our friend could eat and they also happened to be the smallest portions of salad and tuna carpaccio.  The third item was so unmemorable that I cannot even remember what it was but that likely had something to do with the insane finale.  We were served a really large piece of rare, bloody steak.  It was as though they forgot to cook it.     If it was not for their cocktails, I am not sure I could have even given Bar Mutis 1 star!  The drinks were delicious but at 20euros+ each, how could you expect anything less?? The bartender was very meticulous and friendly but the rest of the staff only continued to ruin our experience.  Throughout the meal, servers kept coming over to clear the food they had literally just given us and others told us that we needed to free up the bar space because the entertainment was scheduled to begin.  At this point, we had not even received all of our food yet!  The restaurant should never have agreed to seat us if they expected us to vacate even before their kitchen could prepare our food.  The 300euro price tag was ridiculous and clearly, we were taken advantage of.  Despite the amazing band that started to play towards the end of our meal, we could not get out of Bar Mutis fast enough.  Apparently, we were not the only ones victim to this scam...", 
    "1.0", 
    "S T.", 
    "Glen Allen, VA", 
    "4", 
    "24", 
    "bar-mut-barcelona", 
    21, 
    [
        "Wine Bars", 
        "Tapas Bars"
    ], 
    3
]