[
    "Loved this place. Were wandering around in the Eixample district trying to find a half decent place open for dinner on the 26th December (also a holiday in Spain), when we stumbled upon this place. The host was gracious enough to squeeze a seating for two even though we were walk-ins (another big no-no in Barcelona if not at touristy places).The meal was beyond brilliant. They didn't give us a menu but we had a brilliant waitress who was exemplary in explaining the dishes and helping us decide, in impeccable English. We had some Galician scallops done in the shell with olive oil, sea salt and parsley/basil. It was so good, we were sopping up the juices with their bread after. We ordered a plate of grilled in-season vegetables. Usually, I wouldnt write about vegetables, but boy oh boy. The flavors, and some local greens that I didn't recognize and the cooking in their Josper over made this one of the standout dishes.Our waitress also suggested a traditional Catalan holiday soup, Escudella de Nadal. It was a lovely delicate broth, pasta and meatballs, accompanied by blood sausage, chickpeas, potatoes, cabbage, and pork chitlins on the side to create your own taste. Every single accompanying piece was yummy on its own, but the end product was brilliant. Something we would have never usually ordered given its extremely traditional status and the fact that is usually served only around Christmas. Kudos to our waitress.We followed this with the best dish of the night. A piece of flounder-like fish, that was grilled on top of vegetables with sea salt. The incredible technique and freshness/quality of the fish, had me licking my chops long after we devoured it. Highly recommended. The food here was overall great, but they really seem to do seafood very well. For dessert we had the highly recommended (from two of the servers) \"French toast\" even though it sounded odd. However, it was a Spanish style piece of delectable fried airy sweet bread on a pool of dulce de leche with a scoop of the most amazing smoked ice-cream I have ever had. This place could be classified as an upscale Tapas bar (they sure are not cheap), but this is imaginative, modern tapas that you won't find in your typical tourist traps on Las Ramblas. There is a lot of authentic food from Catalan and other areas of Spain with a touch of modernism and originality. They also have a good wine list, and we were very happy with our bottle of the 2013 Els Pics from the Priorat region of Catalonia, with its prominent Grenache makeup with some blend of Cariñena, Syrah and Cabernet.I would return here without a doubt. This was our best meal in Spain and given the quality of the food, very reasonable as well (as frou-frou dining in Barcelona can quickly drain your budget/wallet).", 
    "5.0", 
    "Manav S.", 
    "Dallas, TX", 
    "10", 
    "4", 
    "bar-mut-barcelona", 
    14, 
    [
        "Wine Bars", 
        "Tapas Bars"
    ], 
    3
]