[
    "Ah, Bar Mut... how much do I love thee? Let me count the ways. 1. You officially launched what was our best night in Spain (quite possibly ever?) and I assure you, it was no coincidence.2. Adorable confines. What seems from the outside like any 'ol neighborhood corner spot is actually a bustling, lively, fabulous, vintage-stylish bistro. Small and quaint, just like we like it, but brimming at the seams with personality.3. The staff. Hmmm... what can be said about the staff? Friendly. Hot. Knowledgeable. Hot. Funny. Hot. Accommodating. Hot. There's a hefty dose of Barcelona Brodeo up in here. From the charming chefs peeking out of the open kitchen to the studly servers that appear to make the rounds helping all tables, there was no shortage of, um, friendly faces.4. Wine. Wine. Wine. Stunning glass cases of it line the walls! Bar Mut may be small, but the wine list is not. From local and cheap - but totally tasty - reds (we loved the Lasendal), to crisp and beautiful whites, to thousand dollar+++ bottles of champagne, even the snobbiest of vino snobo's will be impressed.  5. Seriously some of the best food we had all trip. Amazingly fresh seafood, rich and decadent sirloin and foie gras, grilled octopus, butter-laden razor clams, risotto to die for. And the tastiest sea urchin in the shell that has ruined for me all post-erizo (that's urchin, folks) experiences stateside. Bar Mut does it all and does it best. 6. There is a picture on their wall of the owner with Ferran Adria. If Bar Mut is good enough for Ferran, it's good enough for you. Believe it. 7. Dessert. The pine nut ice cream rocked our socks off. Creamy, nutty, salty (um, that's what she said), it was all flavors packed into one for a purely blissful last mouthful. 8. Invites to Bar Mut's super secret, super swanky, super sexy nightclub. Like a scene out of Midnight in Paris, if you're lucky enough to receive an offer for a night cap here, TAKE IT. 9. No. You'll never be able to find said club or get in on your own. 10. Did I mention the staff? Yeah. They rock. Many thanks for a little insight to real Barcelona. We loved it!  Go. Go. Go.", 
    "5.0", 
    "Brett F.", 
    "Chicago, IL", 
    "1539", 
    "1050", 
    "bar-mut-barcelona", 
    46, 
    [
        "Wine Bars", 
        "Tapas Bars"
    ], 
    3
]