[
    "Found this place on yelp and was excited to try it since I've had good luck with yelp in Barcelona so far. I was looking for the best place for paella and this restaurant came up. This restaurant is rated as a three euro sign. So for that price tag I'm expecting good service and good food. However yelp steered us wrong this time. (We should've known considering this is a big restaurant on a Main Street with menus in different languages = tourist trap.) A restaurant of this size should have a lot more reviews. And now that I look at their photos (the professional ones with the white background) I'm sure the restaurant uploaded them along with their fake reviews. There's no way this place deserves 4.5 stars or even 3 for that matter.The food was bland and flavorless. To make up for the lack of flavor they added a lot of salt. We had the calamari, paella and the black ink cuttlefish. The calamari was cooked in a tempura batter and there was no flavor to it whatsoever. The only sauce they had for the calamari was mayonnaise. I asked for marinara sauce and or cocktail sauce and the waiter said no. Um, ok. The paella and black ink cuttlefish came out. The server asked us if we we're going to be sharing our dishes which we were. I saw him from afar On a different table giving us half of each meal on our plate. I was disappointed because I like to take pictures of the food (especially when I think it's going to be tasty) and part of the joys of eating is admiring the presentation of the food. In this case there was none. Also as other reviewer's have mentioned the service here is horrendous. They don't come to check on you, you have to wave them down in order to get something and they are not attentive at all. Our waiter was not good at all. It seemed as if they were rushing us so they can move on to their next customer.My best advice is to steer clear of this place especially for the money that you will be paying. I highly recommend going to this cheaper place that is 10x better and will be worth every penny  you spend there - Arcano!", 
    "1.0", 
    "Van N.", 
    "Anaheim, CA", 
    "0", 
    "4", 
    "barceloneta-barcelona-3", 
    12, 
    [
        "Mediterranean", 
        "Seafood"
    ], 
    3
]