[
    "Flight was €18! I know, I know...that's a bit steep.However, they are like...really large samples of each beer in the flight. So much so that I didn't finish my flight.This spot is a lot less brewery and a lot more \"gastro pub\". They make all their beers, but the look and feel of the place is a lot more like a restaurant than the traditional brewery.I went dark crazy here, which I kind of regret. I'm a sucker for porters and stouts...but with the servings so large, I was stuffed. I could of gone for some lighter stuff in between the heavier beers, but these are decisions I'll have to live with for the rest of my life.Raspberry milk stout - creamy with a strong raspberry flavor up front and a nice toasty flavor on the back end.Cocoa imperial stout - crazy chocolate smell and flavor. Bittersweet, thick and delicious. Smells like a double chocolate cake.Monserrat - another stout but way tamer than the first two...no crazy flavor here. Would of liked a little more carbonation on this one, but it was solid. This is a solid brew for everyday, not like the others that were super sweet.Vanilla Black Velvet - imperial stout! Super creamy - dessert in a glass. This is another one like a delicious, decadent chocolate cake! This was the best one out of the batch.Rising tide - American pale ale (suggestion of our server). One of these things is not like the others - Obviously nothing like the rest of my flight lol . It's a bit hoppy, subtly. Easy drinking and would be nice on a hot day.While the price is super steep, they were solid brews. I could of really gone for smaller samples of each like a more traditional flight, but I was stoked to be able to try a few beers in one sitting regardless.The staff was super nice and walked me through the offerings. They also do food, but we were headed to dinner, so we passed. Overall it was a great pitstop!", 
    "4.0", 
    "Blue A.", 
    "Sunrise, FL", 
    "1471", 
    "798", 
    "biercab-barcelona", 
    2, 
    [
        "Breweries", 
        "Pub", 
        "Gastropubs"
    ], 
    1
]