[
    "Blavis is a hidden gem outside the touristy part of city of Barcelona but those who have made it to this place have been given it enough credit to become the number 2 restaurant of Barcelona on TripAdvisor. Reservation is required for this small hole in the wall- 14 seating restaurant.  We were lucky that someone had cancelled an 8 pm reservation (try to send them a message via their Facebook).  We got the L2 metro lane from Las Ramblas and 20 minutes later we were at the door of this garage like place.  We were greeted by Paco (whom I respectfully I like to call our journeyman!) and all the dishes were delivered by the chef who was Peruvian.  Extremely intimate vibe, as Paco went over each line of menu. The menu consists of a classic selection of tapas and a seasonal part that changes from time to time.  It give options to vegetarians, meat and seafood lovers and introduces you to tapas style dishes with Spanish, Mexican, Peruvian and Asian influence. We were the first party to arrive and as the tables started to fill one by one the vibe of an intimate surrounding started to build up.  Paco recommended a great wine (Tempranillo).  For the start we wanted a simple salad and chef conveniently managed to prepare it off the menu!  Each dish was prepared with great care and presented delightfully.  Even though Paco suggested that 4 tapas would be enough for the 2 of us- the dishes were such a unique experience that we went of ordering one after another!   The grilled octopus on a bed of mashed potato, veal cheeks that fell apart on your first attempt, a marinated raw fish crudo (Peruvian and Japanese influence of the chef), crab burger on a mille feuille crusty bun, an open taco style topped with shredded pork and avocado and broken eggs and cheese on top of potato fries were part of our culinary experience.  Even though we really didn't have any more room, but we finished off with a tiramisu and vanilla ice cream (we really could have eliminated this part!).  Our bill for 7 Tapas- one bottle of wine and one more glass of wine and 2 deserts came up to: 103 Euros- compare to any culinary experience indeed a bargain.   Blavis lives up to its reputation in a big way, great food- top notch intimate service and very reasonable price- what else one can ask for?", 
    "5.0", 
    "Megan K.", 
    "Moraga, CA", 
    "36", 
    "67", 
    "blavis-barcelona", 
    1, 
    [
        "Mediterranean", 
        "Signature Cuisine", 
        "Tapas Bars"
    ], 
    2
]