[
    "Beware! Stay away!I don't get what all the hype is about. This is a place that appeals to a bunch of study-abroad students who think this is \"OMG\" \"literally\" the best meal ever (hearing this, while standing in line, should have been our clue)!! First and foremost, this place is in violation of every single health code imaginable. Raw meat (chicken, steak, and ground beef) sits right next to the rice therefore, the juice of all this raw meat travels to the cooked rice and all over the counter. The personnel pick up the raw meat with their hands, not wearing gloves of course, and then go about making your sandwich or peel potatoes. Do they not know what sorts of bacteria exist in raw meat? Either No they don't, or they don't care. The sandwich bread sits on the counter! Yes on the same counter where 2 inches away are the plastic bottles of sauce and 10 inches away sits the pile of raw meat. If you think I am painting too gross of a picture, well, you should have been there. The girl working there touches her hair, rubs sweat off her neck while holding my sandwich in her other hand. Then they put rice and lentils and cabbage and all sorts of things in a baguette sandwich that just does not make sense. What happened to the good old prosciutto and butter or cheese, with some lettuce and tomatoes in a sandwich?For the quality of the food (which is non-existent) and the filth that craws all over this place, event the 3.50 euros is a total rip off. Save yourself time and money, go to the bouqeria off of La Rambla or anywhere else in the Barri Gotic, get a nice, decent sandwich, premium quality ham or salami, for 3 euros and call it a day. I have to admit that I feel so stupid for taking a bite out of that sandwich before throwing it out. The bland taste was all the more reason to hate myself for putting me through such a horrid experience. In a city that is stacked with hidden culinary gems, what a waste of meal was this. Yelp and TripAdvisor failed us this time...By the way, if you don't believe me on the raw meat next to the rice thing, just flip through the pictures that people have posted. Ick!", 
    "1.0", 
    "Sonya M.", 
    "Washington, DC", 
    "0", 
    "132", 
    "bo-de-b-barcelona-3", 
    17, 
    [
        "Sandwiches"
    ], 
    1
]