[
    "It's like an over hyped Subway with hard bread.I went here because I kept seeing a huge gathering of people waiting to be served. That usually means something special is on offer. One day I noticed the line was only made up of one couple of I decided to pounce.First up, the woman who served me was very rude. She just leans over the counter and points at you like you're annoying her. Once you give her your order she just turns away and goes to make it. Doesn't confirm the order or even make a noise to say she understood you. Not to mention the look of death upon her face as well.The same woman then flicks her hand at the group of people outside in order to get them out of the way so she can speak to people behind them. I felt like I was a fly on the food or something. Next thing she did was when a couple from out of town was picking the sauces they wanted on their sandwich they happened to step inside the shop so they could see them and hear her. She was not at all happy with that and quickly told them to get back outside.I put up with it (which I don't normally do, I usually leave places which treat me like this) because I was expecting something amazing to be the outcome. What I got instead was some pretty nice tasting chicken in the sandwich but that's all there was to really write home about.The bread was hard and hurt the roof of my mouth. The fillings (peppers, lettuce, and mayo) were all very soft from being out all day. Not to mention the shape of the bread makes it pretty difficult to eat without getting covered in chicken juices.I actually said to my girlfriend I would have much rather went to Subway because customer service is better and you don't feel like scum when you leave, not to mention the bread doesn't cut you a new one when you try to eat it.Overall, terrible place and the only reason it's getting 2 stars is because the chicken actually tasted pretty good.", 
    "2.0", 
    "Greg C.", 
    "San Francisco, CA", 
    "72", 
    "10", 
    "bo-de-b-barcelona-3", 
    54, 
    [
        "Sandwiches"
    ], 
    1
]