[
    "Bobby Gin was my go-to bar while in Barcelona. I think I actually ended up here at some point every night during my visit. The location is tucked away along the side of the wall in a sketchy alley. There is no sign. Your only indication that this place is here will be the doorman outside to hold the line when all the seats are taken inside the bar. Luckily, I didn't have to experience a line each time I came.Obviously by the name, you should guess that this bar specializes in gin cocktails, mainly gin and tonics. Ironically, I don't like gin or tonic but I was still somehow compelled to come here and try their crafty interpretations on the drink. First of all, the gin and tonics are HUGE. The glass it comes in is seriously as big as my head. Holy crap! They had four interpretations of the classic gin and tonic, made with different types of house-infused gin and they were all delicious:- The Hendricks Ginfolk: gin infused with rose tea and made w. fresh strawberries, lime, \"vegetal elixir?\" and tonic- The No. 3 Gin & Tonic: this one was my fav! Made w. Citronella, bitter orange and tonic- Tangueray 10 Ginfolk: made w. tangerine, agave nectar,  bitter chamomile, kaffir lime and tonic- Tangueray 10 Gin & Tonic: made w. kaffir lime, grapefruit bitters and tonicTwo other drinks that I tried: - The Patent: made w. tequila, absinthe, punt e mes, fig liqueur, grapefruit bitters. This drink was phenomenal and had a bit of a bite- Santa Maria: made w. gin, chardonnay, milk thistle syrup, thyme, sage and lemon juice. This drink was very interesting but I felt pretty indifferent about it. It was strong though. The food was okay, but honestly not too memorable. The cheese used for the cheese fries was a bit sharper than I expected. I expected it to be either mozzarella or similar to mozzarella and the jam that came with it didn't do it much justice. The drinks came out to about $13USD each which I thought was standard drink prices if not slightly on the cheaper side for a speakeasy, at least compared to DC.", 
    "5.0", 
    "Victoria B.", 
    "Washington, DC", 
    "773", 
    "296", 
    "bobby-gin-barcelona", 
    3, 
    [
        "Gastropubs", 
        "Modern European", 
        "Cocktail"
    ], 
    2
]