[
    "Boca Grande was recommended to us by the front staff of our hotel. The restaurant is situated in a small alley, just off Passeig de Gracia which is one of the main shopping streets in Barcelona.We had 4 in our party and decided to eat family style so that we would have the opportunity to try several things on the menu.  *Fresh Fish - They brought by on silver platters, a couple of fresh fish to see if we had any interest. Each had a tag with weight and price. One looked almost like a stingray so that was a definite no. The other looked like your standard fish so that's what we chose. The fish is baked whole, covered by a mound of sea salt. They showed us the fish right before it went into the oven. After baking and once the salt is brushed away, the fish is then filleted and served with a side of lemon juice and oil. I believe this is a traditional Catalan way of making fresh fish. I have no idea what kind of fish it was but it was delicious. Extremely fresh and clean tasting...no fishiness. This was accompanied with a side of mixed vegetables (broccoli, cauliflower, asparagus, shishito peppers, potato).  *Vegetables and Mushrooms - We ordered this since my uncle wanted more veggies. The vegetables are served in a mini bamboo steamer with a dipping sauce. This was ok, nothing special.  *Mussels w/French Fries - Best mussels ever! Tiny in size but very tender and flavorful with a mild sweetness. The broth was great too. Even the french fries were amazing. We ended up ordering a 2nd order of this delicious dish.  *Black Spaghetti w/Seafood - I'm assuming the black spaghetti is squid ink pasta. There was an abundance of different seafood: shrimp, mussels, fish, clams, razor clams. The sauce was good. Overall a decent dish.   *Tiramisu - Not your standard tiramisu. The cake layers are wrapped with an edible chocolate shell and topped with chocolate biscuit pieces. I loved the crunchy topping.  *Nutella Croquet - Crispy panko-style outer coating with an ooey gooey nutella center. Sold by the each. We ordered 2 and wish we had room for more!  *Penis-shaped Cake - Obviously that's not the name of the dessert but I'm not sure what it was called. This dessert was displayed on the dessert platter and not listed on the menu which is why I don't know the name. Served with a scoop of vanilla ice cream. Not bad but I much preferred the other 2 desserts.All in all, we were impressed with the food and service was great too. Solid 4 stars!", 
    "4.0", 
    "Angela C.", 
    "Trabuco Canyon, CA", 
    "766", 
    "154", 
    "boca-grande-barcelona", 
    2, 
    [
        "Catalan"
    ], 
    3
]