[
    "I wanted to try a restaurant of the Adria brothers and taste the food that they're known for. Barcelona wasn't a great place for tourists because locals are very rude to you, even the cops are just upright rude. However, this place was a nice little touch of customer service and good food. Waiters don't work for tips in Barcelona so we've been getting bad service everywhere around Barcelona. That wasn't the case here. Our waitress was very polite, catering and worked with us on what to order.We weren't sure what to order, so she did the chef's choice where she just kept bringing out tapas for us to enjoy. She was very knowledgeable of everything that was served and catered to our food allergies. I wanted to try the liquified olives and I'm so glad we did, we tried two different flavors too. Not sure how they did it, but it was just delicious. Barcelona is known for their vermouth so we had to try it here, where they make their own. It wasn't my cup of tea...err, cup of vermouth but it was still pretty good and I'm glad I tried it. Of course, there were iberico jamon on the plate for options so I was thrilled to have it at Bodega 1900 where they cure it themselves (hanging in the storefront of the restaurant). The foie gras itself tasted like it was made in their backyard, everything tasted so fresh! The best part is, my girls loved eating everything and our waitress even got their own portions, which was nice. They had fresh squeezed orange juice refilled for them and was a great part of our meal. They were just oogled over and treated like adults as far as customer service went.It was all great until we got the bill. It was the most expensive tapas I've ever had, over $200 (they charged in euros). I wished the waitress asked us what type of bill we're looking to pay, because that was pretty pricey. I paid it and even tipped a bit because the service was wonderful. However, I removed a star because of that issue with the bill. Everyone has a price range of what they're looking to pay, they should have asked that instead of adding to our bill like that.I'm glad i tried this place out because we were told that a lot of the foods are cooked at Tickets as well, without us needing the months in advanced reservations.", 
    "4.0", 
    "Cindy W.", 
    "San Diego, CA", 
    "1864", 
    "1521", 
    "bodega-1900-barcelona", 
    9, 
    [
        "Tapas/Small Plates", 
        "Wine Bars"
    ], 
    2
]