[
    "Not sure what Rita V. was talking about, I've not seen skewer-style tapas here.She is correct, however, that it's a hidden gem, off the beaten path in the Barri Gotic; I rarely see other tourists here, mostly locals.  An employee at a local shop recommended it to us when we'd had really hit-or-miss experiences with local tapas.  Now we make a point to come here at least once (usually more) whenever we're in town.It's a smallish place with about 10 tables.  It has a wonderful cozy atmosphere, perfect for dates or just a nice meal with a few friends.  I brought a group of seven there once and we squeezed around their largest table; I'm not sure they could have seated a larger group.  If you plan to bring more than four people, I suggest calling ahead to reserve a table.The cuisine and wine selection is mostly local, but with a bit of a French influence (Catalonia is, after all, right next to the French border).  Our server, Gianni, is a delight and is happy to recommend a good wine to complement your meal.  His recommendations are always fantastic.It's generally served tapas-style, with a menu of small plates, many of which are commonly found at tapas restaurants, others are more unusual, all delicious.  The patatas bravas are the best I've had in Barcelona.  The Iberian acorn-fed ham is not to be missed.  The plate of artesanal cheeses is amazing, usually with two bries made of sheep's milk and goat's milk, a couple other cheeses, and a lovely sweet sun-dried tomato.  They're raw cheeses, which in my opinion makes them much tastier than any cheese you could purchase in the US, where unpasteurized dairy is outlawed in most states.  My favorite dish, however, is the sweet peppers stuffed with mushrooms, cooked in an amazingly sweet creamy sauce.I could go on, but I'll simply say that I've never had a dish here that I didn't like.  Enjoy!", 
    "5.0", 
    "Aleta D.", 
    "Barcelona, Spain", 
    "37", 
    "78", 
    "bodega-la-palma-barcelona", 
    8, 
    [
        "Wine Bars", 
        "Tapas Bars", 
        "Catalan"
    ], 
    2
]