[
    "The Adria brothers famous for El Bulli and Tickets Bar.  They have become restaurateurs with multiple restaurants in Barcelona.  Tickets Bar being across the street.  It's definitely easier to get reservations at Bodega 1900 than Tickets Bar.  The Ticket Bar's unique and modern tapas made every tapas/pinotxo restaurant I ate at look like amateurs.  Trust me.  I went to about 7 notable tapas/pinotxo bars within a two day period while in Spain.  Now, it isn't fair to compare Tickets Bar to Bodega 1900.  It's like comparing Peyton Manning to Eli Manning.  It's like comparing your successful friends to your broke friends.  It's like comparing Epicures to wannabe food bloggers.  It's like comparing me to other Yelpers.  We're just on another level.  It's like comparing high school girls to grown men who like gossip.  Actually, they're one and the same.  It's like when someone gives me a restaurant recommendation.  I just have this blank sarcastic stare on my face and my first thought is this place is probably garbage.  To be honest, 99.9 out of 100 times it is garbage.  On to the review since I had to get that off my overly pretentious chest.Anyway, Bodega 1900 has a more relax and comfortable feel to it.  The vermouth ode maintained the essence of the traditional foods.  It's definitely what I expected the atmosphere of a casual Spanish tapas bar to feel like.  It's lively, fast pace, loud and welcoming with a dark wood interior and the Joselito jamon iberico on displayed when you first walk in. The different ages of the jamon iberico hanging from the wall.  There's a bar area and tables all around with sidewalk seating.  The staff were all really nice and the dishes were explained well unlike Yelp reviews.  Now, la comida.  We went with a bunch of different tapas off the menu. 1) \"Quisquillas\" - It was a serving of small fried shrimp tossed in flour.  I could have eaten it all day.  The shrimp was soft, fluffy and reminiscence of shrimp I ate at Taian in Osaka.  It was very light, lightly salted and evaporated in your mouth like tab of the finest acid you could find in the early 2000s.   2) Traditional Beef Stew - The beef stew was served with mushrooms.  The stew had a very comforting but very robust flavor.  The little mushrooms were plump and soaked up the stew very well.  The tender chucks of braised beef broke apart like 5 year marriage.  3) Croquette - This was definitely one of the more memorable croquettes I've had.  The croquette was mixed with \"joselito\" iberian ham.  The croquette came out piping hot like Beyonce at the 2016 Superbowl halftime show.  The crunchy fried breadcrumb had enough crispiness to it and the inside of were soft like Drake's line \"Just throw up while I hold your hurt back.\" or \"I pop bottles because I bottle my emotions.\"  Yup.  That soft.Overall, Bodega is a nice plan B when you can't get into Tickets Bar.  It definitely does not compare to Tickets Bar.  I wish I went to Bodega 1900 before I went to Tickets Bar.  However, I went to Tickets Bar the night before and it definitely ruined my Bodega 1900 experience.  The food is a lot more comforting than creative.  It was a lot more simple than artistic.  The flavors were not as bold as Tickets.  Lastly, I still enjoyed my experience at Bodega 1900 and the food was definitely good.  It's a nice option for simpletons.", 
    "4.0", 
    "Steve N.", 
    "Westwood, CA", 
    "854", 
    "693", 
    "bodega-1900-barcelona", 
    2, 
    [
        "Tapas/Small Plates", 
        "Wine Bars"
    ], 
    2
]