[
    "Let me preface this by saying I really wanted to love Bodega 1900. I had heard the accolades about the Adrià brothers, read the reviews, had gone to see their demonstration while in Miami, and I absolutely couldn't wait to see what they could do. Since we were unable to get reservations for the renowned Tickets (we later discovered they were hosting a private event that night), we figured we would try Bodega 1900 instead so that we could get their take on the traditional fare of the region.The prices are a bit higher than your average tapas place, which is often the case with such a notable chef. It doesn't tend to bother me so long as the cuisine itself lives up to the accolades. However, instead of an unforgettable meal that I couldn't stop raving about, I just found myself feeling a underwhelmed. Maybe it was an off night, or we ordered the wrong items, but I just don't get the hype. Also, other than the olive \"spheroids\" I don't really understand the reviews that consider this place imaginative. It is very conservative. As much as I try to avoid comparisons between one restaurant and another, I found it impossible not to compare Bodega's gastro take on olives to the others we had during the course of our trip (Disfrutar and El Celler de Can Roca). The snow crab toast was also similar to one I had experienced at ABC Kitchen in New York, and the rest...well they were no different than any other tapas place we went, and that includes the generic market stalls. Moreover, they lost to others on almost every front. While I cannot deny that the ingredients themselves were fresh, I couldn't help feeling let down by each item we ordered. Some items were over salted, others just plain bland, and overall I just couldn't help but to think...that's it? The Iberian ham croquette was competent but unremarkable. Ordering the manchego reserve cheese meant a small plate with just three wedges. No bread, no honey or nuts, none of anything to make it better in any way to the fare you would find in a local grocery store. The pan con tomate was possibly the worst version of the dish I had during our time in Spain, with the bread being slightly burnt. Although the space itself is beautifully decorated, it is also very small. The tables are practically on top of each other. From what I overhead said by the patrons around me munching on their tiny sandwiches slathered in mayo and over-fried calamari, it seemed that no one was thrilled with their meal. Moreover, I don't normally care much about service, except when the staff is just outright rude as ours was. Not only was he unfriendly with us, but when he knocked into the table next to us and spilled their water, he didn't even apologize to them. For being under the umbrella of such an impressive culinary pedigree I would expect better training of their staff. Again though, maybe it was just a random fluke of bad luck there.In Spain I can think of at least a dozen better options when you're looking for tapas, and if you really want to try something from the Adrià brothers and Tickets is unavailable, I'd suggest El Niño Viejo Taqueria instead. They may not be serving local dishes but it is a more satisfying choice.", 
    "2.0", 
    "Stephanie L.", 
    "Miami, FL", 
    "470", 
    "367", 
    "bodega-1900-barcelona", 
    5, 
    [
        "Tapas/Small Plates", 
        "Wine Bars"
    ], 
    2
]