[
    "We had some initial hiccups but this place was probably our second favorite meals in Barcelona. Ok, so we couldn't get reservations to Tickets and I know Bodega may at times feel like the ugly step child to Tickets but i think this restaurant can stand on its own, outside the shadow of Tickets. First off, I would say that our waitress was really rude. She took forever to wait on us and practically threw things down on our table. Yes, we were annoyed but there was another male waiter who was extremely nice. We stopped looking for our female waitress and just started to ask the waiter for all our needs. We were a bit jamon-ed out since this was the last meal of our trip so we opted for some lighter choices and boy I am glad we did. We got the tomato app, its just sliced cherry/ grape? tomatoes but they are some of the sweetest tomatoes I have ever had. i actually found myself craving these tomatoes from time to time. We also got the pickles, they pickle these mini  cucumbers themselves and its pretty tangy and sweet. The must try is the \"olives\" but more for kicks. It's fun to eat and yes, they taste like olives. I think this is the most popular dish at this restaurant. The razor clams were also super delicious, they had this black sesame (?) sauce that added the right amount of earthiness to the seafood. We also got the smoked mackerel which was super tasty. The mussels came in a tomato based sauce that was not to sweet, acidic, and just the right amount of heat. The oysters were super fresh with just the right amount of brininess and sweetness. Seriously, no sauce needed on these oysters. We got the empanada  looking thing and something else that resembled a mini hot dog but with fried seafood. They were both tasty but nothing remarkable. Oh and the chicharones is a yummy snack but its only like 4 pieces. We sampled three desserts, the yuzu mango sorbet with fresh mango (our fav), the fig with cheese and honey (2nd)... and skip the carrot cake. Its a little dry. I wish I had tried their jamon, I'm sure its super tasty. Oh well, there is always next time!", 
    "4.0", 
    "Esther K.", 
    "New York, NY", 
    "188", 
    "346", 
    "bodega-1900-barcelona", 
    23, 
    [
        "Tapas/Small Plates", 
        "Wine Bars"
    ], 
    2
]