[
    "Bodega 1900 was one of the restaurant highlights of my vacation in Barcelona. It was so nice I went twice! This is another creation of the Adrià brothers of Tickets and El Bulli fame. I opted for the tasting menu on my first visit and navigated the menu on my own on my next. I enjoyed the tasting but the fist half was more of a giant charcuterie board, I really enjoyed the 2nd half of the meal best. The manager, Angel, was our server the first night, he was great at recommendations and had a great personality. On one of the evenings a waiter picker up a guitar and started playing it for the tables. Some people come here because they can't get into Tickets, their sister restaurant across the street, in my opinion this place is equally as good, albeit a different style meal and it will not disappoint. It should be on your \"must-try\" list for Barcelona dining.Vermouth Cocktail - I would highly recommend getting this cocktail. they generally will offer it as it appears to be their house specialty. I never had one before and it was part of the reason I came here more than once.Fried Seaweed w/ Rice Cream - Decent starter. It is really something nice just to nibble on as you warm up for more delicious tapas. If you have had seaweed before, evening sushi, then you will like them in this chip formPork rinds and pickles - They were fine, tasted as expected. While good, I might pass on these.Tomato Salad - The highlight was the freshness and sweetness of the tomatoes, they came lightly salted in oil topped with some peas.Natural and molecular gastronomy olives - They taste just like olives it is the texture and presentation that is the most impressive aspect. The faux olive pops in your mouth.Parmesan and tomato crackers -These crackers, as expected, tasted like fresh parmesan. A little pricey but tasted awesome.Giant olives stuffed anchovies - I'm not a huge anchovy guy but still thought they were good. The pitted olives they were delivered in were massiveSea urchin and oysters - Just a raw bar tray, great presentation and tasty if you like this type of food.Smoked tuna and mackerel - It was just some really tasted sashimi, great tasting fish. I've never had raw mackerel before and I really enjoyed it.Beef cured in salt for 3 weeks - It tasted like some great roast beefMeat pie with ribs - These great little empanadas*Smoked salmon w/ truffle honey - One of the best tasting tapas I had in all of my travels in Barcelona. The complex flavor profile was outstanding.Razor clams - I discovered I am not a big raw clam guy, but the milky broth that came with these was tasty and added some flavors I've seen in thai foodHam & cheese croquette - Common throughout the city but extremely well prepared here*Spicy Squid Mollete - Fried calamari in brioche with garlic aioli and a kimchi chipotle sauce. This was not only another highlight from the restaurant but a highlight of my trip.*Truffle Bikini - Another must try item. This is essentially a grilled cheese with black truffle and a very nice ham. If you are a truffle fan this is especially satisfyingGrilled pineapple with molasses - Simple and palette cleansing dessert. Presentation was very niceApple tart - Traditional and perfectly executed apple tartChocolate cake - Just some chocolate mousse style cake and a chocolate ice cream. Not as inventive as other dishes but if you are a chocolate fan it definitely hits the spot", 
    "5.0", 
    "Michael C.", 
    "Boston, MA", 
    "817", 
    "1294", 
    "bodega-1900-barcelona", 
    10, 
    [
        "Tapas/Small Plates", 
        "Wine Bars"
    ], 
    2
]