[
    "Spain... romantic, fun, hot and decently expensive given the USD to Euro exchange rate. Yet, before the grand exit... the final stage left walk... that one last goodnight; stands a final dinner at the Bosque Palermo. Yelpers all say it is worth the wait for paella and seafood so... SOLD! The wife and I are now sitting in the back room at a table fit for 2 lovebirds on their two year long awaited honeymoon. The room is a bit short as I am 5'11\" and the ceiling is about two inches from the crown of my noggin. The bathroom is really tight. If you ever wanted to go potty while washing one hand, drying the other and eating dinner at your table, this washroom works perfectly for that.The server is a very nice man who speaks somewhat ok english. No pressure and super smiley.We ordered the paella, mixed seafood plate and the mont-ferrant gran cuvee brut sparkling wine. Given all the reviews,  it would be a travesty not to.The wine arrived first. Light, refreshing and cool; it hit the spot for two thirsty lovebirds looking to quench a fire superheated like only a 10 day honeymoon can. We toasted to a fine honeymoon and wondered when we would be back next.The \"starter\" course was the mixed seafood plate. \"Ohh myyy!\" as our beloved Uncle George (Takei on FB) would say.The mussels and cockles sat perfectly with the white wine sauce. Just the right touch of olive oil to boot. The salmon... perfectly cooked and flakey. The last time I had salmon this good, my boss caught it himself in the waters off British Columbia! Now, the merusa (a white fish) was something else. So fresh and tasty. That overall taste was just a harmonious mix of flavors. Individually,  they rock just about any dinner plate but together, well... it's just sinful. Good thing there are so many churches here I can go confess in. (You need to see the pics to believe this! )Now, about the paella. I've been here in Spain for 10 days now and eating paella just about every day. I like to believe I know paella to a degree that 10 days would allow. The smell is just intoxicating. Salty but just the right touch. The saffron aroma is mouth watering! The mussels had this light tomato taste to them. As for the prawns... well, let me tell you something - despite the small amount of meat on those suckers, they were succulent. The paella sauce is creamy and just coats the rice enough to facilitate a smooth run down my mouth to my eager taste buds.Now, sip the sparkling wine with a mouthful of paella and whoa!! I am in FOODIE HEAVEN!Right about now (9:28pm) the room is packed. Tourists and locals alike crowd the establishment and I fully understand why. The paella was a very reasonable €10 per person and the mixed seafood plate €16.The mont - ferrant came to €13 a bottle.The wife wanted to try dessert at a shop close by so we opted to skip it here. So all in all, what a meal. 5 stars and counting. Will I be back? Let's just say I may not know when I will be in Barcelona again but I know I will be dining at Bosque Palermo should the opportunity present itself again. Two very satisfied and enthusiastic thumbs up!!", 
    "5.0", 
    "Ping O.", 
    "Winnetka, CA", 
    "59", 
    "24", 
    "bosque-palermo-barcelona", 
    56, 
    [
        "Spanish"
    ], 
    2
]