[
    "This place was filled with mostly Americans when we arrived at 8:45 pm.  This to us was not a good sign.  There was a couple from France at the next table.  We chose the place based on the Yelp and other reviews, and so apparently did most of the other patrons.  We ordered the seafood and the meat paella, along with a pitcher of sangria.The paella was nothing special.  The seafood was overcooked so that the mussels and clams and shrimp were completely dry--left too long under heat.  The rice was tasty and the octopus mixed into the rice was tender.  I have had much better paella in Barcelona this week, and in Spain on other trips.  We should have ordered two pitchers of sangria, and we would have had we known we would get no additional attention from our server.  The service was horrendous. Other reviewers who have commented that the service at Bosque Palermo is much worse than the usual laid back Spanish way have it right.  After spending a week in Barcelona eating at restaurants the entire time--this was our 6th night in town on this trip--this was not the usual leisurely pace we have no trouble accepting at other places.  But this was neglectful to the point of ruining the experience.  Our waiter kept flying by our table averting his eyes when we tried to order another pitcher of sangria or additional sharing plates.  Eventually we decided we'd just leave and carry on at a bar in the neighborhood because we were not going to get any attention.  We noticed the French couple next to us grew so frustrated they went up to the bar to pay and leave.  We managed to get our check 10 minutes later and I produced my credit card to indicate we wanted to go.  He said he'd be back with the machine.  25 minutes later, still nothing from our waiter, though he rushed passed our table numerous times with a finger in the air.  We cobbled together the cash necessary to pay the bill and handed it to him on the way out.Based on our week in Barcelona, you can do much better than this place, Yelp readers!", 
    "2.0", 
    "Franz L.", 
    "New York, NY", 
    "0", 
    "19", 
    "bosque-palermo-barcelona", 
    40, 
    [
        "Spanish"
    ], 
    2
]