[
    "This is our last night in Barcelona and we absolutely HAD to have real paella before we left.  The first night we got here, we tried some at a restaurant that we happened upon and it is the frozen stuff they heat up in the microwave/oven and bring out to you. I think it's called paellador. So after learning we just had the \"rip off\"/\"fake\" paella, we had to go somewhere where they prepared it in house. Their seafood paella was delicious!! MUCH better than the frozen stuff (of course) and had many flavor profiles to it.  The menu says it is 10€ per person and is about a 30 minute wait.  If you decide to go for the paella, get another dish or salad (we opted for vegetable soup- pretty good) so that you aren't sitting around anxiously waiting while your stomach gets mad at ya! There are options for the paella.  Seafood and \"mixed\", not quite sure what the second consists of but of course we got the seafood.  I would have to disagree with the previous poster about the amount of seafood in the paella.  I think it was sufficient.  Any more seafood, I feel would be overkill.  The paella itself already has pieces of chopped seafood and each person got one whole shrimp, one whole crawfish, about 4 oysters and 3 clams.  I don't remember it exactly, but I was just fine with the amount.  I don't typically eat seafood, so I may be biased but I eat paella so I can eat the flavorful rice!  Boy was it.. Flavorful! Worth the wait and €. I don't believe it to be risottoesque, but I have never had authentic paella before so I am not sure what it is supposed to be like.. All we had to go off of was our taste buds. They liked it.  The only downfall (hence the -1 star) is that the oysters needed to be cleaned a bit better.  There were parts of it that did not look familiar- I think most restaurants in the states may consider that hairy looking part to be trash.  We asked for the recommendation to accompany the paella- the server said that sangria goes well.  It wasn't on the menu, but is offered. We got a half pitcher for about 7€. A full pitcher maybe about. 12,50€ish. Our pitcher was about 3/4 full though, so it was a good deal at about 4 full glasses each.  When you decide to come here for dinner, just be aware that their wine menu is for bottles.  They will range in price and it does not specify if it is a glass or bottle...it is a bottle (or more accurately a carafe) full of wine. There are options for half carafes as well.  Service was quick, attentive, and no frills.  Just the way I like it!We spent 31€ on the soup, paella, and half pitcher of sangria. No buyers remorse here.", 
    "4.0", 
    "joy m.", 
    "Milwaukee, WI", 
    "2", 
    "36", 
    "bosque-palermo-barcelona", 
    109, 
    [
        "Spanish"
    ], 
    2
]