[
    "THIS. PLACE. IS. AWESOME. One word: HOUSE WINE (OK that's 2 words). The reviews are true -- massive pitchers for 3.70 euro. Are you kidding me???? Best deal in Barcelona no question. A GLASS at most restaurants is at least 4 euro, if not more. And it's not like this wine is terrible either -- it's pretty decent stuff -- and most certainly does the trick. Matter fact -- eating here was the first time I had been drunk off of dinner the whole trip, and considering my itinerary up to that point - Amsterdam, Berlin, Prague, Italy, France - that's quite a statement. The food just puts the place over the top. The seafood paella is the main attraction, it was well worth the hype. Deciding whether it was worth the wait, on the other hand, is perhaps a more difficult question, because the paella took at least 40 minutes to finally make it to our table after we initially ordered. However, the waitress was very apologetic about the situation, leading me to deduce that the long wait was more of an anomaly than something typical of the place. Luckily, it just gave us more time to get drunk off the wine, so we weren't too bummed regardless. My biggest complaints about the entire meal? The couple sitting next to us, seeing that we spoke English, leaning over and trying to strike up a friendly conversation. This was fine, of course, but being from Seattle they of course INSISTED on talking about the Seahawks and especially the 2014 NFC Championship game (I'm a huge 49ers fan). I mean, they were nice people and everything, but you gotta know not to go there. The wound is simply too fresh.But besides that, I have no complaints about the place. Some tips: Try to sit outside if possible, because the ambiance out there is great and it's a prime place to do some people-watching. While your food waits, try the tapas, which are good. Lastly don't be shy about the bottles of house wine - it's standard protocol to get several, and they're truly money well spent.In short: Bosque Palermo is a place to eat, drink, and be merry. Enjoy the wine!", 
    "5.0", 
    "Brian S.", 
    "San Francisco, CA", 
    "453", 
    "147", 
    "bosque-palermo-barcelona", 
    33, 
    [
        "Spanish"
    ], 
    2
]