[
    "First stop in Barcelona after a rough flight from Paris that had some delays. We looked up this restaurant on google map and tripadvisor that states this restaurant is top-notch. We started with little boulinnaise with prawns which turned out to be little 41-50 size shrimps situated in a bowl of soup/consommé that also had a slice of toast with cheese over it. The broth was slightly bland with little flavor yet enough for us to down it since we were starving.The second appetizer we got was blood pudding with onions and peppers with cheese. This dish had a slightly better outcome as the vegetables were superbly fresh, however it overpowered the little blood pudding they were supposed to present. The cheese was also an over-the-top which we both felt were unnecessary and perhaps killed the dish. We had our white wine with our appetizers and our entree. However, the waiter was unable to recommend anything to pair our food with. The simple knowledge of red wine with red meat, and white wine with seafood was something I believe all waiters should know, but also need to push your best wine to complete the meal. Our entrees were cod fish with tomatoes that I felt were a bit too salty and disappointing because it lacked the flavor and was unable to capture the freshness of the fish. The purée tomatoes were exactly what it was, which didn't exactly pair with the fish. The other entree was the squid with black ink and saffron, a great dish but not daring. It lacked the ink we were expecting, it was just an underlining of ink which weren't enough for the dish, which was great. While expectations were high for the entire meal, we have decided this will not be. We ended our meal with flan thinking this is the least they can make up for a meal which cost 75+ euro ($100+usd). Our flan was a generous serving differ from our entree and starters but with a catch. Our flan was served with an orange zest purée which was too bitter even for our palates. All in all, I can't vouch for this restaurant due to its expectations and price. However we enjoyed our little walk to this restaurant and even when we sat inside this little restaurant, but it all stopped once our food was served. Food: 2/5 Service/price: 2/5Ambience: 3/5", 
    "3.0", 
    "Joe M.", 
    "Brooklyn, NY", 
    "1", 
    "5", 
    "cafe-de-l-academia-barcelona", 
    23, 
    [
        "Spanish", 
        "Coffee & Tea"
    ], 
    3
]