[
    "Tips:1. Don't go, it's now overrated and over priced.2. If you do go, wait for a table at the bar don't book a table in the room behind.3. Don't let the waiter create the menu & serve you below average \"crowd pleaser\" tapas. Order fresh seafood a la plancha.After my visit this week, it's slid from one of my favourite restaurants in the world (I had been 3 times previously) to never again.  As we were travelling with a child, we booked a table 2 months in advance so we wouldn't have to queue.  What a disappointment.  The idea is that the waiter creates a tasting menu for you. We had the most average of tapas: chicken croquetas, pimentos, fried calamari, fried fish bait with soft boiled egg. The pimentos were just average. The calamari wasn't crispy.  Our tomato bread was soggy & cold, some burnt, and I couldn't taste any olive oil. The razor clams had sat on the pass too long so were cold by the time they got to us. The sauce of steamed clams, an old favourite was so salty we didn't want to mop up the sauce with our bread.  The other tables were served with scallops and when we asked about them the waiter said they might have run out, but when we looked unhappy about that they miraculously appeared.  Even another dish that I remembered so foldly - the tuna tartare - was served with slightly burnt toasts. We had to request the monkfish separately else they would ended there. When we asked about the gambas (prawns) that we had seen on other tables they said it was too expensive, 6-8 euros each. I would have paid for that except they had stuffed us with pedestrian tapas by that stage and I was a little too pissed to want to spend more money there. Perhaps I should have kicked up a fuss early on in the meal but I was still living on the memory of my previous meal. The only good dish from the evening was the tortilla with chorizo.  We paid 50 euros per person for this meal, with two glasses of house wine in total (not per person). So, sadly I've now crossed off this restaurant on my lists, there are much much better tapas joints in the city. I'm now wondering if the previous visits I had enjoyed the food so much because I had been drunk on cava as we had to wait 45 mins in line. Ah well - never again.", 
    "1.0", 
    "Chocci C.", 
    "London, United Kingdom", 
    "1", 
    "20", 
    "cal-pep-barcelona", 
    43, 
    [
        "Mediterranean", 
        "Tapas Bars"
    ], 
    2
]