[
    "Overrated and not worth the wait.  If you can get in without much of a wait (good luck) then I think it's  worth a go.  However, if you find yourself standing towards the end of the line up against the wall (or heaven forbid, OUTSIDE the door), there are many other good (and superior) options nearby.Cal Pep opens at 7:30 pm and we arrived at 7:15 pm, which put us squarely at the end of the sorry queue perched along the back wall, watching everyone who had come in ahead of us sitting at the counter and enjoying a delightful meal.  Sometimes coming as a larger group does pay off, as they would take in parties of 4 ahead of smaller parties to sit at tables outside in the back.  But singles, pairs, and trios were otherwise fated to wait for a seat at the counter.Thankfully, each service took only about 45-50 minutes, but during that time we noticed that this place probably gets a lot of positive foreign press.  We felt surrounded by many English (or non-Spanish speaking) diners, and even one couple brandishing a Delta Airline Inflight magazine article featuring the restaurant and its owner, seeking an autograph from the man himself.So what about the food?  Our waiter simply recommended a series of tapas to which we willingly obliged, although they seemed pretty happy to accommodate requests (one diner next to us said, \"I don't really like seafood\" - seriously?!?!).  My favourite of the bunch was the deep fried collection of squid, sardines, and shrimp - nothing fancy and nothing I haven't had elsewhere, but I simply have a soft spot in my heart for deep fried piles of goodness.The omelet and tuna tartare dishes seemed to be both typical standards, but they did serve us a squid and chickpea dish that I could have done without.  We eyed another couple eating a wonderful squid dish, lightly dressed with olive oil that looked absolutely scrumptious, and were I to do this again, I would have asked for something like that.  We did get a plate of razor clams and clams that were both simply cooked and delicious, so I think that anything that they can pull off with less is certainly more.If they ask about dessert, skip their Creme Catalan.  It can be found anywhere, and they manage to Disney-ize their dish by having the restaurant's name emblazoned on top of the dessert without adding much more to the dish.  But if asked whether I would come back again, I would not if I had to line up.  But if the evening was drawing to an end and I saw a few empty seats at the counter, there's very little that would keep me from coming back to that plate of deep fried deliciousness calling out my name.", 
    "3.0", 
    "Dan T.", 
    "New York, NY", 
    "116", 
    "430", 
    "cal-pep-barcelona", 
    34, 
    [
        "Mediterranean", 
        "Tapas Bars"
    ], 
    2
]