[
    "I stayed in Barcelona for 4 days this summer, and Cal Pep was my hands down favorite tapas joint.  They pegged me as tourist right off the bat, choosing the dishes for me.  I was thankful since my Spanish was terrible.  All the dishes were superbly done, and the simplest dishes were better than I've had anywhere else.  Just unbelievable how fresh and tasty the food was!  The place is not cheap, FYI, but ironically a bottle of white wine was only 8 euros.  We loved the place so much, we came back a second time and were able to choose our dishes instead of letting them pick for us.  If I ever get to go back to Barcelona, get me a chair at Cal Pep!Calamari - lightly floured and salted, and I swear garlic found it's way in the flour too.  So simple but easily the best fried calamari I've ever had.Tuna tartare - chopped and formed in a cylindrical shape, mixed with herbs, olive oil, and sesame seed, and served with toasted bread.  Mmmm, that's where it's at!Potato cake - that's the name I give it.  It looks like a pancake with some white sauce drizzled on it.  I guess it's their version of patatas bravas and it rocks.  The inside is gooey and creamy, and something I did not expect when I took my first bite.Clams - fresh as can be.  I had regular clams in a white wine sauce, and razor clams in garlic, butter, and herbs.  Both were fantastic, but the razor clams stole the show with their meaty texture.Baby squid and chick peas - this was one of the dishes they picked for me, and I would have never picked it myself.  Cooked together until the chick peas are nice and soft, and the sauce comes from the breakdown of the ingredients.  Verdict - unexpectedly delicious!If you ask for wine, you get a bottle, not a glass.  They also serve toasted bread with tomatoes and olive oil rubbed on them with your dishes.", 
    "5.0", 
    "Hao L.", 
    "Louisville, KY", 
    "3", 
    "44", 
    "cal-pep-barcelona", 
    76, 
    [
        "Mediterranean", 
        "Tapas Bars"
    ], 
    2
]