[
    "Excellent tapas in El Born, recommended to us by a friend who wrote a travel guidebook to Barcelona. We came here pretty late (around midnight) on a weeknight and only had to wait a little while for seats. The atmosphere is lively, with everyone sitting up and down the bar chatting. It was fun to watch the food being made.When we were seated, we mentioned a couple of things to our server that we like, and he ended up suggesting some additional things and bringing them out one by one. They were all delicious - pan con tomate, shellfish in broth with garlic, fried artichokes, tuna tartare, and the tortilla de patatas.The standout was the tortilla, which was the best I've ever had, and possibly my favorite classic dish I ate in Barcelona. We ate so many delicious things, but this was really a classic dish executed in a very interesting way. It was the epitome of how magical the combination of egg and potato can be, with the silkiest texture. I seriously don't know how they get the interior of the tortilla to be so smooth, almost to the point of being underdone, but just right - it's not slices of potato inside like the typical tortilla, so I think maybe they mix very finely grated potato with the egg and cook it until just set, so it turns into this heavenly homogenous mixture. I'll try to replicate it at home, with some minced onion and flecks of pancetta, but I doubt it will be as good! If I had a button I could press to magically have something from Barcelona appear in front of me on a plate, it would be this dish.The service was friendly and efficient. Our bill was a bit higher than I anticipated, but we did average a glass of wine per dish (the glasses were a little small), so maybe that's what made it a tad expensive. But it was totally worth it - one of the best meals we had in Barcelona.", 
    "5.0", 
    "Emmy M.", 
    "Providence, RI", 
    "10", 
    "144", 
    "cal-pep-barcelona", 
    1, 
    [
        "Mediterranean", 
        "Tapas Bars"
    ], 
    2
]