[
    "I love the idea of a place where I don't have to think about what to order - especially if the waitstaff asks what my preferences are then goes off to get me what they think is amazing. Let me back off for a moment. In my last 2 weeks and a day in spain I've had nothing short of excellent food (Ventana was still my favorite in Seville, but Organico in Cordoba and some amazing place whose name I can't recall in Salamanca definitely hold a special place in my heart).Cal Pep's concept in awesome. It's the \"Jiro Dreams of Sushi\" of tapas places I would think.So my friend and I are in line (i love places with lines that build my up my anticipation) and we order a red wine. We decide on a Rioja. Thus far Spain has also been spectacular in random wines. Every wine I've had has been well above average, and on multiple occasions extraordinary (Crianza in Salamanca and Burgos).The Rioja was limp. There's no other way to describe it. I figured it needed some breathing. The bottle, by the end of the dinner, was still limp.I told the waiter I was vegetarian (which I am) but I decided to throw caution to the wind and say that we'd have any fish, given I had heard such excellent reviews of the place.The lineup we got was the bread & tomato (standard appetizer for everyone it seems), garbanzo with spinach, breaded artichokes, blistered shisito peppers, and monkfish. The blistered shisito were excellent. But honestly is it possible to screw up blistering shisito peppers and throwing on a bit of salt?The monkfish was very good. But again, that's not saying much given it's pretty hard to screw up monkfish.The artichoke hearts had no flavor. The garbanzos with spinach tasted as good as that sounds (and those of you who are garbanzo + spinach fetishists can bow out of this).Truly truly sad to say that Cal Pep is nothing of great repute. The process is very nice. But at the end of the day I don't care about that - it's the flavors and innovation I come to a place like this for, and it just did not deliver.It's possible we should have gotten something else, but if this is the recommendation of the staff it's certainly not a good sign of their taste either :)I'd happily recommend Dos Palillos over Cal Pep any day.", 
    "2.0", 
    "cyber t.", 
    "New York, NY", 
    "4", 
    "63", 
    "cal-pep-barcelona", 
    36, 
    [
        "Mediterranean", 
        "Tapas Bars"
    ], 
    2
]