[
    "The restaurant came highly recommended by the chef and owner of our favorite tapas restaurant in the US.  Cal Pep was his inspiration.  My sister and brother-in-law raved about their experience.  With this in mind, my husband and I were so excited to finally try it.  The concept is pretty unique... Bar seating only on a first come, first serve basis.  There is an extremely small area with tables reserved for parties of 4 or more hidden behind a closed door in the back of the restaurant.  While there is a menu posted on the window (which we did not notice until we walked out), you do not receive one to order.  Rather, the idea is to tell the server what types of food you like to eat, if you have any dietary restrictions and how many tapas you want to order. The server selects the tapas for you and they are made to order.  The portions are large so 4 items is more than enough for 2 people.  None of this came as a surprise to us.  The server asked us if we ate meat and at first, we said we would prefer not to.  He clearly did not like that answer so (since we are not vegetarians) we told him meat would be fine.  The whole time, the server seemed pretty disinterested but we just assumed that was his personality.  We were served mussels, fried artichokes, fried calamari and tuna tartare.  Despite making such a big deal about meat, we were not served any.  The mussels were average.  The calamari was good but the tuna tartare was excellent.  Having eaten an entire plate of fried calamari, we had trouble finishing the plate of fried artichokes.  Fried foods and artichokes in particular upset my stomach so I could only eat so much. We do not have high expectations for service but the only thing we asked for was a beer refill.  He seemed to forget even as he continued to refill the glasses of those beside us. No big deal... We probably did not need more anyways.  What we could not overlook was the dirty look the server gave us because we left half of the portion of fried artichokes on the plate.  It was as though by not finishing a mound of fried food, we had committed a sin.    I am sure Cal Pep has a ton of other items to offer which are likely excellent.  I have a feeling the reserved tables in the back room would make for a better dining experience.  Either way, in a city full of incredible food, I would go elsewhere.", 
    "3.0", 
    "S T.", 
    "Glen Allen, VA", 
    "4", 
    "24", 
    "cal-pep-barcelona", 
    20, 
    [
        "Mediterranean", 
        "Tapas Bars"
    ], 
    2
]