[
    "As many of the reviewers mentioned, this is one of the highly recommended places to visit in Barcelona by many. We follow the instruction to get there 30 minutes before the opening in order to avoid the longer line of waiting, we were glad we did. The waiting turn out to be the most exciting 30 minutes for me, since you could imagine my anticipation for an awesome meal at this time was quite high.  After two of us finished 6 course meal and 120 something euro poorer later, I can't help but develop a mixed feeling towards Cal Pep. First of all, let's see what we got: -- a bottle of house white (can't go wrong with that)-- pan con tomate (good, but I haven't had any pan con tomate that were not good in Barcelona)-- clams cooked in chicken broth (delicious but nothing to wow for)-- tortilla de patatas (decent and huge)-- fried calamari (huge portion as well, and I thought this must be a joke)-- tuna tartare (huge portion, good but not great)-- grilled monk-fish with grilled veggies (the only awesome dish that reminded me why I were there to begin with - the Mediterranean specials)The good news was we were absolutely stuffed and all dishes were nothing but good.The bad news? Half way through the course, we realized that we went into this place without a strategy for taking advantage of the culinary skills offer by the Cal Pep. Mind you, you will not get a menu when you come in (at least for the bar line front-room dinning), and you will be asked briefly about what you like to eat, and then just leave it all to the staff/chef to decide what to bring to you. So if you were tourists, who were seeking for culinary adventures, but unfortunately answered like we did: \"oh, we love everything and are open to the idea to try whatever...\". Well, you will be treated as the typical tourists (rightfully so in someway), who will be fed with massive amount of crowd-pleaser but mediocre dishes in a very fast pace, and probably expected to make spaces for more tourists quickly after.  It was funny that we waited 30 minutes in line for eating breads, potato pancake, fried calamari and clams, which we could pretty much find those delicious but common dishes everywhere in Spain. Will I come back here again in the future? Maybe, but only if I could build up my courage and assertion to tell the chef/staff up front that I DO NOT want any starches, no potato, no bread, no fried dishes, one meat dish would be okay, and please stay with raw and cooked seasonal seafood, which were what the guests sat next to us did exactly. And boy, as the witness, I can tell you that the dishes they received were absolutely mouth-watering...3.5 star for being a tricky place.", 
    "3.0", 
    "Neena W.", 
    "Denver, CO", 
    "78", 
    "173", 
    "cal-pep-barcelona", 
    48, 
    [
        "Mediterranean", 
        "Tapas Bars"
    ], 
    2
]