[
    "Take five Americans, squeeze them into a tiny space inside the cavernous, warm confines of an ancient cava bar in the Barceloneta neighborhood of Barcelona. Give them five jamon y Camembert sandwiches for 2.80 euro each, five glasses of sparkling cava at one euro a pop, and stir. These are the makings of a night to remember.  I heard about La Champaneria from my friend, fellow Barcelona lover and Providence Yelp ringmaster Hilary H. Her five star review, along with separate endorsements from a handful of helpful Barcelona  natives, made me excited to give it a try. The place not only met my expectations, it surpassed it; so much so that I returned for a second time on my six-night Catalonian adventure. Located on a narrow, unassuming street near the harbor, La Champaneria clearly doesn't make its reputation on a prime address or, for that matter, any signage. Just follow the light spilling out onto the dark sidewalk, and the wall to wall crowd. Once inside, weave your way to the glass case where locals (and a smattering of savvy tourists) jostle for position, and a chance to call out their orders for delicious sandwiches, meat and cheese tapas, and of course, the cava that is poured like water, right up to the lip of your glass, again...and again...and again. There is no seating, so wear comfy walking shoes and prepare for so much fun, and so much great food and drink, you won't even care that you're on your feet.My friends gallantly pushed me to the front of the pack, where it was my job to call out our orders all night long. But I'm glad I had the vantage point that I did; I had a front row view of the cooking, pouring, people, and most impressively, the little old man who was able to keep every party's order straight, with nothing but a pencil and a piece of cardboard on which he scribbled hash marks. Talk about grace under fire!Two weeks after getting back to the States, I still dream of that glorious jamon y Camembert sandwich: thick slices of Iberian ham, rich (unpasteurized!) cheese oozing from the bulky roll and melting down your hand like Dali's clocks. (Bring your own napkins.) When the night wound to a close and we made our way to the next celebration, our bill - for five very full and happy people - was under 50 euros. Barcelona has a reputation for being an expensive city, and while that's mostly true, you can't prove it by this amazing and memorable gem.", 
    "5.0", 
    "Rebecca H.", 
    "Providence, RI", 
    "197", 
    "187", 
    "can-paixano-barcelona-4", 
    96, 
    [
        "Tapas/Small Plates", 
        "Spanish", 
        "Dive Bars"
    ], 
    1
]