[
    "For shame, fellow yelpers, for shame (hang your heads now)... I'd been off doing my own thing for my entire trip, and decided to give my last meal over to the Yelp gods: whoops.  Yes, this is in El Raval, just off of Ramblas, so of course it will be touristy: I can stand that if it is a good meal.  I got the shrimp with garlic (gambas con ajillos) to start, a midsize pitcher of sangria (as I couldn't go an entire trip to Spain without having any) and the roast suckling pig (Lechon: there is an accent in there but at this point I'm not going to figure out how to type it).  Don't get me wrong, the food wasn't bad: it didn't make me sick or anything.  But grossly overpriced, underprepared food that sullies the Barcelona restaurant scene by being rated so highly for the price point.  At multiple menu del dias (menu of the day, best deals can be had a lunchtime in Barcelona), I got a much better meals, with much better wine, for less than half the price.  The other reviewers were correct, the sangria is fortified and is a good deal if you are looking to tie one on.  The shrimp were simple, and I suppose if I did not have the comparison points of my other meals in Spain it would have seemed good, but I've prepared better myself (think less flavored scampi: there were roasted cloves of garlic, some dried mild chili peppers, and a combination of white wine and oil), and the roast pork was tender, with crispy skin, with roasted macerated fruits (raisins, apricots, and plums).  Some very simple steps would have made the pork a great winner: such as some salt and pepper on the skin: I'm not asking for much here, just a touch of seasoning... I know it is not traditional, but just because something is a tradition doesn't mean it is good.  That is my overall impression of this place: simple food, done the way it was cooked during the Franco years and prior, not giving a damn about keeping up with the times in the least, even if they could easily improve the food without giving up any of their traditions.  I know they don't have to because the tourists will keep coming, but I really wished they cared about the food more...", 
    "2.0", 
    "Jim M.", 
    "Glastonbury, CT", 
    "11", 
    "50", 
    "can-culleretes-barcelona", 
    22, 
    [
        "Catalan", 
        "Spanish"
    ], 
    2
]