[
    "This place... oh my... Me and my friend were visiting Barcelona, and she had found this place in a tourist guide, so we thought we would try it. After having been looking for it for a couple of hours, we were about to give up! It was so hard to find... but finally, we saw the very small hidden street that the restaurant was supposed to be on, and could see the huge gate where the name of the restaurant was written. Was it closed, we thought, since it didn't seem very \"open\" with the huge gate, but it was, and we were welcomed by a host who let us try 4 different wines, two red, two white, as an appetizer I guess. One of the red wines were so sweet and dry, I will never forget it, probably the best I've ever tasted. The wines were poured out of huge barrels, a very intense and authentic experience.After 5-10 minutes or so, the host followed us to our table. WOW an amazing interior! So spanish, so authentic, so beautiful. Rustic furniture in a beautiful barn! We were handed the menus, and there were so many things we could choose. We were a little afraid that the place was expensive since we were given such a unique welcome, but it wasn't! It was cheap, and the things listed on the menu were very traditional spanish food, they even served rabbit. We ordered many different things, lamb chops, potatoes, rabbit, it was so difficult to choose. While we were waiting for our food, we were served the traditional spanish bread with tomato jam (?), this was delicious. Our food was served within a short amount of time, and oh my!!! This was one of the best restaurants I've ever visited!!! The food was outstanding and there was lots of it! The rabbit was seasoned to perfection, and at first I was so scared to try it, but I'm so glad I did!!! We were so happy that we actually found this place, because I will never forget how amazing an experience it was, I will only recommend it! This place proves that food is one of the biggest joys in life! WAUW! I will definitely come back, and this place has without a doubt opened my eyes to spanish food.", 
    "5.0", 
    "Mia A.", 
    "Aarhus, Denmark", 
    "1", 
    "33", 
    "can-margarit-barcelona", 
    4, 
    [
        "Spanish"
    ], 
    2
]