[
    "La Champaneria, or \"La Champa\" as the locals call it is nothing short of amazing.Last summer I graduated and as a gift to myself I traveled around Europe with my younger brother for a month and a half, a week of which was spent in Spain, and a grand total of three days of which were spent in Barcelona. During my month and a half of travel I kept a travel journal and I will let my entry about La Champa speak for itself:\"8/1/2011After the beach we headed towards La Champa. We decided to walk instead of taking the metro so that we could save the last few rides for tomorrow. Javier [guy we met at a hostel at the beginning of the trip] was right! Every local knew what La Champa was! Except for one, but he just didn't know where it was, he definitely had heard of the place. It took us awhile to find it mainly because the name of the can isn't anywhere to be found on the doors of the street (Reina Cristina). It is literally a hole in the wall! Once we got inside the atmosphere was so lively and the place was packed with people! The sandwiches and cava are really fairly priced and our server was awesome. I didn't understand jack squat on the menu so when he asked me what I wanted I just told him, 'Surprise me!'. He served us cava first, glass filled to the brim. The cava was a rose color and much sweeter than the white cava we've had so far. It was delicious! A lot smoother and less sour than the white kind in my opinion.My surprise sandwich was stuffed with cheese, roasted pepper, and lomo (veal). I love this place. We've decided to go back again tomorrow.\"I highly recommend this place for people visiting Barcelona. It really gives you a taste, no pun intended, of the culture. Don't forget to push your way in there and be aggressive! Luckily it wasn't too packed when I went but I can imagine it being difficult to get in your order if you are timid!", 
    "5.0", 
    "Karen L.", 
    "San Diego, CA", 
    "405", 
    "363", 
    "can-paixano-barcelona-4", 
    97, 
    [
        "Tapas/Small Plates", 
        "Spanish", 
        "Dive Bars"
    ], 
    1
]