[
    "You know those places in your home city or even your favorite places abroad you love but only tell certain people about at least until news breaks and then everywhere is there? It's a place that you get a smile on your face when thinking about it and cant wait to blindside a fellow foodie friend for dinner. This is one of those place at least to me. That said I think the things I love about Champaneria are what most find unappealing and annoying. First off the place is a cluster to find as most nondescript and rumored places are in Barce especially to us practical Spanish speaking foreigners. The first night I tried to find La Champaneria it took us 2 hours and a couple of blisters in terrible shoes. By the time we found it they were sadly closing the grey garage security door and shutting down. The next day we were easily the first people in as we weren't going to miss the chance this time.Next the atmosphere is that of the Wall Street stock floor meets Central American market. If you know anything about me I adore produce/junk markets in latin america especially Liberty Market in Mexico and this quenches that thirst. Sometimes you have to push your way through a starving and partially drunk crowd all the while flailing your arms and yelling at the good folks behind the bar for your order. It's absurd. It's loud. I miss it. At its peak there may be 50/70 people crammed in a narrow store front that may hold 30 at the most comfortably ALL WHILE dozens of scrumptious cured pork quarters hang over you head with little plastic conical shaped buckets catch the drips of fat of the course of several months. ***Licking my lips right now***If that's not good enough the menu is ridiculous in both delicious and price. I had a foie gras and bacon sandwich - seriously - and it was less than 3 euro. You can easily eat there with the coins in your pocket not to mention the cava they make in house in 5 or 6 different varieties. I just had lunch and I'm already hungry again.If you go to Barce and dont eat here you should be slapped silly at the next Elite event :) HAHA enjoy", 
    "5.0", 
    "Bryan A.", 
    "Atlanta, GA", 
    "129", 
    "167", 
    "can-paixano-barcelona-4", 
    120, 
    [
        "Tapas/Small Plates", 
        "Spanish", 
        "Dive Bars"
    ], 
    1
]