[
    "On our first night in Europe we wanted to go to a nice restaurant. After a ton of research we decided on Casa Calver; partly because the menu looked amazing and partly because it was in a Antoni Gaudí building.  Gaudí was a world famous architect who's buildings look like they came straight out of a Dr. Seuss book. The pictures aren't that great because I didn't want to use my flash in such a fancy restaurant. Sorry!We started out with two starters meant to be shared.After we ordered they brought out this cream soup with rabbit. They make a soup every night and it's included with your meal. The texture was great, very silky, and the added bonus of a little rabbit meat was great.The \"Small plate of spider crab croquettes with guacamole and vegetable chips\" had a strong flavor (spider crabs can do that) but were good. The star of the dish was the guacamole though, you could taste every ingredient in it. Amazing.The \"Small plate of crispy tomatoes, gorgonzola cheese and black olives\" was very good. It was wrapped in a thin crisp pastry and was like a little flavor bomb.The \"Saddle of rabbit with tarragon and apple jelly and rice noodles with soya\" was the best thing I ate in Europe and the best rabbit I've ever had, and I've had a lot. The sweetness of the sauce was perfect with the savory meat and noodles.The \"Pistachio-crusted lamb chops, tomato garlic mayonnaise and vegetable terrine\" simple but perfect. It was extremely flavorful.The \"Apple tart tatin with cream ice cream\" is a simple dish but when done well it's unforgettable, this one was.  The ice cream had a beautiful silky texture and the apple had more flavor in it than any I had ever had.Alisha ordered the \"Guanaja chocolate cake with avocado cream and lime and mint sorbet\". The cake had the perfect texture and was not too sweet and the mint sorbet was a great pallet cleanser. I was interested to try the avocado cream, because I had never had it in a sweet dish, lets just say I will again! It was so good, not too sweet but just sweet enough.Casa Calvet is one of the best restaurants we've ever eaten at, hands down. The food was amazing, the service was extremely hospitable and prompt (something some high end restaurants lack) and the decor is beautiful.  If you visit Barcelona you must check this place out!", 
    "5.0", 
    "Todd L.", 
    "Chicagoland, IL", 
    "144", 
    "57", 
    "casa-calvet-barcelona", 
    1, 
    [
        "Spanish", 
        "Catalan"
    ], 
    4
]