[
    "A trendy bar-cafe with cosmopolitan business-chic. We had been walking for twenty minutes late at night, on the prowl for late-night decaf, possibly beer (eventually we decided we would settle for mere potato chips, but no late night Macs in that section of Barcelona apparently). After walking past a dozen banks and a few small Mom and Pops bars with obvious regulars, we came upon Casa Martelo. It appeared like a strange oasis in a desert of closed shops and darkened windows. Businessmen and nicely dressed women sat in the small outdoor patio and ordered fancy dishes from the smartly dressed staff. Quite a surprise! Atmosphere-The decor is business-chic cafe. Not as pretentious as a lounge but still impeccably arranged and clean.  With silent sliding glass doors and gleaming golden wood floors and a 20 foot ceiling, it was hard not to be a little impressed at first glance. The bar glimmered with a wall of backlit liquor. Warm wood tables for two were completed with matching chairs. The outdoor seating was half-enclosed on the side facing the street, creating a cozy spot for people watching and enjoying your cafe con leche or a brew.  The classy cosmopolitan vibe means you can take your family but not feel out of place with your friends. Five or six wee tables outside underneath umbrellas and about the same inside, with a few larger tables buried near the back. The bar had stationary stools for approximately ten. Food-We opted for coffee and some lighter fare, considering it was near midnight and we were jet lagged. First off, the menu was in 5 languages and nicely designed. Much appreciated as a tourista. Secondly, the waiter was extremely helpful and took us by the hand, explaining the food at the bar, which was displayed behind glass. We were still getting used to the idea of having the food in a classy cafeteria style, in trays behind glass where we could see it.  We wanted something traditional and he helped us out by pointing out common dishes. The potato omelette was fat and delicious, not too salty or greasy. The potato was rich and thick, the egg not too chewy or soft. The tomato-rubbed bread came with the oil on the side, which was much appreciated. The cuttlefish came chopped into bite sized peices, which was again much appreciated, as we were too darn tired and stupid to cut it up effectively ourselves. It was warm and simple, olive oil, garlic and minimal salt, laced with the good toasted taste of the grill. The whole thing was simple and delicious. The coffee was gorgeously decorated with a chocolate drizzle in the foam. The coffee was nice and strong. By the time I got to the bottom of it, it was a tad too milky for my taste, but it was decent while it lasted. Service-Our server was fantastic. He was very helpful and friendly. He spoke impeccable English and put up with our terrible Spanish. He shared some travelling stories from New York and guessed correctly that wed come in just two nights ago. The first night, he said, you come in an take it easy and sleep. The next day you go 100 per cent and drive yourself into the bloody ground, which is why we looked like wed been hit by a truck. He was very informative and his chatty, down to earth attitude helped make my evening.Convenience-Located a bit out of the city core proper, away from La Rambla, but a great spot if youre in the neighborhood. Our hostel was near Badal station, and the resto was a 15 or 20 minute walk away. Overall, we had a great experience and wed be happy to recommend it to others. A classy joint for the classy night owl out on the prowl for some good food late at night. The big windows would make it a great sunny breakfast spot as well. It isnt cramped or tiny and isnt a big tourist trap. To my uneduated Canadian sensibilities, the food seemed good quality and could be a great breather from the bustle of the city.", 
    "4.0", 
    "Catherine J.", 
    "Markham, Canada", 
    "18", 
    "35", 
    "casa-martelo-barcelona", 
    4, 
    [
        "Mediterranean"
    ], 
    2
]