[
    "First of all the staff was very friendly - my waitress was absolutely delightful and the rest of the wait staff were on top of everything.I really wanted to like this place and even waited a day to post my review thinking I was being too critical at first, but the reality is it just wasn't what I would have expected for the price and the reviews it's already received.One thing I really should have realized beforehand is that it attracts tourists primarily because it's in Antoni Gaudi building with much of the original furniture and all the design details intact. As such, every table was filled with tourists - not a bad thing, just sets the tone that this isn't going to be the most inventive of Catalan cuisine. Again - I should have assumed this from the start.The food was good, but not great. Everything seemed a little on the lukewarm side despite some of my plates actually being too hot to touch - didn't make sense. Plus, I only had three courses and the dinner was still a two hour process which was far too long for what I was having. The starter was a salad that had a tasty yogurt dressing, but wasn't anything to write home about. Next I had stuffed potatoes with shrimp: 3 potato halves! hollowed out stuffed with eggplant and a tiny shrimp on top of each...eh...I will say the apple tart tatin I had for dessert was quite tasty.Also, its definitely more a romantic dinner for two or even double date kind of place. I was dining alone and sat in the middle table in the middle of the room. I was basically every tables third wheel. It was slightly awkward, but had the food been up to par I could have had a spotlight on me and tuned them all out.If you really can't complete a trip to Barcelona without seeing every Gaudi building open to the public then I wouldn't stop you from going to Casa Calvet. Just keep in mind that this is his most conservative work (nothing like Casa Battló) and while enjoyable enough, with perfectly wonderful staff, you'll be paying for the experience of dining in a Gaudi room more than the food you'll be dining on.", 
    "3.0", 
    "Ennis O.", 
    "San Francisco, CA", 
    "60", 
    "155", 
    "casa-calvet-barcelona", 
    4, 
    [
        "Spanish", 
        "Catalan"
    ], 
    4
]