[
    "My wife and I ended up at CDLC after having a difficult time finding one of the places we had pegged as we were preparing for our trip to Spain. For those that don't know, most Barcelona restaurants are closed on Sunday evenings, and the same is true to a lesser degree on Monday evenings. As noted, none of the places we'd \"pre-identified\" were open, so we looked to the concierge at our hotel (U232 in the Eixample neighborhood). When asked for a restaurant that would allow us to eat on/near the beach, he told us about CDLC, which he described as \"a club that also served dinner\".Given that description, we were skeptical, but it turned out to be one of the best meals we had on a trip filled with wonderful meals.The decor and atmosphere of CDLC (which apparently stands for Carpe Diem Lounge Club) was very pan-Asian, with the inside covered with Buddhas and other Far East decor. One of the most unique features were the beds in the bar and on the dining patio. We dined at a table, but couldn't leave without having a cocktail from one of the canopy beds. The menu was filled with tons of pan-Asian options, and the food was described as a mix of the \"Occident\" and the \"Orient\". Though a bit pricey, it was well worth it--the quality of the food was outstanding, so don't believe the reviews that talk about the bad food. Maybe ours was better because the place wasn't packed--it was a Monday night, after all.For the food, I couldn't resist trying the grilled foie. Glazed in orange \"frosting\" then layered onto a crispy rosemary crust and smothered in candied mushrooms, the dish was succulent, sweet and savory. I'd never had foie gras prepared in an Oriental style, but now I'm glad to have tried it.. I then moved onto the squid ink risotto with squid, confit octopus, baked mango and rocket, which amazing. I wish I could have this dish over and over, and would highly recommend it to anyone eating at CDLC. Plus, if price is a concern, this was one of the more reasonably-priced dishes, at under 20 Euros. My wife enjoyed a seared tuna dish, but I didn't try it since I was having a starter and an entree to her lone dish.We finished with the Yuzu dessert, which was a glass full of white chocolate mousse, yuzu jelly, and fresh fruit. It was rich and decadent, but also very refreshing. Sometimes I get a little overly-full after wrapping up a big meal with dessert, but this one was light enough that it wasn't a problem.Being a first-time visitor to Barcelona, I can't provide any insider info on when to go to CDLC, but I can tell you that the atmosphere, service and food on our visit was outstanding. If I ever find myself in Barcelona again, this will probably be on my short list of return stops.", 
    "4.0", 
    "Sam C.", 
    "Ypsilanti, MI", 
    "44", 
    "44", 
    "cdlc-barcelona-2", 
    20, 
    [
        "Asian Fusion", 
        "Middle Eastern", 
        "Mediterranean"
    ], 
    3
]