[
    "Cera was my first dining experience in Spain and I really enjoyed it. It got busy quickly and service degraded a little as it got busier, definitely not bad, it was just our servers became more occupied than I would have liked. For its high and plentiful reviews I was a little surprised that it was off the beaten path a little, I think that may add to its charm. Casual atmosphere here too, which is nice. The front of the restaurant is a little small and awkward but it opens up in the back.On to the food, items ranged from good to amazing. While I would generally not recommend everyone at your table to order identical items Cera is an exception. Everyone should do themselves a favor and just order the Blackberry Mojito and the Black Volcano Rice. This is not to say the other items are bad, it is just that the rice dish and mojito are just so superior to the other items on the menu that it would be a mistake no to try them. On the basis of those 2 items Cera 23 is 5 stars.Blackberry Mojito - The best cocktail I had in Barcelona, its not overly sweet (for a mojito) and it tastes amazingSangria - The sangria was ok, a little too boozy for my tasteOctopus - It could be the region the octopus was from but I found it to be on the tougher side. The flavors were good though.Black Volcano Rice - Another big highlight as mentioned above. Full of fresh seafood and covered in black squid ink. It came topped with some sort of fish flakes, which moved as if it were alive on top of the rice. I imagine that is for show, it was an outstanding dishBeef Cheek and Truffle Mashed Potato - Truffled potatoes were great but they were not all that hot and cooled off even quicker. The beef cheek is very similar to short ribs, tender and delicious. I did find my piece to be a little too fatty, but otherwise tasted", 
    "4.0", 
    "Michael C.", 
    "Boston, MA", 
    "817", 
    "1294", 
    "cera-23-barcelona", 
    16, 
    [
        "Spanish", 
        "Modern European"
    ], 
    2
]