[
    "4.5I'm not really understanding the criticism that Cera is for American tourists only. I went twice and I didn't hear much of any English while there. Furthermore, la reina told me to patronize the restaurant and it doesn't get more Barcelona than Sharon A. Simply put: there's a reason why Cera 23 is so beloved and it has nothing to do with the restaurant catering to American tastes. No. Nothing to do with that. It has *everything* to do con el mojito mora.The blackberry mojito is truth! If you take nothing more from this review, know that you have to come here and order as many as you can drink. It's one of the tastiest, most addicting cocktails I've had in a long while. But, I'm getting ahead of myself. If you come to Cera 23 (and you should), come by yourself or with one other person -- tops! Cera is small and people tend to stay a while. Both times I came, I was able to sidle up to the one spot at the bar that was open. I didn't even bother with a table. Not only did the bar offer enough space for me, myself & I, it allowed me to take in the cartoons that played on the giant display (made to look like an old TV set) above the bar area. The cartoons are sight only because the playlist (and low lighting) make the mood. Prepare to hear Sting, afro-Caribbean beats, Spanish rock, and reggae. The music added so much to an already impressive menu.Yes, the menu. As tempting as it is to get drunk watching cartoons, you're here to eat. Once I could tear myself away from my mojito (seriously, you don't understand how good they are), I started with the ensalada de lacon. It sounds sorta nasty in English, but the confit of Galician with spinach, paprika and almonds was incredible. This is nothing I would have ordered in the States and I couldn't stop shoveling it in my mouth. I came up for air and ordered another blackberry mojito (I wanted an IV drip) and the star of the evening: the volcán de arroz negro. Hmm, maybe 'black' was the theme of the evening (lighting, drink, food, music... always bet on it). Regardless of theme, the black rice dish was heavenly. It was packed with seafood and all the saffron you'd expect from a Spanish restaurant. Strangely enough, the parmesan cheese element didn't detract from the plate. The cheese acted as more of a thickener than anything else. The prevailing flavors came from the saffron and seafood. Even though it wasn't an American-sized plate, the meal was so rich that I was plenty full by the time I cleaned my plate (and, please believe, it was cleaned). I was too full for a traditional dessert so I ended the meal with another cocktail. The Asian Garden was a light, fruity and booze-y way to end a fantastic meal. One last nice touch: the White Russian shot the accompanied the check. If there's ever a way to get someone excited about paying a bill, add some free liquor to the presentation. For as much as I ate and as full as I was, I found the prices to be quite reasonable. I'd, gladly, return to Cera 23 and recommend others to dine here as well. You'll excuse me for now I must mourn the lack of blackberry mojito in my life.**PM me for my address if you'd like to send some in the mail.", 
    "5.0", 
    "Johnny T.", 
    "Nashville, TN", 
    "4800", 
    "1793", 
    "cera-23-barcelona", 
    6, 
    [
        "Spanish", 
        "Modern European"
    ], 
    2
]