[
    "Our tour guide recommended Cinco Jotas (5J or Quinto Quinta) for our arrival dinner in Barcelona.  It is one of the many fine restaurants on the rooftop of the Arenas, the converted bullfighting stadium.  They have a large seating area inside and outside, very decorative lights, and an open kitchen inside.  Many dishes specialize use their signature Iberian acorn-fed pork.Food and service was outstanding.  The mixed grilled pork plate (28€ for two) had a number of grilled pork items (shoulder, back, legs) that all had a nice outer sear, and varying degrees of juiciness and texture.  We ordered medium cooked, and could of sworn some of the pieces tasted like grilled beef steak!  We also didn't know the combo came with fries and salads for each of us, so we wound up getting too many apps.Steamed Cockles (Mussels)  were mostly plump, juicy, and fresh (just 2 out of say 15-20 didn't open).  Preparation was simple - it looks like they were steamed with just fresh lemon to enable you to taste the freshness and natural salinity of the mussels. Tomato flatbread was just OK - we totally forgot to add their EVOO and Vinegar which were discreetly located at the end of our table.Desserts were wonderful.  My wife enjoyed her Catalonia Creme Brulee, which came in a cocktail glass with some clear liquor (brandy?), topped with a light cream on top.  Similar to the Valencian Cream we had the day before, this dessert was also very light and sweet - almost like eating creme brulee but without the heaviness of egg yolks.  The waitress instructed us to dip the spoon all the way down!  The other dessert was chocolate fondant with cinnamon-banana ice cream which was also very good.  It came with these really tiny tomatoes that gave a sharp burst of tangy flavor (like a cranberry).Definitely recommend Cinco Jutas if you happen to be meat eaters, since they seem expert at grilled pork.  All the servers speak English and its really a festive restaurant.", 
    "5.0", 
    "Daniel C.", 
    "Danville, CA", 
    "318", 
    "667", 
    "cinco-jotas-barcelona", 
    2, 
    [
        "Spanish"
    ], 
    2
]