[
    "This is hard, I don't know where to start. This was without a doubt one of our top 3 meals ever. That said, you need to be a certain kind of foodie to truly enjoy it. I can understand why there is a review that said things were too sweet. I was SHOCKED at how sweet things could be and still be savory. Cinc Sentis to me is a play on the senses, and it was delightful. Well, now that I've started let me go on...First the atmosphere and service were exceptional. This was team service and everyone we interacted with was lovely and equally as important really into the food and wine. What I loved was the pride they took in the pairings and the special finds they feature. They also go into the \"why\" the chef made a certain choice, which includes the heritage of the dish. Meaning... \"This dish is our take on [name] Catalan dish,\" which also included an explanation of that dish and their take.Now, here, I have to mention that though I have had a large number of high quality modernist meals, they generally fall flat for me -- more form than function, and I dig function in my food and bev.This was without a doubt, the best modernist meal I have had. Each dish was carefully constructed, and there was only one that didn't make me think differently about the ingredients or the original dish. (If I did know the original dish.) While it was hard to choose, I think my favorite was the main which was 3 version of squab... in 3 dishes, all creatively plated. Near to that was the langostinos and pork belly, which they paired with sea urchin foam and black garlic. Loved it and I don't like sea urchin typically. If I had to choose a third dish, it would likely be the 5 (or was it 6) tapas that we started with. Oh, forgot to mention this was the gastronomic tasting menu that is only offered for lunch. Yep, 3+ hours starting at 1:30p.I have to agree with the surprise that this restaurant only has one Michelin star. Just a week ago in Nice we ate at a (also wonderful) 2-star restaurant and this was better... by just a schmidge. Really we loved both, but if I had to choose a winner, I'd have to go with Cinc Sentis for originality that works.So if you aren't really into food, or aren't in the mood to sit back and appreciate the artistry, this isn't for you. But if you are, wow, just wow. And then a few hours later, you will smile again and say, wow.", 
    "5.0", 
    "Jana E.", 
    "Charleston, SC", 
    "120", 
    "28", 
    "cinc-sentits-barcelona", 
    7, 
    [
        "Catalan", 
        "Wine Bars", 
        "Modern European"
    ], 
    4
]