[
    "So delicious. And inventive! Cinc Sentits did not disappoint, despite our having made reservations for dinner last Saturday with very high expectations for a Michelin-star worthy experience.The sleek interior space is long and narrow, with just enough room to comfortably seat around ten tables. The decor is simple and modern - dark neutral tones, wood paneling, flickering votives, and individual table arrangements of dried citrus, twigs and stones. Ribbons of amber beads swirl across the ceiling and keep the spare setting from feeling too severe. The menu at Cinc Sentits is seasonal and offered in two forms: an eight-course \"menu sensacions\" (with or without wine pairings) or a six-course \"menu essencia\" which is served with slightly larger portions. As we deliberated, we ordered a glass of cava (delicious!) and decided to splurge on the menu sensacions with wine pairings.The meal began with a trio of traditional Spanish tapas - marinated olives, crispy salted cod, and spicy fried almonds - each given a slightly modern twist. We were also presented with a selection of rustic breads and olive oils. Next came the deservedly-popular shot of salted maple syrup, cream and cava (perfectly balanced and very light!). The courses which followed included a savory pumpkin soup topped with toasted nuts and seeds (delicious!), caramelized foie gras with a coca crust, chives, and leeks over crispy sheets of filo pastry (amazing), smoked quail with a chestnut sauce, cod with paella (a little too salty and saffrony for my taste), braised beef with black truffle, celery root puree, and celery sorbet (outstanding! the celery sorbet worked!), a trio of Spanish cheese, a raspberry sorbet with pistacchio cake and vanilla bean custard, and chocolate mousse with violet macaron crumble. Everything was perfectly prepared and beautifully presented. The wine pairings were fine, though we would have preferred them to have been more red (only the beef course was paired with a red wine), less white, and without the dessert strawberry-lime infused muscat (which tasted exactly like a Good Humor Strawberry Shortcake bar). Throughout, the service was excellent, friendly and very comfortable speaking in Castilian, Catalan or English. The only part of our experience that I found disappointing was the odd sort of ambiance created by a restaurant given entirely over to tasting menus. It was somewhat distracting after each course was served to hear an identical presentation being made to an adjacent table (with equal enthusiasm, even!). Indeed, as I became aware that all four tables in our corner of the room had decided on the 7-course menu, I began to feel a competitive urge to keep up our dining pace (I am still unsure how one particular couple was able to start their dinner at least forty-five minutes after us and have paid their check and departed before we'd even finished our dessert!). Nevertheless, we had a fantastic evening and the food was very memorable. I would definitely return to sample another seasonal selection!*Though the portions are small, they add up! Be sure to come with a hearty appetite (I was barely able to get through the cheese course).", 
    "5.0", 
    "Anna M.", 
    "Manhattan, NY", 
    "17", 
    "50", 
    "cinc-sentits-barcelona", 
    26, 
    [
        "Catalan", 
        "Wine Bars", 
        "Modern European"
    ], 
    4
]