[
    "We stayed at the Hotel Irla, just a couple of blocks uphill from this dark and seemingly undistinguished hole-in-the-wall, just north of the very busy and fashionable Diagonal in L'Eixample.  We were in Barcelona for five nights, and the first three nights, we'd simply pass this place up to hit the more trendy and well-known haunts of the district.  On our way to find a new spot for dinner on our fourth night, naturally, we passed this restaurant heading towards Diagonal.  On this particular night, however, as luck (or fate?) would have it, we stopped halfway down the block, and decided to turn around and check out the menu.  After a brief hesitation, we decided to give Collage a try....Collage is setup with three different areas for dining:  alfresco dining on the sidewalk, covered, open-front dining area on the terrace, and a fully-enclosed dining area just inside of the terrace.  The whole setting is very eclectic in design (some interesting modern art on the terrace; mismatched tables and seating; flotsam and jetsam artwork inside), and has a comfortable and chic ambiance.  The wait service was very friendly and attentive on both nights we dined here -- yes, it was so good the first night, we decided we wanted to have our final Barcelona meal here, as well!The food at Collage is nothing short of excellent!  From the 21-day macerated steak, to the fabulously grilled octopus, from appetizer to entree, every dish arrived perfectly cooked, seasoned and flavorful!  (I'm uploading several pictures of some of our dishes.  Alas, these pictures don't do justice to the real thing...!)  As great as the main dishes were, we both agreed that the unassuming toasted bread with roasted tomato spread was probably the one item that blew us away, mostly because it was so simple a starter that packed such a punch of wonderful flavor.  (We're both still craving that tomato bread back here in the U.S....!!!)To sum-up our experience:  Collage is a restaurant that is worth seeking out!  Our experience here was truly fantastic and memorable.  This was by far and away our best dining experience in Barcelona...!  We look forward to returning on our future trips....  (And, too, I forgot to mention that they make a mean, kick-ass Sangria...!  Thank goodness the hotel was only up the block...!)  :D", 
    "5.0", 
    "Darryl S.", 
    "Fort Lauderdale, FL", 
    "28", 
    "232", 
    "collage-barcelona", 
    1, 
    [
        "Spanish"
    ], 
    2
]