[
    "When my cousin left home for the US, I thought I'd save some € by eating in, instead of eating at a café/restaurant. Some days, I'd buy 1 big sandwich to eat for the day. The Conesa Entrepans sandwiches were perfect for this, since they were big & were good for about 2 meals (depends how much you eat), & possibly around 800-1,000+ cals each (estimate). This saved me € & calories, & some days I think I only spent about €6-€12 on food. At CE, I bought 2 sandwiches, 1 cheese, 1 veggie. I tried other affordable Yelp-recommended sandwich places in Barcelona, but Conesa Entrepans was hands down the best. I had had the location of CE pinned in my City Maps 2GO iPad app (get it!!) for a while, but I never really looked for CE before, so I never found the place. It found me. Serendipity?I was wandering aimlessly around Barri Gotic when I saw 'the queue'. If you click on the webpage, you'll see it. It wasn't that long, but still extended past the entrance. The first thing I noticed was that the menu was in Catalan. I figured it would be in Catalan, since I was in Catalonia. With my broken French, Spanish & Catalan, I figured which sandwich was which. There were a bunch to choose from, & a ton of people inside. It was lunchtime, & the place was packed & kinda noisy (I didn't mind). There was a vending machine outside, so a bottle of water only cost me something like €1.10+. Yayz. The next thing I noticed was that the guy making the sandwiches seemed truly happy - it's always great to see people enjoying whatever it is that they do. He was doing a kind of whistle-dance that would've been great for YouTube. He could've given 1 Pound Fish guy a run for his money. The cashier was also smiling. Looks like another happy day at Conesa Entrepans.The sandwiches (about €4 each) were big (lots of bread), tasty, & delicious. I ate half that night, & reheated the rest in the toaster oven the following day. They were still delish. If you want to save € without having to starve, definitely pay Conesa Entrepans a visit.", 
    "5.0", 
    "Violet C.", 
    "Las Vegas, NV", 
    "80", 
    "96", 
    "conesa-entrepans-barcelona", 
    7, 
    [
        "Gluten-Free", 
        "Sandwiches"
    ], 
    1
]