[
    "Wow @CorneliaandCo. I still have absolutely no words for my favorite dinner in Barcelona, if not one of my favorite dinners OF ALL TIME. My friends know how important food is to me. Whether I'm in Asia, Europe or North America, being able to have wonderful dining experiences is one of the most important ways that I enjoy life and all the flavors it has to offer. When I visited Barcelona for four days, I already had a list of recommendations from two different Spaniards. After evaluating 10 of them on Yelp, I decided on Cornelia and Co and boy am I happy that I did.My three girlfriends and I ordered two bottles of wine, one white and one red. For the sake of celebrating the fact that we were in Spain, we ordered a Tempranillo and a nice white recommended to us by Clara, our lovely waitress of the night. We started with some small plates including:-Smoked octopus -Burrata with pesto and tomato carpaccio -Patatas bravasThe burrata was by far my favorite and melt in your mouth absurd. The smoked octopus was cooked to perfection and not too smokey, just right. We also shared two entrees:-Rice with chicken and curry-Sage butter ravioli The rice with chicken and curry was such a surprise because it had pear slices chopped inside. And the sage butter ravioli literally couldn't have been cooked better and was seasoned to perfection. There were four of us and five pieces of ravioli so my friends generously let me have the last one. I was on cloud nine. No one wanted to split dessert so we each ordered our own and stole a few bites from each other. I got the chocolate soufflé and my girlfriends ordered the carrot cake, apple crumble and strawberry chocolate tart. I loved my chocolate soufflé although it could've been warmer.The apple crumble was my least favorite, it needed to be warmed up and served with a scoop of vanilla ice cream. All in all five stars and the price was extremely reasonable. Five stars without a shadow of a doubt :)", 
    "5.0", 
    "Maha N.", 
    "Columbia Heights, Washington, DC", 
    "293", 
    "83", 
    "cornelia-and-co-barcelona", 
    13, 
    [
        "Mediterranean"
    ], 
    2
]