[
    "A couple of weeks ago I popped into this \"picnic store\" with a few girlfriends to pick up supplies for our lunch in the Ciutadella. We bought some fried artichokes, cheese, tomatoes, jam, bread and more and enjoyed our wait in the spacious restaurant and loved the things they had on offer and for perusal.  An odd aside; the bathrooms are quite modernly appointed and add to the overall taste of the place which is quite lovely.  The most important thing should, of course, be the food and in that regard we were certainly not disappointed.  All was quite good and, though a little pricey, I decided that I would absolutely be back for a meal at the restaurant.  Today was a beautiful day so my friend and I sat at one of the two tables out front and enjoyed a long lunch that kicked off with a couple of glasses of white wine and some delectable bread with oil and salt.  The waiter knew his stuff and brought a great selection that was dry and refreshing and he also brought the house-made, fresh bread out in a large woven basket which was a nice touch aesthetically. After that we shared the tomato salad which was quite good, though it came with tuna which while not entirely unwelcome was a bit of a surprise.  Afterwards, I had the tagliatelle with pesto and she a focaccia sandwich and both of us were quite pleased with the food.  Fresh, al dente and with an incredible basil smell the pasta dish was a treat.  Had we not been in a bit of a rush to get to class we would have ordered dessert, the girls at the table next to us ordered several and the lemon pie looked to die for.  I highly recommend Cornelia & Co. if you're looking for a nice sit down lunch or picnic food to go.  The food is delicious, the ambiance inviting and the location up on Valencia one of my favorites in L'Eixample.", 
    "4.0", 
    "Chloe B.", 
    "San Francisco, CA", 
    "63", 
    "87", 
    "cornelia-and-co-barcelona", 
    34, 
    [
        "Mediterranean"
    ], 
    2
]