[
    "This review is purely for drinks. Juan is an impressive and talented mixologist who could easily stand up to most in new York. Apparently these are 'Argentinian style' cocktails. In mixology there is artistry and also a concern for the customer's experience. Juan has an impressive control of both. He curates your experience and walks you through each step of the cocktail making process so you can appreciate the complexity of flavor once it's ready. He chose the 'Argentine swizzle' for me, which he characterized as a taste of Venezuela.  It contains, as I recall, muddled mint and lime, gin, fernet and more awesome stuff in the drink and comes with a small cup of dulce de leche. He instructs you to coat your tongue with a bit of dulce de leche before drinking your drink to round out the acidity of the lime and freshness of the mint. The effect has a bouquet of wonderful complexity, first viscous and sweet, then acidic and bitter, then fresh, from dessert to salad, from pain to pleasure. Just what I look for in a drink. I'm sure a place like this would be mobbed by alienating hipsters in new York and I'd be cowering over my drink, but the place has Barcelona's characteristic friendly openhandedness. I chatted with a couple to my right who were mercifully curious about Brooklyn. The next drink Juan recommended is the Popeye sour, quickly understanding my love of 'complex' drinks (or 'well balanced' as he says) that are emblematic of the bar I'm at. This drink contains, as I recall, muddled spinach, ginger, lime, and the wonderful touch of smoky mezcal sprayed on top like bitters. This drink plays the magic trick of making you think you are about to get drunk on smoky Mexican liquor, but then you are overtaken by the sweetness of orgeat, the acidity of lime, the spice of ginger, and a light vegetal spinach flavor. It is a sensory 'meal' in itself. And I believe new Yorkers would probably pay through the nose to try it. I've been lightly tipsy off these tremendous drinks for an hour, and hope that before their statute of limitations is over, I'll make some friends.", 
    "5.0", 
    "Dian L.", 
    "New York, NY", 
    "80", 
    "221", 
    "creps-al-born-barcelona", 
    3, 
    [
        "Creperies", 
        "French", 
        "Cocktail"
    ], 
    1
]