[
    "My friends and I stumbled upon Da Greco while looking for a place to eat to commemorate our last night together in Barcelona. We went in and the hostess asked if we had reservations. Of course we didn't being walk ins. However, she was accommodating and mentioned that a party of the same size had reservations fairly soon and if they didn't show up then we could take their spot. Lucky for us as they didn't show up! I don't think I could've walked any bit further anyways. I was so tired from all the walking, haha.With many different things to choose from the menu I ended up ordering the sampler which was a couple of the main dishes but at smaller portions. The others ended up ordering just a main dish. It didn't really matter what we ordered in the end as they ended up bringing us small servings of everyone's order. I guess it was for everyone to try? First time seeing something like that in a restaurant but you got no complaints coming from me! More food is always welcomed!I recall having spaghetti (a bit spicy), cheese ravioli, fettuccine alfredo with salmon, risotto, gnocchi, and seafood (shrimp and mussels) pasta with olive oil and butter. Everything was phenomenal! The dishes were full of flavor. Quite possibly the best Italian food I've ever had. Service here was good and they were attentive to our table.So why the 3 star rating you ask? Well a day after my stomach didn't feel too good. I ended up using the restroom and figured that was the end of that. But I didn't get any better and ended up frequenting the restroom every 2 hours. I felt like hell. I wasn't getting any better after a few days and saw a doctor when I got home. Turned out I had food poisoning infection. No bueno. It also turned out my other friend was not feeling too good either. We deduced that it was the seafood pasta that was the source of the problem as we were only the ones who had that dish and everyone else pretty much ate the same thing.Getting food poisoning would have been enough for me to drop my rating to one star. However everything tasted good so I guess I can't be too harsh. My advice is to stray away from the seafood dishes. Everything else you should be good on.", 
    "3.0", 
    "Michael B.", 
    "Irvine, CA", 
    "36", 
    "53", 
    "da-greco-barcelona", 
    18, 
    [
        "Italian"
    ], 
    3
]