[
    "Probably my favorite Molecular gastronomy by far. If you happen to be adventurous in your culinary experience and want to try something out of this world, I totally recommend you to go to this gem located in Barcelona on Villarroel Street 163.Here is why: Each course in the set menu (I ordered menú festival) is arranged and cooked in an unconventional way - what may look like olives, are not olives and what may look like pastas, are not pastas. They make food to mimic other forms of food - and most courses on the set menu are beyond delish and will make your trip to Barcelona an unforgettable one (not even exaggerating).The menu I ordered which was menú festival, costs €100 and has more courses than the other menu. As I said before, if you're an adventurous eater and don't mind spending the big bucks, go to this restaurant. So here are my favorite courses: The course from the ménu I ordered started with a frozen 'welcoming cocktail' - very zesty and refreshing cocktail slush - to kickstart your tongue for the incoming courses.  The next one was one of my favorites - \"the beet that comes out of land\". Not only that it has an amazing taste, but the way the food was presented - eating them with rose petals as spoons, made me feel more excited to eat because it is really something new. An unprecedented way of eating is always an exciting experience. Crispy bow with cured Iberian bacon was also a very delicious light course. Another one that I should add is tomato \"polvoròn\" and Arbequina Caviarolli. The tomato polvoròn are round in shape, almost like a cookie, placed on a thin and flat stainless. This was superb - at first it has that chalky/powdery texture with a subdued taste, but it will immediately dissolve on your tongue and that's when the taste comes out and you go all like, wow *foodgasm*. Yes, I was very surprised because the taste was unexpected - all the courses here came with a surprise because you would never thought the courses they serve tastes as you picture them in mind. And that's probably the best kind of thing I've ever experienced in my whole gastronomic experience. Crispy egg yolk with mushroom gelatin is one of my favorite courses and the presentation was experimental and playful. The deep-fried egg yolk is very crispy and once you bite it, the yolk will majestically gush out in slow motion waiting to land onto your tongue.. and that's when you should take the rest in your mouth. If it is too big, just shove it in like no one is watching. As I was finished with it, I ate the mushroom gelatin which was placed inside the egg shell. Creative! The shrimp was also perfectly cooked - not at all hard and not too undercooked, it was very soft and juicy. I honestly never tasted any shrimp that was perfectly cooked like that, it was unbelievably tender. Beautiful. The course which was my utmost favorite was: the olives. I can tell you one thing: you cannot find this anywhere else other than in Disfrutar (I think). The waitress explained about the 'olives' being delicate so we had to be careful, and we were recommended to eat them in one bite: once I put it in my mouth, it broke like a very delicate edible glass and the juice oozed out rapidly... Shortly after that we were told to eat the other olive which was darker green in color with a sweeter taste. That was when I realized, after I tasted that my life would never be the same anymore. That was the highlight of my trip: the olives. I honestly think that you should listen to what the waitress tells you in what order the food should be eaten, because those olives eaten in that order was 'perfect'. The sweeter taste of the last olive was really a great ending and had a great balance between both tastes. Moving on to desserts, everything was delicious but I gotta say, cheesecake cornet and chocolate peppers were my favorite. Chocolate inside the peppers?? Are you kidding me, who would've thought that. Overall, I am beyond impressed. The food was spectacular and chef par excellence!! Plan your trip to Barcelona well and don't miss this!For more pictures, download Inztant on App Store and follow me to see pictures of nice food!", 
    "5.0", 
    "Kun S.", 
    "Orchard, Singapore, Singapore", 
    "16", 
    "22", 
    "disfrutar-barcelona", 
    5, 
    [
        "Modern European", 
        "Mediterranean"
    ], 
    4
]