[
    "This is a continuation of our gastronomic adventures in Spain in September 2015 so these restaurants were all visited within a 2 week period. Disfrutar is not in the same class as Michelin * restaurants with respect to white table cloths, extensive wine lists, expensive tasting menus . . . but rather is part of the new emerging gastronomic experience from former elBulli chefs who are brining their magic to the people.Disfrutar is the creation of Oriol Castro, Eduard Xatruch and Mateu Casañas, all former head chefs at Ferran Adria's elBulli and they clearly have raised the gastronomic bar in Barcelona even amongst some strong competition.As with some of our other restaurants, it was impossible to obtain a dinner reservation so we opted for a late lunch (early diner) that started at 1:30 PM and ended at 4:00 PM. There are two tasting menus - Menu Disfrutar (18 courses, 60 euros) and the Festival Menu (25 courses, 100 euros). We opted for the Disfrutar menu along with a wine paring for each course.As with other elBulli trained chefs, the food was a combination of molecular manipulation, tastefully delicious, visually theatrical, and provided a very memorable 2.5 hrs of entertainment for all of the senses. Through out the meal, the staff was very interactive, conversing in either Spanish or English and giving suggestions as to not only how to eat one of the creations but sometimes the recommended order for plates of multiple components. Following the frozen 'welcome' cocktail, we were presented with what appeared to be a bowl of dirt, which was black rice grains which upon shaking, two purple beets, composed of beetroot meringue, appeared. These were light, crisp, with the savoury sweetness of a beet. Following the tomato 'polvoron', we happened upon one of our favorites - transparent pesto ravioli. The visual presentation raised expectations and the transparent triangular edible bag enclosed pine nuts, parmesan and herbs. This creation was eaten by first dipping into the Parmesan water and then consuming. Upon hitting the palate, the little bag dissolved instantly and all of the contents melded together in the mouth to give a perfectly balanced mouthful of Italian delight.Of course, any elBulli chef would not be such without the elBulli olives - in this case, two: one filled with olive flavouring, the other with a blood-orange flavour. In this case, the spherification process that forms a cocoa butter shell worked and it burst instantly and completely releasing the intense liquid inside.Following the cheese course (cheese biscuit with apple) was another favorite - the crispy egg yolk with mushroom gelatin. As one bit into the tempura battered yolk it evoked strong truffle flavor slightly runny yoke texture that filled the mouth. Combining the egg the egg yolk with the jellied mushroom consumes in the egg shell was fabulous, both in flavor and texture.Following the seafood and avocado sandwich, where the 'bread' made of meringue literally dissolved the minute it hit the tongue and the parmesan tacos was the marinated maceral with cauliflower. Essentially the marinated mackerel was cut sashimi style and placed on cauliflower that had been processed to serve as a rice substitute and formed into nigari - superb.Then our all time favorite - Disfrutar's macaroni carbonara. Transparent macaroni with Iberian ham was foamed with carbonara with truffle oil and grated parmesan and mixed to what is probably the most decadent carbonara comfort food we have ever enjoyed. Flavorful, rich, decadent and simply magical - on with the show!Our other courses included wonderful razor clams, red mullet with port jowl and Iberian pork tenderloin 'pibil'.For the dessert courses, the chocolate peppers, oil and salt were fabulous. Again, by the use of molecular wizardry, what appeared to be perfect and complete red and green chillies was in fact another molecular 'skin' enclosing the perfect intense and strong chocolate cream perfectly enhanced by the oil and salt. Wonderful!", 
    "5.0", 
    "Dr R.", 
    "Portland, OR", 
    "0", 
    "16", 
    "disfrutar-barcelona", 
    7, 
    [
        "Modern European", 
        "Mediterranean"
    ], 
    4
]