[
    "This was not just any Dinner.This was a creative endeavor, an artistic display, a gustatory sleight-of-hand, and more, courtesy of the folks over at Disfrutar, here in Barcelona.The meaning of the Spanish word `Disfrutar' translates to bask, delight, enjoy, take pleasure in, that kind of thing. It's a hot, new-ish restaurant that is getting a lot of attention.Interestingly enough, the comfort-level doesn't correspond to the restaurant's name, but really, this place is more about what is being attempted by the kitchen.Born with a world-class pedigree that of El Bulli, long considered the best restaurant in the world, a few of E.B.'s former chefs opened this place up, and strive to mess with your mind, eyes, and taste-buds with almost everything presented before you.\"What is that?\" \"Looks like a chile pepper, but it tastes like chocolate!\" \"Oh dear, what's going on over here?!\"Molecular Gastronomy is a style of cooking (some say it's \"not real cooking\" by the way) that will blow your mind. I suggest everyone try it, once. Just to experience it.Wikipedia describes Molecular Gastronomy as \"a subdiscipline of food science that seeks to investigate the physical and chemical transformations of ingredients that occur in cooking. Its program includes three axes, as cooking was recognized to have three components, which are social, artistic and technical. Molecular cuisine is a modern style of cooking, and takes advantage of many technical innovations from the scientific disciplines. The term \"molecular gastronomy\" was coined in 1988 by late Oxford physicist Nicholas Kurti and the French INRA chemist Hervé This. Some chefs associated with the term choose to reject its use, preferring other terms such as multi-sensory cooking, modernist cuisine, culinary physics, and experimental cuisine.\"We went all-in and opted for the \"Festival\" menu, priced at 98 Euro per person. So yes, it's expensive.There were approximately 25 different plates; small tastes of edible theater-on-a-plate which, at times, pleasured, frustrated, confused, wowed, and on one occasion, it was, like, \"Yuck, please take this away,\" uttered almost simultaneously by both Lin and me to our lovely staffer, Isabel, a trooper, who did her best to translate and describe to us in English. She really was great.I won't go into one of my one-thousand+ words short story format I usually post, so will instead share some photos with you from our evening here...As a former chef and a long-time eater (hahahaha... legendary appetite is what I usually say) I will repeat what I said above... try this type/style of food, at least once, just so you know what's being hailed all over the world as the latest, if not greatest...I'm curious what your thoughts are...{The experience was a \"5\" and the food was a \"3\"}", 
    "4.0", 
    "Matthew G.", 
    "Honolulu, HI", 
    "142", 
    "59", 
    "disfrutar-barcelona", 
    9, 
    [
        "Modern European", 
        "Mediterranean"
    ], 
    4
]