[
    "My first molecular gastronomy experience and wooooooooooow. Just wow!Upon our first visit to Barcelona the Good Egg took the initiative to seek out a truly memorial dining experience and found Disfrutar (translation: to enjoy, delight or take pleasure in) which turned out to be a total 'golazo' (to put it into soccer terms)!After making a 1:30p lunch reservation, we arrived to find we were the only diners...never a good sign. But as we would soon find out, we were slightly ahead of the 'normal' 2-4p lunch window most Catalans adhere to...because promptly at 2p the place was practically full. Another benefit of arriving ahead of the rush is we got a chance to meet the chef and his team, which just added a tinge of specialness to the whole experience. It's an elite team who've all spent years in other high end sister kitchens perfecting their skills to come together with a singular culinary vision at this newly opened restaurant. They bill it as \"an experience expressed through language & current techniques.\"Once seated you can't help but drink in the distinct Mediterranean influence eloquently revealed throughout the asymmetrical space via a very clean, white, blue, green color palate, appropriately matching the cuisine's origins. They offer two different sized tasting menus: Disfrutar for €68 or Festival for €98We opted for the 'shorter' (which ended up being something like 15 tastings) and took about 2.5 hours to complete...I think I could get use to this lunch wrapping up around 4p thing!I won't go round by round but suffice to say we were utterly blown away tasting after tasting. I tried things I never have, never dreamed of, never wanted to--yeah I'm looking at you razor clams--and just wow!The service was crisp, attentive & informative, indulging our every inquiry along with mandatory picture taking.If you're looking for a magical culinary experience...Do. Not. Miss. Disfrutar.", 
    "5.0", 
    "Jeff F.", 
    "San Jose, CA", 
    "195", 
    "195", 
    "disfrutar-barcelona", 
    3, 
    [
        "Modern European", 
        "Mediterranean"
    ], 
    4
]