[
    "KenScale: 8.5/10What makes for a wonderful tasting menu? For me, it should have each dish that has its own story while also having a cohesive unifying theme throughout. I've had some sensational tasting menus during my culinary journey, and was really looking forward to what Disfrutar has to offer. Led by a trio of chefs who used to be part of the great ElBulli, it serves creative tasting menu with molecular gastronomy bent. I'm not always a fan of molecular gastronomy (as my dining companion calls it \"toying\" with the food), but the profile of the team definitely intrigued me and I'm always up to inventive dishes. Overall, the technique and surprise factor at Disfrutar is quite amazing; on the other hand, I didn't really see the \"story.\"We went with the Menu Disfrutar (at 70 euros per person; there is also longer Menu Festival available at 100 euros per person). I can see that the kitchen has put a lot of thoughts into various starting bites, from the tasty beet to transparent pesto ravioli to smoked cheese biscuit. Parmesan \"tacos\" with tomato and basil was a very delightful bite, marinated mackerel with cauliflower in vinegar was an above-average \"sushi\" piece, and mushroom \"dumplings\" was also impressive in flavor as well as the display. There were some let-downs, such as overly creamy carbonara and surprisingly tasteless endives. With all the fanfare of the starting dishes, the main savory courses looked somewhat pedestrian although they were both delicious (but not breathtaking). Red mullet with pork jowls and aubergine gnocchi was very well cooked and I liked the combination of fish and meat but didn't quite generate the unique texture that I was looking for. Iberian pork tenderloin also had nice balance of flavor and texture. The desserts also came with impressive plating, with the \"lemon verbena\" and pineapple sorbet giving the refreshing flavor that got me ready for more sweeter desserts coming in, and the chocolate peppers with oil and salt were not overly sweet to my liking. I was a fan of the way the kitchen used a variety of ingredients and had beautiful presentations throughout, but on the other hand, it was quite hard to pinpoint the overarching theme. Was it the inherent limitation of molecular gastronomy? Was I starting to tire of all these fine dining tasting menus, especially after having been to a couple of those already in the Basque region? I couldn't tell, but I felt somewhat less satisfied than I expected I would be.The restaurant has a nice selection of wine that you could complement your meal with. I really loved the modern, minimalist dining room as well as the outdoor area that has a very romantic feel to it. The services overall were professional and attentive. Getting a reservation wasn't overly difficult, but the restaurant quickly filled up in the course of my meal. Disfrutar will definitely show something new in your dining experience if you're open to exploring how molecular gastronomy is done. On the other hand, if you're looking for something more classic, it may not be for everyone.", 
    "4.0", 
    "Ken S.", 
    "Manhattan, NY", 
    "206", 
    "357", 
    "disfrutar-barcelona", 
    4, 
    [
        "Modern European", 
        "Mediterranean"
    ], 
    4
]