[
    "Looking for a meal that is anything but ordinary, and getting tired of your typical steak and potatoes? Disfrutar (meaning \"enjoy\" in English) offers the cure with a menu that is cutting edge, whimsical, and seriously on point with its flavors. Truly some of the best molecular cuisine I've ever experienced, the courses were the perfect combination of interactive and well constructed. While I'm not sure there is any over-arching theme to the meal, each course told its own story. Also, whatever mastermind is in the kitchen should clearly consider a part-time career as an Theatrical Producer, as course after course came out with a flair for the dramatic. I'm guessing this is likely due to the chefs' El Bulli lineage, and I'm grateful for that time and training.Caulfilower \"sushi\" came alongside translucent dumplings that emerged from a billowing puff of dry-iced induced chicanery. Smoky, whiskey was used as a pre-course hand rinse for the deconstructed whiskey cake course. Mushroom consommé was served like an old fashioned cocktail, right down to the orange peel garnish. Each dish was elaborately displayed, plated with the utmost precision, and tasted even better than it looked. I won't provide a full play by play of each, as the menu is sure to change, but I will divulge that there are guaranteed to be some surprises, and a wonderful balance of textures.There are three different menus to choose from, a daily menu, the \"Menu Festival\", and the \"Menu Disfrutar.\" While I wouldn't describe Disfrutar as \"cheap,\" it was a bargain relative to other restaurants of its caliber, and in fact I've spent far more for far less. It was especially superlative with the amount of forethought and design that when into each plate, and I definitely left full afterwards (which again is not always the case with fine dining). The entire experience does take about 3 hours, so be sure to plan accordingly. However, when we went, our servers we very good about keeping things progressing nicely so that there was no huge breaks between where we found ourselves wishing they would hurry up (unlike some other establishments). Speaking of the service, I don't usually mention it unless it was extraordinarily fabulous, or mind-numbingly abysmal. Disfrutar fell into the former, catering to our every whim. The water never went unfilled, and they went above and beyond to make sure we were comfortable. Case in point, when the waiter noticed me hobbling towards the stairs for the restroom (I had injured myself earlier on our trip), he made a point to instead guide me to their service elevator, even though they were in the middle of filming on the other side of the restaurant where it was located and meant moving objects, and diverting multiple members to assist me. It is the kind of thing that most would not inconvenience themselves to bother with, but for a girl with a sprained ankle, it meant the world.Considering they just earned their first Michelin star, I'd say the cat is out of the bag. However I'm sure they'll be earning more in the future, so be sure to go while you can still get in without 11 months of planning.", 
    "5.0", 
    "Stephanie L.", 
    "Miami, FL", 
    "470", 
    "367", 
    "disfrutar-barcelona", 
    1, 
    [
        "Modern European", 
        "Mediterranean"
    ], 
    4
]