[
    "I was lucky to get a last minute reservation.  Disfrutar is opened by the 3 head chefs from El Bulli, so they draw a lot of the same techniques and inspirations (we definitely noticed similar dishes compared to Tickets).  Of course, I reserved a bar seat, and we were seated facing the dessert prep section.  They showed us around the rest of the restaurant to see the various prep stations. I love looking into kitchens! We started with beer, and I couldn't resist a €21 gruner veltliner. The \"disfrutar\" menu option (the \"shorter\" of the 2) was only €68:1. Passion fruit frappe with rum and coffee: smooth foam on top, tanginess from passionfruit without being too syrupy, cracked coffee beans on top, and a good amount of alcohol. This was their starting \"cocktail.\"2. Beet meringue: This \"emerged from the earth\". We were presented with a bowl of \"earth\" (black sesame seeds), and with some shaking, these little balls that looked like mochi appeared from the bottom.  They were light and airy, basically freeze dried beet and yogurt (very similar to the \"churros\" from Tickets)3. Tomato polvaron: shaped just like a polvoron, sweet tomato flavor, topped with their olive oil caviar drops (caviaroli). Caviaroli can be purchased by the jar there4. Ravioli: A transparent thin sheet of ?rice paper filled with the ingredients for a peso (basil, pine nuts, garlic, cheese), served with a Parmesan juice. You soak it for a few seconds on each side, and it creates a wonderful pesto flavor in your mouth.  This was a fun dish and must have been very challenging technically5. Aceituna: like the well known non-olive olives from El Bulli.  The green was coated in a shell that was the texture of chocolate (but not actually chocolate) with olive flavor insude, and the black one was similar but with blood orange and olive oil inside. Take these in one bite6. Smoked Idiazabal cheese: Frozen cheese like a semifreddo in texture that was creamy, slightly icy, but also really smoky. It sat on a thin crisp cookie and was imprinted with the name of a local cracker. It was served with sips of apple and celery juice to make it more refreshing7. Crispy egg and mushroom gelatin: BEST egg I've ever had. It was like a scotch egg but without the meat, and the batter was crisp and flavorful with a perfectly runny center. I don't know if I can ever eat a regular egg again. It came over a cut egg shell (fake) with mushroom gelatin inside. The gelatin was very rich and flavorful but a bit salty, and it was better with the bread from earlier 8. Seafood avocado meringue sandwich: the cool part was the meringue bread - it looked like bread and sort of had the texture of a light bread, but it was made of meringue, so it was very delicate with a hint of sweetness. The seafood salad inside was a bit rich for me, but this made a very cool dish9. Parmesan tacos: Parmesan cheese and tomato, with olive oil and balsamic caviar . The \"taco shell\" was made of clear gelatin, and the parmesan cream was a bit rich for me, but the super sweet tomato was great10. Marinated mackerel: high grade sushi served on \"rice\" of cauliflower.  The fish was amazingly fresh. The cauliflower rice added more texture (and less carbs), but the cauliflower could never have that same sushi rice flavor. The mushroom vinegar for dipping helped 11. Mushroom Dumpling: a dim sum tray with smoking dry ice and a clear gelatin dumpling with mushrooms inside. It's better with the mushroom vinegar. It had excellent mushroom flavor and a little texture and nuttiness from the pignolis inside12. Carbonara macaroni: gelatin macaroni with bits of bacon and cheese, then a carbonara foam poured over it, topped with Parmesan cheese. The carbonara flavor was rich and right on, but the pasta texture didn't do it for me13. Asparagus meuniere: white asparagus with herbs, hazelnut, capers and trout roe with a very tart foam. Interesting but not amazing.14. Salmonetes: red mullet topped with pork jowl and Gyoza sauce (flavorful), with pillowy eggplant gnocchi15. Iberico solomillo: iberic pork tenderloin and pibil sauce. They sous vided it, so it was crazy tender, and I liked the bursting false corn that tasted like super fresh corn16. Prepostre: leaves mulberries and apricot glacé and lime zest 17. Pimientos of chocolate and olive oil, salt and toast. The green had a smooth ganache center, but red was better with salt flakes and a cayenne kick 18. Lioness de cafe: coffee profiteroles on lavazza beans with a frozen centerTheir style is more like surprising takes on more traditional preparations such as muniere, carbonara, etc.   Their technique was daring and impressive (like the chocolate peppers and the ravioli!), but the menu items themselves were maybe less exciting.  I could have done with a little less gelatin (ie from the carbonara, taco, mushroom dim sum). Overall, a very cool dining experience and an impressive, reasonably priced meal for what you get!", 
    "5.0", 
    "Marilyn T.", 
    "Mountain View, CA", 
    "339", 
    "1490", 
    "disfrutar-barcelona", 
    12, 
    [
        "Modern European", 
        "Mediterranean"
    ], 
    4
]