[
    "first of all, this was probably the hardest venue to ever find. EVER.  it's tucked away in this neighborhood + even the local shopkeepers don't know where it's at when we asked for directions (though their own shops were a couple blocks away).  once you find it, you're thinking, \"did i just step into a rock'n'roll bar?\"the decor leans toward a trying-too-hard-to-be-a-punkhead-music-bar type.  black lacquer stools, tables, counters.  the art work showcased on the walls are not my style, but impressive:  globs of white paint that haphazardly form punk music figures smoking a cigarettes or playing a guitar on black backgrounds.we came for dinner around 8pm ('early' in barcelona standards) + perused the english menu that doesn't translate everything that's served in the restaurant.  the fare is predominantly sushi + asian cuisine.  or a hybrid of both.  we had the luna maki, sake maki + yakitori (that's skewered chicken for husband since i don't eat meat).  the edamame was a bit brown in color + cold.  very little sea salt on it + no bowl provided to place the emptied shells.  the maki rolls were just 'eh' + no available 'low sodium' soy sauce in the house.  the lifesaver of the meal (warranting a 3-star review versus the 2-star i would've given) was the yakimeshi:  this place's version of asian fried rice...the absolutely BEST fried rice (regardless the cuisine) we both have ever tasted + ate.  handsdown!!  eversince we got back stateside, i've tried to mimic this fried rice in my own kitchen + can't seem to master it.  i'd go back here just to try the yakimeshi again + get 'clues' as to what the ingredients are.other than this fabulous dish, i'd definitely go elsewhere for better sushi in general.  with barcelona being a port, there must be better sushi places out there.", 
    "3.0", 
    "Liz Z.", 
    "Foster City, CA", 
    "52", 
    "286", 
    "doble-zer00-barcelona", 
    5, 
    [
        "Asian Fusion", 
        "Sushi Bars", 
        "Japanese"
    ], 
    2
]