[
    "This is a 4.5 star review.  The food and dining experience was 5 stars, but there was an oddity with the final bill that leaves me removing half a star.The restaurant is small, with just a handful of tables, and a very attentive wait staff.  I don't think I've ever eaten in a place with the ratio of staff to diners in my life. It's an open kitchen, so you can watch the entire process of them preparing your food. I love that kind of experience, but I know it's not for everyone. You enter the dining room through the kitchen, so you can see how amazing the space is.The food is playful, and elegant, and I was impressed with the English the staff mustered up to address me.  I was eating alone, and I wanted the tasting menu, so it happened faster than your average meal. I never felt like I was rushed, nor did I feel like I was ever waiting for food.  They started off the meal with a \"tomato\" on dirt.  It had a tartare inside, and was heavenly.  The flavors were bright, and the presentation playful.  The second bite was a tapioca bread with a bright mousse inside.  Once they provide the menu, and let you know about your options (how can you not go with the tasting menu after a couple of fun bites like that?!) the somellier comes by and asks about wine. I told them that I only could handle one glass, so I asked for recommendations.  They said with the tasting menu to go with white, and then chose a glass for me, based upon my preferences on dryness of said wine, and the menu. It actually went surprisingly well with the dishes.Each dish was creatively plated, beautiful to see, and bursting with flavor.  The dishes came out in a variety of different temperatures, and each was very focused, balanced, and good.  The shrimp dish was probably the most impressive expression of shrimp I've ever had. Warmed through, but not fully cooked to change the texture, it was profoundly flavorful, and the sauce made with shrimp heads had amazing depth and pure flavor of shrimp. The Gin and Tonic dessert was a true tribute to Barcelona, but also included flavors of cardamom and yuzu, which somehow balanced despite having so many diverse flavors. It was kind of amazing.  It was an amazing meal, leaving me comfortable at the end, and not wanting more food, though not stuffed and in pain from over indulging.  It was pricey but justified (though not the mistaken bill, which as of later the same day, we're still working to resolve) in it's cost.  The actual Dos Hermanos who are the executive chefs were on site and in the kitchen, at 3pm on a Friday, which was awesome.", 
    "5.0", 
    "Erin O.", 
    "San Jose, CA", 
    "184", 
    "383", 
    "dos-cielos-barcelona", 
    1, 
    [
        "Modern European", 
        "Catalan"
    ], 
    4
]