[
    "I prepared for a Bachlorette party to have our final meal at Informal. I first discovered it on CNN, named as one of the top new restaurants in the world for 2016 so I knew I had to look into it ASAP. It was a great end to a great trip! I had reserved a table for 14 so we were given a tasting menu which made ordering and drinking super easy. We got plenty of food and wine and left the restaurant happy and stuffed. The service was super nice and the Manager of the restaurant was super accommodating. Everything felt super high class and the food presentation and quality was superb.We selected the Colom menu at 55 euros per person and the drink choice of three types of wine for 20 euros.  Everything was delicious and the wine kept on flowing throughout the whole meal.  Each sharing plate was easy to split between 3-4 people.Toasted flat bread with tomato and extra virgin olive oil - the bread was soft yet crisp on the outside, nicely complemented by a light tomato spread and olive oil. A great start.Warm artichoke salad potatoes, Jabugo ham, cheese and poached quail egg - creamy from the potato salad with refreshing crisp salad and well-cooked artichokes.Salmon tartar with avocado, vegetables, wasabi, topiko - The salmon and vegetables both tasted super fresh.Fine chicken cannelloni, mushroom and black truffle oil - I loved this dish. The chicken and mushroom was like a paste stuffed in this delicate pasta. So good. I never had a dish like this before.Roast beef flatbread - another winner, the flavor of the roast beef was super prominent.Hot and cold foie gras duo - Super delicate and full of flavor. A great dish to eat with some toasted crisp bread. Scallops, artichokes, Iberian pork and truffle oil - scallops were perfectly cooked. Seared on the outside, soft and buttery on the inside. Each plate had three which was plenty per person. Grilled steak fillet with seasoned vegetables - steak was cooked perfectly. Soft to cut with a butter knife. The seasoning was spot on and meat itself was so tender. Great execution in the dish.Star Bombay gin and tonic with tonka beans, lemon and raspberries - I wasn't sure what to expect from this pre-dessert but I was blown away. It had the consistency of maybe aired out mousse. It was delicate looking but man it was full of flavor. It was very refreshing and all the flavors just meshed so well together. A great and unique dish. Never had anything like it.Chocolate ice cream and ganache with olive oil and salt - A delicious end to a delicious meal.  The chocolate just shined. It was sweet but not overly sweet and the crunch from the crumbles added a great texture to the velvety smooth chocolate ice cream.Overall, an amazing dining 5 star experience.", 
    "5.0", 
    "Michelle L.", 
    "New York, NY", 
    "388", 
    "222", 
    "el-informal-barcelona", 
    1, 
    [
        "Catalan", 
        "Mediterranean"
    ], 
    3
]