[
    "My fiancé and I wanted to treat ourselves to a wonderful night out for our last evening in Barcelona, so we chose this spot. After having eaten there, I'm so surprised that this restaurant isn't at the top of the list of best places to eat in this lovely city! Read on to hear about our truly wonderful adventure there...My fiancé and I made a reservation for 8 PM, and had some extra time before our reservation, so decided to walk over there so we knew where it was. We arrived at around 7 PM, and saw that, while it looked like the restaurant was open, the tables were empty, so we thought, \"Why not go in and try to get a table earlier?\" The very friendly hostess informed us that they actually didn't open until 8 PM (which we should have expected after having been in Barcelona for several days, but still took us a little by surprise - we're used to eating at 6 PM in restaurants that close by 9:30 PM!).The hostess was so kind and sweet, though - she offered to set us up in a lovely, cozy sitting room overlooking the eating area, and a cheerful bartender came right over to ask what we might like to drink while we waited. The whole initial experience was both elegant and friendly, and the design of the restaurant has a well-curated, sophisticated but very comfortable feel. My fiancé and I sipped our very tasty drinks and had a blast looking through some of the fun, fashionable coffee-table books that they had laid out for guests to peruse.When it was time to eat, we were again very impressed by both the food and the service. We made fast friends with our waiter, Alex, who was eager to help us choose food we would love. Everything we ate was superbly made and was presented so beautifully. I really felt like a queen! In fact, we felt so well taken care of that I think we rather monopolized Alex by chatting with him about where we were from and what else we had done in Barcelona - he was extremely gracious, tho, and was genuinely interested to get to know us and hear about our travels. The highlight of the evening was when, after our delicious dinner had come to a close, he asked for some break time to take us to the roof of the restaurant to show off their very cool rooftop bar - it was pretty chilly still, so it wasn't being used at that time. I only wish that the weather had been warmer so we could have experienced it in all its glory. I'm very jealous of anyone who gets to eat at this lovely gem of a restaurant in the spring, summer or fall - it will be a night to remember for sure!", 
    "5.0", 
    "Laura S.", 
    "Cranston, RI", 
    "23", 
    "2", 
    "el-informal-barcelona", 
    2, 
    [
        "Catalan", 
        "Mediterranean"
    ], 
    3
]