[
    "4 stars for ambiance, 4 for food flavor, 2 for portions, 1 for service and 1 for value.I decided to walk down a small alley and found this place.  I was enchanted by the atmosphere.  I went back and got my husband.  We checked out the menu at La Taperia and decided to eat dinner there, as opposed to the myriad of tapas places on the Passeig de Gracia.  It looked very Art Deco cool.  It was absolutely lovely.  I wish I could say the same about our waiter.  The service was poor at best. When we arrived,the restaurant was nearly empty.  The waiter seemed to have an attitude from the get go.  I am not sure why.  We were dressed as well as any of the other patrons.  We were appropriately apologetic for not being able to speak Catalan or Spanish.  Our 6 year old son was with us, but he is always well-behaved when we eat out, so really, I don't know what the problem was.  We wanted to order a pitcher of sangria.  The waiter asked us if we wanted red or cava.  We said we didn't know what cava was.  He kept repeating cava until I realized it was with \"champagne\".  We ordered that, but what arrived was a premixed, bottled, cava sangria called Lolea.  It did not come in a pitcher as implied by the picture on the menu, nor was it 1liter, as stated on the menu, it was only 750mls and it was 24Euros.  Also, it tasted like a bottled mojito.  We sent it back and asked for the regular sangria, which also came in a 750ml bottle made by the same company ... for 20Euros. More importantly,it was not very good and we both woke up with a headache in the middle of the night.  We ordered about 5 tapas, of which, we only ever received 3.  Of the 3 we received, we got: Gildas (2pieces) ) for 5Euros, garlic shrimp (4 small shelled shrimp) 7Euros, bread with tomato, olive oil and salt 3.50Euros.  We waited and waited forever for the rest of our food, but no one came to check on us.  Other tables were served and received the same dishes we had ordered but had not received.  When the waiter finally did come to the table, we told him we had not received our food and asked for the check.  We have had many positive experiences eating all around BCN in touristy and non-touristy areas.  This was by far the worst service we have ever recieved.  The food, what we had of it, was tasty, but really small.  We left very hungry and angry.  Go to El Nacional to look at the architecture, soak in the atmosphere and maybe have a drink, but save your money and your sanity and eat elsewhere.", 
    "2.0", 
    "Suzette P.", 
    "San Francisco, CA", 
    "3", 
    "2", 
    "el-nacional-barcelona-5", 
    43, 
    [
        "Seafood", 
        "Tapas Bars", 
        "Brasseries"
    ], 
    2
]