[
    "Normal experience. Buffet-restaurant in the University area of Barcelona; for 15 euros you could have a definitely huge choice (around 80 meals) of traditional Spanish dishes. Ideal for groups because the restaurant is spacious: tables for two as tables for twelve guests. Frequented by both tourists and Spaniards. The variety of starters, first and second dishes, is awesome  (Paella, Empanadas, Pimiento de Piquillo, Catalan Cream, ...). But the quality of these courses its low. I only racommend this restaurant to those are wishing to enjoy a good roast: choritzo of various types, morcilla, steaks and pork chops; a chef  roasts in front of you all the meat you want. Expensive drinks; \"Sangria\" is not recommended.Nada especial. Restaurante de estilo buffet en el área de la Universidad de Barcelona; por 15 euros tienes a tu disposición una elección sin duda enorme (80 tipos) de platos tradicionales españoles. Ideal para grupos porque el restaurante es amplio, equipado con mesas de dos hasta de doce personas. Frecuentado por los turistas y los españoles mismos. Es impresionante la variedad de entradas, primeros y segundos platos (desde la Paella hasta las Empanadas, desde el Pimiento de Piquillo hasta la crema catalana). Pero la calidad de estos platos no es tan buena. Yo lo consejo a los que deseen disfrutar de un buen asado: choritzo de varios tipos, morcilla, chuletas y costillas de cerdo; en una  esquina del buffet, el cocinero prepara en frente de ti, toda la carne que tu quieras. Bebidas caras; No se recomienda la sangría.Non male. Ristorante a buffet nella zona universitaria di Barcellona; per 15 euro avete a disposizione una scelta decisamente enorme (!) di pietanze della tradizione spagnola. Ideale per gruppi poichè il locale è spazioso, provvisto di tavoli da docidici come da due persone. Frequentato sia da turisti che da spagnoli. La varietà degli antipasti, dei primi e dei secondi è impressionante (dalle Empanadas alla Paella, dal Pimiento de Piquillo alla Crema Catalana). La qualità di questi piatti però è piuttosto scarsa. Lo consiglio solamente a chi volesse gustarsi un buon arrosto:    choritzo di vari tipi, morcilla, braciole e costolette di maiale; un cuoco all'angolo del buffet arrostisce di fronte a voi tutta la carne che volete. Bevande costose; sangria sconsigliata.", 
    "2.0", 
    "Francesca L.", 
    "Berlin, Germany", 
    "1", 
    "7", 
    "el-puma-barcelona", 
    4, 
    [
        "Buffets", 
        "Catalan"
    ], 
    2
]