[
    "I know El Quim has quite a reputation and is a must-try for most visitors to Barcelona. After all, that's why we wanted to go too, we had heard so much about it and seen it on every travel show that featured Barcelona's restaurants. But if I have to be honest, I would say the food and our experience were good at best, not great or exceptional in any way.It's in the middle of the Mercat de La Boqueria where you sit at counters or hover over others who are already there, waiting to snag their seat. We strategically ate early or at odd times during most of our trip so getting seats most meals wasn't really an issue which also applied El Quim (I think we went at 11 a.m. or so). We clambered onto empty seats as soon as we got there and ordered away based on recommendations from the guys behind the counter and whatever else looked good.The Baby Squid with Eggs are a specialty of the house. Eggs over-easy come with a heap of stir fried baby squid on top and though quite tasty, is also really salty. I liked the Deep Fried Baby Artichoke Chips which were in season and highly recommended by the staff as well as the Razor Clams but both dishes were unadorned and tasted good because of their simplicity. The Patatas Bravas were a bit greasy, and the Croquetas were lukewarm  with everything congealed inside. I'd avoid the Pulpitos (Octopus)- it's braised with onions and has a bit of a muddy flavor. The staff can be fun or standoffish. It really depends on how you interact with them. Ask for recommendations and get a conversation started which will make the meal much more enjoyable. It's also a good place to chat and make friends with other travelers (we even shared some of our food with our neighbors who were visiting from Singapore) but you might feel a bit rushed with people waiting behind you, willing you to leave, burning holes into your back while you eat. It's also quite expensive compared to a lot of places with a similar or a even better calibre of food but given it's location, it's not surprising. I'd recommend it for the experience since it is a \"must-try\" but you can get better food at better prices elsewhere. Also, make sure to check days and times they are open. Since they're housed inside the market, they close early.", 
    "3.0", 
    "Bora K.", 
    "Long Beach, CA", 
    "686", 
    "614", 
    "el-quim-de-la-boqueria-barcelona", 
    40, 
    [
        "Tapas Bars"
    ], 
    2
]