[
    "Yelp, I need a 6th star for El Quim de la Boqueria!This place could easily be my favorite 'restaurant' in the world! Located in the heart of Mercat de La Boqueria, El Quim is a food stand with just 18 bar stools. The menu is seasonal and produce is purchased from the market. Eating here is quite an experience and should not be missed. I repeat, YOU SHOULD NOT MISS THIS! While most of Quim's signature dishes contain meat and seafood, vegetarians will still fare well here. The bill will be much cheaper too!  Prices are on the high side for meat and seafood, but it's worth it -- this according to the  orgasmic looks and moans from other patrons.The only way to get a seat is to wait patiently behind other patrons. Groups of 4 or more will be very difficult to seat together. You might be tempted to score a seat at the neighboring El Petit Quim, but wait it out for the main area surrounding the kitchen. You're in for a treat watching the kitchen staff's dynamic. Not only are these dudes super easy on the eyes (omg hawtness) but their ability to be both playful and efficient - while downing endless glasses of cava at that -- is remarkably entertaining. Veg-heads, eat this:- Patatas bravas -- I went on a serious patatas bravas binge in Barcelona and Quim's was hands down the BEST! Portion good for sharing.- Mixed vegetables - simple, yet intensely flavorful. Veggies are swimming  in EVOO, good for dipping bread. - Zucchini omlette - huge slice, portion large enough for two. And of course it was delicious!The man, Mr. Quim himself, often comes out of the kitchen area to chat with diners. We were ever so lucky to have him deliver our coffee and complimentary petite chocolate dessert. He chatted us up for a little which lead to me revealing that my birthday was the next day. Just when we were about to ask for the check, Quim called us in to the kitchen area for a celebratory birthday toast. Cava flowed like water while he and his staff sang 'Happy Birthday' to me! I died. I died, I died, I died! There are no words for how memorable Quim and his staff made both my birthday and Barcelona experience. Muchas gracias, besos y abrazos!Note:- Getting there:  Metro L3[green line] Liceu.", 
    "5.0", 
    "Juliette J.", 
    "Fort Lee, NJ", 
    "192", 
    "350", 
    "el-quim-de-la-boqueria-barcelona", 
    34, 
    [
        "Tapas Bars"
    ], 
    2
]