[
    "I live in San Francisco, California.  It is one of the numerous food meccas of the world.  We are spoiled with fresh, local, self-sustainable, organic (just adding fancy words at this point) ingredients literally found in our backyards.  Top notch produce in any part of town, in any cuisine.  But El Quim can easily put any of our famous restaurants to shame.  The seafood - ah-mazing!  We're surrounded by water ourselves, but we don't have the warm seas to hold such varied seafood.  It was a bit daunting at first.  There are no reservations nor is there a line to put your name down. You literally have to stand behind people until they finish their meals.  And in Spain, the wait staff never pressures you to leave.  You take all the time you need!  So be patient and don't nag the patrons that occupy your would be seats.  Amusing side story... my friend and I were waiting a good 30 minutes for a couple to leave.  In comes sauntering in is Ian Somerhalder of LOST fame starving and wanting a quick in and out before fans start to swarm him.  He is eyeing our same seats!  His \"people\" kind of swooped in on our seats, but Ian was very gracious and said we were there first and decided to let us have the seats. Cute and courteous!When you do finally get to sit down, you can request the English menu.  Prices are a bit high.  You're in a very touristy spot and they will jack you, but the quality of the food is worth it.Musts:Grilled prawns - flavored by evoo and sea salt and it's own amazing juices (rendered me speechless! lots of delicious brain goo too!)Baby squid cooked in it's own ink over eggs.Oxtail stewrazor clamsAside from the stew, everything was alive a few minutes ago or caught fresh earlier on.  The prawns are gigantic and so amazing.  This is a dish I will remember until I die. Service is a bit brash but they all mean well. They are passionate about their food and will joke around once they see you enjoying the food.  A great experience and  favorite in the entire city of Barcelona!", 
    "5.0", 
    "Chris T.", 
    "San Francisco, CA", 
    "111", 
    "264", 
    "el-quim-de-la-boqueria-barcelona", 
    48, 
    [
        "Tapas Bars"
    ], 
    2
]