[
    "4.5 stars.I was tempted to give it 4 stars, but honestly with food tasting like heaven, it would just be wrong to not give credit where its due!Atmosphere:  Located in the famous El Boqueria market on La Ramblas, its probably the 2nd most popular stand in the market.  I did much research and chose this over the former due to reviews by other food-fans.  The open from early morning to last afternoon (4ish?), and we arrived around 3pm straight off our flight.  Its first come, first serve, so I stood like a hawk waiting for the next 2 seats to open up. There are 5 cooks in a 10 square foot space with a kitchen.  The smell from the kitchen is intoxicating - even sitting amongst pig brains in the stand next door.Cost:  This is where the minus 0.5 stars comes. I get it, they're delicious.  But in true fashion, they honestly could be just a tad more affordable. But i guess why if they've got people from all over the world to pay what they're currently charging?  We had 3 dishes (the finest) for about 70E, plus 1 coca lite, 1 glass of wine.FOOD!  Must of been some of my favorite dishes.  We had 3, all 3 will never be forgotten.  The ingredient is what shines.  Fresh fresh seafood, probably caught same day and cooked with simple delicious flavor.1) baby squid with leeks, garlic, s&p: so simple. came with bread to clean up with sauce. 2) garlic gambas (prawn) in a white wine reduction: the only preparation in all of spain without the head one.  chunks of roasted garlic in olive oil.  prawns must have been caught that morning!3) wild mushrooms, foie gras, fried egg: my favorite dish. triple richness and triple amazingness. enough said.did you travel half way around the world to eat?  if yes, you must stop by El Quim.  Well documented in many travel sites, but reiterated here.  A must go.", 
    "5.0", 
    "Ceal P.", 
    "Chicago, IL", 
    "50", 
    "166", 
    "el-quim-de-la-boqueria-barcelona", 
    50, 
    [
        "Tapas Bars"
    ], 
    2
]