[
    "We came back for dinner, and sure enough, turnover was quick even at the bar.  There were a lot more napkins on the ground but a lot less pintxos on the counter.  I actually thought it was more fun to see the pintxos when we came earlier in the day, plus those are only €1.50 each, which is ridiculous. This time around, we went for some more substantial stuff: - Pulpo: previously canned, so the texture was less ideal. They sautéed it up with a good coarsely puréed garlic potato mash. If this had been fresh octopus, it would have been amazing- Razor clams: smaller than the ones we had at Paco Meralgo. These were actually fresh.  They had good seasoning, but the texture wasn't as good as the Paco Meralgo ones- Cheese: we saw them cutting into big wheels of cheese and couldn't resist. We got a goats milk and a sheep milk cheese, and both were nutty, salty hard cheeses, strong in flavor (which I liked a lot) - Jamon: they were able to do a half order of the iberico for us - Pan con tomate: it had more olive oil than I like. It made it a little too rich to be a base for some of the other food we ordered - Bacalao: this had been my favorite dish at lunch. It was the canned bacalao with their sweet dried tomatoes and an olive tapenade. The flavor combination was perfect, but too bad it was also drowning in oil - Pancetta de iberico: this was a different pancetta and had less fat and more meat, and it was served on a flat cracker instead of a long bread stick.  This was still really rich, salty, and goodDrinks: - Beer on tap- House cava: too much like Txakoli to me- Brut rose: better than the cavaThe guys were the same ones who had been there right when they opened around noon, and they had clearly been working hard all day.  It's super busy in there, but they did everything with a smile on their faces and were super friendly.", 
    "4.0", 
    "Marilyn T.", 
    "Mountain View, CA", 
    "339", 
    "1488", 
    "el-xampanyet-barcelona", 
    34, 
    [
        "Tapas Bars", 
        "Tapas/Small Plates"
    ], 
    2
]