[
    "Ah, I will forever fondly remember El Xampanyet as my first traditional Spanish tapas experience. I hate crowds. I really do, but the things I do for food are shameful. The bf and I came here around 8 PM, prime Spanish eating time, and it was so packed people were spilling out of the tiny doorway. They have a few tables, but unless you want someone's butt in ya face the whole time I suggest you do as many do and just stand. Because I had a few coins in my karma box, we scored two spots at the bar. We immediately dove into their house cava, which is as delicious as everyone says. They fill your glass to the brim too!This is no place to be shy and coy. Rather, grow some huevos and be vocal. Our waiter/bartender person was very helpful, suggested things and explained what things were. Another man working the counter chatted with us because he spoke English, and established some sort of kinship with me because he and I are both Filipino (I'm only half but don't tell him). The two together were hilarious. They compared two different pieces of asparagus to the size of the Spanish versus Filipino male genitalia. Delicious house wine and penis jokes? What's not to love.AND THE FOOD. Like most every other tapas bar, the seafood is canned. But it is fab. They put some sort of dressing or sauce on each tapa that makes everything amazing. But the show stopper was some sort of mixed plate deal (suggested by my Filipino brethren) where you get one prepared seafood and one prepared meat. We told him to give us whatever he thought was good, and he delivered. We were presented with a gorgeous plate of tender, grilled pork covered with an olive oil based sauce  packed with herbs. The calamari rings with it came with the same sauce. It was probably the best pork I've had. If I could, I would've eaten it every night we were there. Until next time!", 
    "5.0", 
    "Christina D.", 
    "San Francisco Bay Area, CA", 
    "313", 
    "387", 
    "el-xampanyet-barcelona", 
    19, 
    [
        "Tapas Bars", 
        "Tapas/Small Plates"
    ], 
    2
]