[
    "A very typical Tapas Bar, right in the heart of El Born--just down the way from the Picasso Museum and across from Tapeo, another restaurant I highly recommend. El Xampanyet is easy to find. It's the place PACKED with people, some spilling outside onto the street. You'll hear the crowd too. Hungry locals and tourists shouting their orders, each louder than the other, so the workers hear them. Be prepared to be loud and maneuver your way through tight spaces. A well placed elbow or two will help create some space.Sometimes eating tapas is like boxing out for a rebound. The lady and I entered during their lunch rush. Though it seems like every minute they're open is one rush or another. We put on our game faces and worked our way to the bar. On the counter is a display of a few tapas, plus they have a menu to look over. We spotted a couple things in the display case and ordered those and two beers while we looked at the menu. The counter is the best place to stand (don't expect to sit down) because you can chat with the workers and also see all the dishes the kitchen is pumping out. That always helped us decide what we wanted to order. When we saw something that looked good, we'd ask about it and then end up ordering one for ourselves. After downing some Stuffed Potato Bites and an Artichoke dish, we ordered a Tortilla de Chorizo. Oh my, easily one of the best Tortillas I've had in my life. My mom would be butthurt to hear that, but it's true. It was cooked perfectly, so the egg was a tad runny in the middle, and the chorizo added a ton of flavor. We regretted (still to this day, TBH) not going back again while in Barcelona. You'll regret not trying it at least once. Trust me. I want to move to that neighborhood just to be close to El Xampanyet. It's gotta be amazing being a \"regular\" there.", 
    "5.0", 
    "Jon S.", 
    "Campbell, CA", 
    "188", 
    "267", 
    "el-xampanyet-barcelona", 
    14, 
    [
        "Tapas Bars", 
        "Tapas/Small Plates"
    ], 
    2
]