[
    "I mean, this is such a pleasant place to have a meal ...Look, there hasn't been fresh seafood in Ashe County since the Pleistocene, when many of the local fossils were comparatively young Rotarians, so I may not be your go-to guy on, well, ... fish.  This said, this place is a heck of a good fish restaurant.  We had some wonderful moules for starters -- fresh, tasty, light.  Went great with the ubiquitous toast with tomatoes.  (I think \"ubiquitous\" might be Catalan for \"toast with tomatoes.\")  Then the fishes themselves:  a delicious cod, a mouth-watering dorade.... both baked, after a fashion, and served with various fixings (potatoes, onions, peppers) that tasted so good.The food is great and so is the atmosphere.  You're in a charming, off-the-beaten-track neighborhood (assuming you're at the restaurant, not in Ashe County, which wasn't even charming during the Pleistocene) facing a quiet neighborhood square with a few great trees.  It's quiet and lightly peopled.  It's so nice.The people who run the restaurant are helpful and unpretentious -- professional but not unctious (or is *that* the Catalan word for \"toast with tomatoes\"?)We drank a high-end bottle of wine and ate all of the above (plus probably a bit of the writing on the plates, not to mention coffee and dessert) for 130 euros all-in.  Although that is about 115 euros than we like to spend on dinner for two, in this case it was well worth it.Oh, yeah ... I just thought of something else ... Like I said above, the food is really excellent, and maybe if you are a person who goes out to eat for the food, that's enough to make this place five-stars.  What I really like about it is the \"two-fer\" aspect:  Great food *and* great locale.  So what I find myself wondering is what the place is like when the weather is cold.  The inside of the restaurant, like all other restaurants in Spain, is a mixture of traditional and 80s disco decor.  The itinerant Basque football fans who had followed Athletic to Barcelona for the Copa del Rey certainly seemed to be enjoying themselves at a big table indoors, so maybe indoors is fine.  Or maybe it's just easy to be in a good mood *before* the match.", 
    "5.0", 
    "Biggie F.", 
    "Ashe County, NC", 
    "3", 
    "101", 
    "els-pescadors-barcelona", 
    7, 
    [
        "Catalan", 
        "Mediterranean", 
        "Modern European"
    ], 
    2
]