[
    "I am completely dumbfounded by the glorious reviews for this restaurant.  It was recommended by the concierage at our hotel and we were expecting some very good fish.  However, when we arrived there after a long cab ride, we were surprised at the lack of any ambiance and the rather amateurish way it was operated.  If we hadn't come so far across town, we probably would have left. So we stayed and hoped that at least the food would be as good as we were told.  It wasn't. We both ordered a salad and the seabass. The salad was a simple green salad with a few pieces of tomato and 3 green beans. We were offered some flavorless olive oil and some balsamic vinegar to put on it ourselves. The salad was something you might throw together from your fridge in a hurry but this one cost 11 euros. We also had two glasses of a red wine which was good but we were given about a fourth of a glass each. At this point we were still hoping that the fish would save the day. It didn't.  The fish was presented mostly deboned but in lots of broken pieces on a plate with some slices of barely cooked potato smothered in that same flavorless olive oil, some sliced white onions also smothered in olive oil and a cooked whole tomato smothered in olive oil. Other than the flavorless olive oil, there was no seasoning of any kind on the fish or the potatoes or the onions or the tomato. That's it. That was the plate.  And the taste?  Almost no flavor of any kind.  Ah, but the price?  42 euros!  Over 50 USD.  I cannot emphasize more what a complete sham of an experience this was and how grossly outrageous the price was (123 euros for our meal).  Fortunately, we had good meals at other places in Barcelona:  Bar Mut, Agua. This one should be avoided.", 
    "1.0", 
    "David L.", 
    "Sherman Oaks, CA", 
    "0", 
    "2", 
    "els-pescadors-barcelona", 
    21, 
    [
        "Catalan", 
        "Mediterranean", 
        "Modern European"
    ], 
    2
]