[
    "Came here for lunch on a weekday and ordered one of their tasting menus.  The service was very professional and the atmosphere is lovely and very spacious.  There was one large family at a table with a child watching a show on his iPad with the speakers on, but otherwise it was a peaceful meal.  They were prompt with the bread delivery and replenishment.  Appetizer - goat cheese filled puffs, parmesan crispiesCan't go wrong with crispy cheese! 5/5Salmon Tartare (not listed on the tasting menu)refreshing and well seasoned with dill 5/5\"Surf and Turf\" - pig trotters, razor clams, octopus over a frisee salad in romesco sauceFrisee would not have been my choice of greens as it is bitter, but the meats were absolutely delicious and clean in flavor. 5/5CanneloniNot the most pretty presentation (a white roll, browned on top, in a white sauce with truffle specks, all in a white bowl), but this was one of my favorite things I ate in Spain.  I mean, come on... cheese + truffles + pasta + tasty, tender meat?  5/5Squid with artichoke cream sauceThe squid was topped with kind of a one-note soy sauce tasting sauce.  The artichoke cream sauce was fine, but I thought the dish was a little blah overall. 2/5Sea bass in a cream sauce with ratatouille and a dollop of spinach pureeSpinach puree was very bold and tasted great with the sea bass.  I didn't care for the cream sauce on the seabass, as it was not aesthetically pleasing (brilliant white sauce over a white fish), nor did it have any sort of distinct flavor to it.  The fish would have been better paired with just the ratatouille and spinach puree alone. 3.5/5Suckling Pig with strawberriesThere was a small curly hair in my pork (likely/hopefully a chest hair) but they replaced it within minutes.  The pork skin was crispy and the cut had more meat in it than in other ways suckling pig has been served to me in Spain.  I was happy to see it was not all one block of fat.  Loved having fresh strawberries with the pork, and a pretty green (maybe kiwi) puree to make the red of the strawberries really pop.  Crema CatalanThe top of the whipped custard was bruleed, followed by a layer of toffee ice cream, and lemon curd on the bottom.  You wouldn't think it'd work, but this was quite tasty!  4.5/5Chocolate SouffleThe chocolate souffle type dessert was served in a tiny red Le Creuset - so cute!! - with a mini scoop of hazelnut ice cream.  It was a pleasant surprise to find pop rocks under this ice cream.  Tray of Sweets - fruit jelly, chocolate bonbon glazed in bronze, cake bite with hazelnut creamThese were a pretty final treat to the meal.  The bonbon was the highlight - very rich and delicious.Overall a fairly priced (65 euros each) and well thought out tasting menu.", 
    "4.0", 
    "Christina G.", 
    "Walnut Creek, CA", 
    "42", 
    "204", 
    "gaig-barcelona-4", 
    2, 
    [
        "Mediterranean", 
        "Catalan", 
        "Signature Cuisine"
    ], 
    4
]