[
    "The seasonal tasting menu costs 65€ per person. This was one of the best meals I ever had in Europe and probably within my top ten anywhere.It all started with delightful amuse bouches. First, a small plate with 3 bites: a hint of curry in a shortbread-type cookie, a seaweed type chip, and a cheese chip. Then came a small plate with 3 more bites: a blistered Padrón pepper, a raw mussel and raw clam on a chip, and caviar on raw mackerel on another savory crumble cookie-type base. Thirdly came a small serving of an excellent asparagus custard with little pieces of asparagus integrated within the custard. The excellent bread was served with sea salt (quite briny) and the best olive oil.As to the menu, comments in [brackets] below: (1) Fine puff pastry with oven-cooked vegetables and prawn from Palamós, outbreaks and endive [The prawn came head on (all the better to suck), hot to the touch, perfectly cooked, and sweet as the west wind. Great.](2) Traditional cannelloni with truffled sauce [Simple, perfect.](3) Confited cod with emulsion and sweet chili [My least favorite dish because the flavors were not as fulfilling to my palate as everything else; but it was perfectly cooked protein and very good.](4) Trawled baby calamari filled with its meat and morels [Another simple and perfectly executed stunner. There was so much natural umami in this dish that it tasted like it could have been seasoned with soy sauce - which it was not.](5) Crispy boned suckling pig with strawberries and soft onion [The protein was a flattened, crispy, deboned, and picked/pressed square of delight. I was dubious of the strawberries when I saw it on the menu but it worked exceptionally.](6) Gaig's Catalan crème brûlée foam, ice-cream, and toffee [Maybe one of the most extraordinary desserts that I have ever had - as the foam disappeared instantly in my mouth I dug deeper and deeper into bright, refreshing explosions of citrus, sweetness, and satisfaction.](7) 'Fake Sacher' cake with passion fruit sorbet [Fake because the cake was made with something I never quite identified but suspect was beet infused - I never tasted the dirt of beet, but it was the color of beet and tasted like nothing I've tasted before. The sorbet was incredibly bracing and tart - just fantastic.]", 
    "5.0", 
    "Brski B.", 
    "San Francisco, CA", 
    "6", 
    "237", 
    "gaig-barcelona-4", 
    5, 
    [
        "Mediterranean", 
        "Catalan", 
        "Signature Cuisine"
    ], 
    4
]