[
    "Short story - if you're passing through Barca and looking for delicious but affordable tapas, THIS IS THE PLACE.For tapas, many places in Barca are overpriced for the quality (many are not! but come with an even higher price tag and/or remain unknown to tourists).  well-worn travellers, we were dying for authentic but affordable tapas. It was a goldilocks situation: We'd been to overpriced, half-empty tourist traps (too cold), and had just found a place with *gasp* free tapas but it was totally jammed with locals and was obvious little to no english, or patience, would be thrown our way (too hot). We had just about given up hope when we ended up outfront of Gasterea thanks to Yelp. At 1.90 euros per tapa, and looking at the vibe inside which appeared to be an appropriate mix of locals, expacts, and a smattering of tourists, we felt it was worth a shot. It was 11pm on a saturday and it was quite full but the saving grace was along one long wall there is one ongoing, elbow high, thin counter that you can stand at and still enjoy a beer and tapas, so searching awkwardly for a stool or waiting ages for one wasn't necessary. We simply walked in, found space along this counter, and stood there reading the chalk menus. Gasp - a small plastic menu with english was available. We weren't sure how to order when the barman just walked up to us. We asked for cervesas and two tapas. When i told him, in bad spanish, that i speak very little spanish, he smiled and was extremely patient and kind with us the whole night - i highly recommend *always* learning to say you don't speak the language IN the language you don't speak. (rather than shouting slowly in your mother tongue).  He seemed to very much appreciate the meek attempt to speak spanish and i do think this helped us the rest of the night.Well, to the real point - the tapas/pinxtos were killer. 1.90 gets you one portion so it still adds up but as least you're not throwing down 9 euros on calamari and getting some nasty must of it in return. If you really didnt like it, you're only out 1.90. Luckily, even at 1.90, the tapas were pretty exquisite in quality. We enjoyed literally everything we ordered.  there was one other menu of casual plates that were 2.95 - the portions were much bigger (not huge of course but enough to share) and i think a better ratio of food for price. However, not as much variety. We had beers, cider, and wine (4 each i think, total) and about 7 tapas (plus 1 or 2 treats on the house!) and we paid 32 euros. And thus, Gasterea has my heart forever.", 
    "5.0", 
    "Kate H.", 
    "Vancouver, Canada", 
    "60", 
    "28", 
    "gasterea-barcelona", 
    17, 
    [
        "Basque", 
        "Tapas/Small Plates", 
        "Pub"
    ], 
    1
]