[
    "Just moved across the street from this place-- even though I've only been living here a few days, it's been pretty consistently packed every time I've walked by. Their lunch menu is very affordable, the servers are extremely helpful and welcoming, and the food is astoundingly fresh. The portions will leave you very satisfied, so come hungry!I walked in during a busy lunch service and was greeted by very friendly waiters. I was seated almost immediately. The menu was in Catalan, which I'm not quite fluent in yet-- but the waiters were more than happy to translate for me. I had a really lovely artichoke tempura to start with, which was cooked perfectly. The tempura wasn't excessively heavy on the batter, and despite being a fried appetiser, I felt the dish was surprisingly light and refreshing. I had a tuna dish as my main, served with a vegetable side (mainly potatoes). Everything was very nice, but my fish was unevenly cooked. The dish was also rather heavy on the paprika.  I was happy to finish the plate as these were small flaws. The ingredients that were used were very flavourful and again, fresh.The dessert served was a pina colada natilla, topped with rum. WOW. This dessert was complex and really very impressive. Again, very strong flavours and a very light overall feeling to the dish, despite having a lot of fat (as a natilla is a milk and egg based dish). I really, really loved this dessert and really hope they have it when I returnThis is definitely one of the best places to have lunch at in Gracia. The chefs at Goliard are very impressive and talented. I think making fatty foods taste light and airy is one of the most impressive things a chef can do. I came very close to giving this place 5 stars. Minus one star due to the uneven cooking of the fish, unfortunately. I also noticed the table next to me had ordered some dishes that were similar to mine but were served in a different way (simple differences in plating and garnishes). It wasn't anything excessive, but worth noting. I'm really looking forwards to trying more of Goliard's food. They seem to have a very interesting tasting menu that I'm excited about! I saw the table next to me eating it and they seemed to be having a fantastic time!EDIT: Returned afterwards with some friends for dinner and while the waiters were very attentive to allergies, the kitchen staff kept sending food up with the offensive ingredients (which the waiters would almost serve, recognize, and then have to take away). Guess their restaurant needs a bit more communication between staff members.", 
    "4.0", 
    "Siddhi L.", 
    "Barcelona, Spain", 
    "74", 
    "102", 
    "goliard-barcelona", 
    2, 
    [
        "Mediterranean", 
        "Modern European"
    ], 
    3
]