[
    "First of, Barcelona is the Vegan Capital of Spain and it's becoming the Vegan Capital of the world.  I live in Los Angeles and I thought we were good here and I was pleasantly surprised with Barcelona.  I stumbled into Gopal while walking through El Barrio Gotico (Gothic neighborhood).  El Barrio Gotico is located a few blocks away from the end of the Ramblas and close to the beach.  Gopal is located near a beautiful plaza in the middle of El Barrio Gotico.  The location is very small and does not have sit down service, only take away.  However, the prices are so affordable that you're gonna want to eat and take everything they have there.  The first time I was there was the first day of my 15 day European trek.  I was going to France after Barcelona so I decided to take some pate in case I didn't find Vegan options in France.  Oh was I right, the pates were such a life saver and do not get me started on how DELICIOUS and cheap they were.  One of them was 5 Euros and the other one was 4.5 I think.  The Menu is written on the wall and has several combos like in America, in which you can include a burger, french fries (patatas bravas) and a drink.  He does not sell alcoholic beverages but he has non-alcoholic beer.  He also had some sweets and he had some moose, which he claimed to be the first time he received them.  Everything was beyond delicious and super cheap!  I took 3 combos, 3 types of sweets and the 2 pates and I ended up paying about 36 Euros! I went back last week for the end of my trip and again, I went there to eat two times.  This time, I tried the Tortilla de patata, which is Vegan Version of a Spanish Tortilla.  OMG!!! I do not know what they put in that tortilla but it was so delicious and addictive!!! I let the cook's girlfriend know that I loved it and I went back for more!The only inconvenience is that I had to go back to the hotel to eat my food because he doesn't have seating space.  During a nice day, you might be able to find some park benches near parallel but when I went, it was too cold to sit down and eat al fresco.  I hope that they're able to eventually get the tables back.  I heard that at one point, they had them.  From the burgers, I would recommend the Teriyaki and the Gopal Burger.  He recommended me the Mexican but I was not that impressed.  The patatas bravas are so fattening but you're on vacation, so indulge :) I highly recommend this place.", 
    "4.0", 
    "Mil A.", 
    "Whittier, CA", 
    "1", 
    "17", 
    "gopal-barcelona", 
    2, 
    [
        "Vegan", 
        "Bakeries"
    ], 
    1
]