[
    "This place is perfection. We walked in around 1:30p and it was about half-full. We were promptly shown a table by THE nicest server. There are cute corner nooks, a big communal table, and seats at the bar. It's airy and light and playing a fantastic 70s soul/funk playlist. We had been speaking enough broken Catalan that they didn't realize we were American -- until he caught us using google translate for the menu. Then he promptly brought us an English menu.I was in desperate need of caffeine so I ordered a cortado; reeeeally good espresso y'all. Boyfriend ordered a German beer that he really enjoyed.Boyfriend ordered nachos (what?) and they were surprisingly great. Then we split the quinoa salad and goat cheese sandwich. The sandwich was awesome (I have no idea what kind of bread it was on but it was so crusty and delicious) but THIS SALAD. YOU HAVE TO TRY THIS SALAD. It was one of the best salads I've ever had. Lambs leaf lettuce, chopped fresh herbs (mint, basil, cilantro), oranges, golden raisins, chunks of feta, and quinoa, all with a citrusy vinaigrette. After the first bite I relegated the sandwich to my boyfriend so I could hog the salad, tirelessly singing its praises with every bite. It also came with bread but I didn't eat it because that would be a moment that I wasn't eating this salad. And the bill was a measly 23 euro for all that food. BONUS: my American credit card worked just fine. The juice menu looked amazing (and nearly everyone inside was drinking a juice. I fucked up. But we had just drank A+ fresh juices at the mercat de la concepcion down the street.) and I'll be back for that carrot cake probably tomorrow lets be real. I saw a bunch of other people eating the quinoa salad, and the caesar salad.TL;DR -- everyone is nice, english-friendly, ORDER THE QUINOA SALAD, takes american credit cards", 
    "5.0", 
    "Mina F.", 
    "Nashville, TN", 
    "0", 
    "5", 
    "granja-petitbo-barcelona", 
    23, 
    [
        "Breakfast & Brunch", 
        "Cafeteria"
    ], 
    1
]