[
    "One of the best restaurants I tried in Barcelona. It was started by a former El Bulli chef about a decade ago and this guy clearly knows his stuff. Hard to describe the style and decor, I would call it a casual white tablecloth establishment. I came for lunch which was an outstanding deal. About $20 for a 3 course tasting menu. The wait staff also let me swap out an appetizer and dessert without an extra fee, although I would have gladly paid one. The dinner tasting menu also looked amazing, but the lunch deal was too good to pass up. The full menu is also available for lunch as well. On my visit there were people dressed to the 9's and people dressed very casually, so don't sweat a dress code although it does feel like a place you would wear a sport coat too.The food seemed like a mix of French and Spanish with a molecular gastronomic twist and the wine list is outstanding. Here is what I tried:Gnocchi with prosciutto gnocchi - outstanding! A highlight of the meal. Everything was cooked perfectly with amazing presentation.Egg soufflé - with potatoes in the form and texture of pasta topped with a gravity defying egg soufflé. Just for the presentation this is a must get item. Tasted great too.Pork Belly - I was worried that it would be overly fatty but it wasn't. The top and bottom had the perfect amount of crunch. While the middle was juicy and tender with the perfect blend of meat and fatCod - The cod had a very slight fruit flavor to it that worked perfectly. Another perfectly executed dish.Tiramisu - Classic preparation of tiramisu that was executed perfectly. It was delicious.Chocolate & Olive Oil - This was a mix of a chocolate mousse and olive oil ice cream topped with an olive oil candy. Mixed in are hints of candied pistachios and ginger. One of the best desserts I have had in recent memory with a dynamic flavor profile", 
    "5.0", 
    "Michael C.", 
    "Boston, MA", 
    "817", 
    "1294", 
    "gresca-barcelona", 
    2, 
    [
        "Modern European", 
        "Catalan", 
        "Signature Cuisine"
    ], 
    3
]