[
    "First, as an American with high expectations of customer service, this place had the kindest wait staff we experienced on our 2 week trip to Spain.The decor is white table cloth, proper place settings.  If you wanted to dress up, ehis would be the place to do it.  If you don't, we saw a locals in very casual clothing here and no one seemed to care.Many have already mentioned this restaurant was featured on Anthony Bourdain - well deserved.Many have also written about the wondrous egg souffle - I couldn't agree more.  Not only is it beautiful and delicious, I think it defies physics.My husband and I had the 5 course tasting menu.  The waitress asked if there was anything we do not like.  I said that I do not like strong seafood.  She said that she will substitute out the anchovies appetizer for a ham and artichoke salad, but leave in the cod with rice.  Tasting menu orders had to be the same for all people at the table.First, the Iberian ham and artichoke salad was perfection.  It was a delicios combination of flavors and delicate textures.Second, the egg souffle was divine.  My meal could have been done at this point and I would have been perfectly satisfied.Third was the cod.  I could tell that it was prepared exceptionally.  very moist, but not greasy.  The rice had green peas which added a delightful texture.  My husband liked this dish a lot, but it turns out that cod is not a fish I like.Fourth, was the most adventurous dishes for me: pigeon.  It looked beautiful and I bravely took a giant bite.  I was also feeling a bit vengeful because a pigeon had just bombed my head earlier that day at Park Guell.It was good at first, but then a horrid aftertaste set in.  I don't think it was in my head.  It was gaminess laced with regret.  If you don't think you'd like pigeon, don't do it.  I am however confident that it was the best preparation possible and if I don't like it here, I will not like it anywhere.Last, but not least was dessert.  Always the way to my heart.  It wasn't able to compare to the egg souffle, but it was still delicious.  Warm, chocolate fluffy goodness with cream and some sort of toasted grain that added a wonderful nutty and crunchy accent to the chocolate.If I went back, I'd order the ham salad and egg souffle, maybe the dessert too, and go home happy.", 
    "5.0", 
    "Marianna G.", 
    "Plano, TX", 
    "53", 
    "97", 
    "gresca-barcelona", 
    5, 
    [
        "Modern European", 
        "Catalan", 
        "Signature Cuisine"
    ], 
    3
]