[
    "Probably our best dining experience during our week-long trip to Spain, which is saying a lot. We came here upon recommendation of the guy who put together our tour of La Rioja wine country. He was born in and grew up in that region and now runs a travel agency, so we were happy he was able to recommend some things around Barcelona that other resources didn't mention.Gresca was described to us as \"upscale Catalan fusion\", and that seemed to be a pretty apt description, and it was our best restaurant experience, in spite of having also dined at the Michelin-rated restaurant inside the Marques de Riscal Winery hotel (building designed by Frank Gehry). The service was attentive and helpful, and I loved the fact that the restaurant was a smaller-scale place with only room enough for maybe 40 people, with only two waitstaff total on the night we visited. It resulted in a night that was intimate and focused on the wonderful food.We ended up trying the tasting menu, which was nice because we got a wide range of types of food in a cuisine that neither of us were familiar with beforehand. Unfortunately, that made it harder to remember exactly what we got, since there were several courses.The most impressive dish we had was the Egg Souffle, which was unlike any souffle I've ever seen. I included pictures of before and after so that you can see the mind-bending way in which the unbroken yolk was suspended within the fluffy, air-like white. It sat on top of a bed of \"noodles\" that were really thinly-shaved slices of potatoes that had been cooked just long enough to give them the texture of 'al dente' pasta noodles. I also really loved the anchovies, which were seared and covered in a super-thin layer of herbed butter and accompanied by a sort of almond brittle/bark.I would highly recommend a visit to Gresca for anyone who travels to Barcelona--it's a great way to sample the Catalan approach with a more upscale approach. It's a nice break from the more rustic local cuisine that you can find in any number of little cafes and tapas bars.", 
    "5.0", 
    "Sam C.", 
    "Ypsilanti, MI", 
    "44", 
    "44", 
    "gresca-barcelona", 
    17, 
    [
        "Modern European", 
        "Catalan", 
        "Signature Cuisine"
    ], 
    3
]