[
    "This was a must on our list after reading the NYT bistronomics article: At Barcelona's 'Bistronomic' Restaurants, Creative Plates at a Good Price.  Indeed it was, a truly exquisite meal at a fraction of the cost of what you would normally pay elsewhere.At an affordable 19 euros (as of May 2011), you get a three course delectable, creative meal along with a well paired glass of wine (or drink) at a fine dining restaurant. Keep in mind, the menu del dia is in Catalan, but the hostess or waiter/ress can help you with translations. We were lucky to get a table with no reservations, since I heard it can get busy. Our table was situated in the back, closeby the kitchen.We saw the chef peek a couple of times, and we had the pleasure to speak with Chef Rafa Peña, known as a leader in bistronomics in Barcelona. The geek in me wanted to take a photo with Chef Pena, but my shyness took over and I therefore lost the opportunity when we were conversing with him.When we were seated at our table, we were greeted with complimentary cheese triangles. We knew right away we would go with the menu del dia. It's a bummer that there was no English translation (although they will verbally translate it to you), but we were still pleased with our selections.My selection:- First course: Mozzarella salad with tomato and hazelnut: Simple but full of flavor, all of the ingredients in this salad complemented each other so well.- Second course: Grilled tuna tartare with pepper onion sauce, topped with tiny white flowers. Excellent, and oh yes so beautiful.- Third course: Chocolate cake - nice, smooth texture and a nice way to end the meal.My hubby's selection:- First course: Pate- Second course: Beef cheek with potato - good, although not to my palate.- Third course: Cheesecake - light and fluffy, not too sweet or heavy. Just the way cheesecake ought to be!Where are you, bistronomic restaurants in New York City? If someone can tell me, you will truly make my day!", 
    "5.0", 
    "Caroline C.", 
    "Dublin, Republic of Ireland", 
    "384", 
    "303", 
    "gresca-barcelona", 
    15, 
    [
        "Modern European", 
        "Catalan", 
        "Signature Cuisine"
    ], 
    3
]