[
    "We stopped by for a quick bite to eat after walking down Las Ramblas.  Irati is tucked away in a little corner but definitely a hidden worth a stop on any trip to Barcelona.  We stopped by to get a quick snack on a weekday afternoon for the Tapas Bar.  The restaurant served mostly Basque inspired tapas. Please forgive me if I mix up the terminology - but I think most of the items served are pinchos - bite sized morsels of food on some sort of skewer.  Most of the ones there had a bread/toast like base with a myriad of different toppings. I assure you that you'll definitely be able to find something to please even the pickiest of eaters.Coming in, we were a little overwhelmed trying to figure out how their system works, but the servers were very sweet and helped explain everything. You basically pick up a plate from one of the servers and just help yourself to all the pinchos you want - just hang on to the toothpicks the pinchos come with.  The cold ones are laid out on the counter, while the hot ones are brought out as they are prepared. At the end of the meal, they count the number of pinchos you had and charge you accordingly.  Each piece comes on a toothpick that is color-coded for the price of pincho.  Most were roughly 2 euros. Just a heads up, you eat the entire meal standing.  There are counters where you can rest your plates but they don't have any chairs.Honestly, it's really difficult to talk about the specifics of what we ate because the food isn't clearly labeled and you're grabbing whatever looked good.  All I do remember is that everybody loved the pinchos they picked up and a blue-crab one was my favorite. Other than that, I am sorry I can't give you more details.The only cons about this place:* crowded: the area is a small for the number of people who are served, so prepare to get to know your neighbors well.* food not clearly labeled - it is a little difficult to know what you are eating", 
    "4.0", 
    "Richa T.", 
    "Dallas, TX", 
    "172", 
    "450", 
    "irati-taverna-basca-barcelona-2", 
    36, 
    [
        "Tapas Bars", 
        "Basque", 
        "Tapas/Small Plates"
    ], 
    2
]