[
    "Irati is an intimate Tapas restaurant that's right off of Las Rambas where you can get a quick bite and a cool ambiance without all the negatives usually found in an area dominated by tourists.We found out about the place after asking the concierge at our hotel for a nearby dinner recommendation. I had just flown into Barcelona that day to kick-off a 30-day trip in Europe, so needless to say I was excited to start the trip with some good food. Well it's a funny thing we ended up here, because we were really looking for a good \"sit-down\" restaurant, and well...as the other reviews have stated...this is one of the few restaurants in the area where you actually CAN'T sit down - it's a 100% stand up tapas-style restaurant commonly found in Spain. Clearly I'm new here.After we spent a few long minutes overcoming the language barrier (servers are great but speak minimal English), we decided to give it a try. What we learned is that it's a unique system that goes like this: 1) Go up to the bar and ask for a plate. 2) Help yourself to the self-serve tapas on top of the bar counter3) Eat as much as you want, just be careful to leave your used toothpicks on your plate3) Ask the server behind the bar for wine, beer, or water (most people seemed to be drinking wine, FWIW)4) When you're ready to leave, hand them back your plate, and they'll count the number of sticks remaining on your plate and charge you around 2 euros per stick. (Note: 100% honor system)As for the tapas themselves...they're far from life-changing. A lot of them are cold, and many of the plates are duplicates of each other, so you don't actually have as many distinct choices at it may seem. Some of them are really good though, but just require you to be a little adventurous, as there's not much indication about ingredients (unless you ask).Also, for anyone trying to fill up before spending a long-night out in Barcelona (I most certainly was), this won't do the trick. Tapas are what they are - they're tiny, and you'd need about 6/7 of these bad boys to even feel remotely full. If you're looking for a snack or a quick bite, I can definitely understand stopping in, but this is not a place where you're going to get any type of solid dinner. When I made a second trip to Barcelona a few weeks later on the trip, I didn't come through here again, which tells you almost all you need to know. It's definitely a solid place if you're in the area and want something quick. But if you're not, don't waste your time coming over here.", 
    "3.0", 
    "Brian S.", 
    "San Francisco, CA", 
    "453", 
    "147", 
    "irati-taverna-basca-barcelona-2", 
    19, 
    [
        "Tapas Bars", 
        "Basque", 
        "Tapas/Small Plates"
    ], 
    2
]