[
    "This is my first time in Barcelona, but I did my research carefully with the help of my fellow Yelpers.   Every restaurant has been a hit, setting the bar very high in advance of my Sunday lunch at Kaiku.   Sadly, it was a disappointment.  Service was far from great.  But that was not an issue for me.  I speak Spanish and struggled to understand the menu offered in both Spanish and English.  The English menu was a very poor translation and the waitresses were too rushed to adequately help.   In addition, the  menu was not as special as others had described..  The fried anemones were not on the menu.  The croquettes with foie mouse were well done but nothing new as we have great croquettes elsewhere.  The mussels were described as steamed without any description as to what type of liquid they were steamed in.  They sounded so boring we did not order them.  Someone at a neighboring table ordered the mussels and I never saw anyone dip bread into the sauce. That told me there was not much there in terms of flavor.  We started with an order of razor clams.  They appeared to be a a smaller variety than what we have been eating prior.  Unlike the others they had their parts, feet and siphon muscles protruding from the ends and a dark sack perhaps the stomach was visible in the middle.  I wondered if this was a function of their being cooked or a sign they were not fresh.  Visually they were not like those we had been eating for three days prior. Those were creamy white with rounded ends.  Being recently introduced to razor clams I found this order of clams visually disturbing. In any event, I attempted to eat several but was disappointed.  They tasted slightly fishy unlike those I'd previously eaten at Ciudad Condal, and Tickets.   Neither I or my husband cared for their flavor and could not finish the order. Bottom line, they tasted as bad as they looked. Also, they were the most expensive order of razor clams we've eaten in Barcelona.  While waiting for our main course to arrive We noticed olives being delivered to a nearby table.  Had we seen them on the menu we would have ordered them first.  They were actually delicious, seasoned with paprika. On to the main course.The rice dishes as described on the menu were not particularly exciting.  That was disappointing as that was my reason for reserving at Kaiku two months in advance.  We ordered the chef 's special rice dish.  It is a dish with vegetables, mussels, two pieces of squid, and four small shrimp.  The first problem was the size of the shrimp.  They were very small compared to those in chef specials delivered to other tables.  My boys joked they were not big enough to use as bait. Although they were very sweet and delicious I felt as if we were being taken advantage of because we were obviously tourists.  The rice itself had little to no flavor.  It was described as being prepared with fish stock. Well, the chef failed to season the stock.  The seasoning of a dish is just as important as the freshness of the ingredients.   I felt as if the chef at Kaiku depended on flavor of the seafood to speak for itself without any help from him..   The dish was very bland, bordering on flavorless.  I was underwhelmed to say the least.   I never pick up a salt shaker in a restaurant but was forced to do so in order continue eating.  Bottom line, Kaiku,was a disappointment all around.", 
    "2.0", 
    "Yolanda L.", 
    "Fort Lauderdale, FL", 
    "5", 
    "54", 
    "kaiku-barcelona", 
    12, 
    [
        "Basque", 
        "Mediterranean", 
        "Spanish"
    ], 
    3
]