[
    "I had the best meal of my entire trip to Barcelona at Kisoko Universal.  It was incredible!  I wandered around and ended up choosing it for a late breakfast/early lunch after seeing open stools and, oddly enough, remembering it from a Rick Steves guidebook.  I was pulled in instantly by the gigantic plate of mushrooms on the counter in front of me.  I am a mushroom fanatic, so once I saw those, I easily knew that I would be ordering the mixed mushroom plate.The staff is friendly and, despite how busy it can get there, it is easy to get their attention and quickly order.  I put in my order for the mixed mushrooms and a cappuccino and patiently waited!  Thankfully, the food came out extremely quickly.  I took my first bite and, sweet jesus...it was amazing.  The flavors were incredible.  I don't know what combination of oils and herbs they used (heck, I don't even know the names of all the mushrooms in the mix!), but whatever it was equaled magic.  My instant reaction was to start shoveling in bite after bite, but I held restraint and decided to instead savor each bite - a much smarter idea!  The mushrooms came with a side of bread, which was great as I was able to sop up the extra oil and herbs that were left behind on the plate.  The cappuccino was the perfect topper to the meal.  For only about 12€, I had the meal of my entire trip.  I left very satisfied and happy.I even returned on another occasion to have the mushrooms again.  This time I dragged my boyfriend along and we ordered some shrimp as well and split everything.  The mushrooms weren't quite as mind-blowing (there's nothing like the first time, I guess haha!), but they were amazing nonetheless.  I heart this place.  You must go here while in Barcelona!", 
    "5.0", 
    "Sonya L.", 
    "Kent, WA", 
    "694", 
    "1210", 
    "kiosko-universal-barcelona", 
    15, 
    [
        "Spanish"
    ], 
    2
]