[
    "Koy Shunka? Should be named Soy Nunca! Attention foodies and travelers looking for a high-end meal...Please read!!!!!!Having been to places with extremely high end Japanese menus (or just high-end in general) in this same price range from NYC to Melbourne, this fails on many levels. After having had Spanish tapas for 80% of our meals we opted for a \"high end\" Japanese restaurant which had an omakase menu. Granted...I did read the negative posts from other Yelpers...and naively disregarded them. \"Oh they must just be ignorant\" I thought. Well...look who was completely wrong and ignorant...me! We had such a good run from Yelp on our week long trip here. (Definitely go to La Flauta near the University.) First of all there are two different omakase menus (plus everything a la carte), which they won't let you order both at one table. If you are two or more and decide to do the omakase, you have to order the same menu for the table. My wife doesn't eat as much so she wanted the smaller menu (Koy) and I of course the larger (Gastronomic)...we settled on the \"Gastronomic\". They do \"comp\" your bill for those items you don't eat according to the waiter...(not really)...check your bill prior to payment. We were only partially comped (I cancelled the last two plates and was charged full rate of €118). My wife cancelled the last four plates and was comped €20. I really don't want to elaborate on the details of each dish because I've already wasted +2 hours and +€200, not including wine which was €45. Based on our experience, \"Soy Nunca\" is trying to be something it is not...and that's a high-end restaurant. While they execute certain items well with technique (foams, sashimi, etc), the overall taste is not there, when the price is. Case in point are the dishes towards the end of the meal...which were a lobster tempura something, and a Wagyu beef dish. Both are completely ruined with the preparation...the lobster is tempura fried and the Wagyu is \"cooked\" in a miso broth. I don't know how you mess up Lobster AND Wagyu, but \"Soy Nunca\" managed to do both along with most of its dishes we were served. I honestly was angry when leaving there...something I do not plan on when going to dinner. It's a waste of time and money. I would've rather gone to McDonald's...at least you know what your money is buying you!On the positive side, it's very clean, sashimi dish was good, staff is very attentive, good wine list, and bathrooms are impeccable. So if that's worth €100+ per person then by all means check it out. Can't speak on desserts because we cut our losses early due to the quality of the food. I hope this helps fellow Yelpers. Goodbye Barcelona...wish our last night was better. Will miss you. Please don't waste your money here...go spend it on some over priced, crappy paella on La Rambla...you'll feel better...trust me...and whatever you have leftover from that dinner; go buy a \"Flamenco Dancer Magnet\" for your refrigerator, or a €6 fan for your mother-in-law...either way you will feel more complete inside.", 
    "1.0", 
    "Mark O.", 
    "West Palm Beach, FL", 
    "24", 
    "51", 
    "koy-shunka-barcelona", 
    4, 
    [
        "Japanese"
    ], 
    4
]