[
    "La Concha, like most restaurants in Barcelona, offer a menu del dia, which is a 2-3 course menu at a fixed price. These menus are often offered during lunch time until 4pm, and then some restaurants will choose to have a dinner menu as well. Since menu of the days are usually the best deal, we went for it, and it was only 12 euros for a first course, main entree, dessert, bread, and drink. There are a variety of items to choose for each course, and for my first course, I chose the Fideua. You need to learn that in Barcelona, their so called first course or appetizer is an enormous portion and could fill me up as almost an entree. The fideua was literally three large scoops on a huge plate. I was getting worried how full I would be by the end of this meal...Anyways, fideua is basically the noodle version of paella. Fideau means noodles in Catalan and is often seen on menus in Catalan or Valencian restaurants. The noodles are special noodles, which are very thin like angel hair. They are broken into tiny pieces and are served with shrimp or other seafood. There's a sauce to it, but it is quite dry compared to paella rice. They also give you a side of mayonnaise, which you are supposed to mix into the fideua. However, I prefer my fideua without the sauce as it gets too saucey and salty. For my entree, I chose the Lacon a la Gallega, which is Galician Ham in English. This is a ham that originates from Galicia, which is in northwest Spain. It is a dried ham, and instead of using the whole leg, they only use the pork's shoulder. The ham was paired with sauerkraut and lentils, and topped with a spice similar to paprika. Quite tasty but very meaty and filling. Lastly, for dessert I had the flan which is similar to a caramel pudding. Even though it didn't look too appetizing, it was quite delicious. I love how the top is slightly glazed and the whipped cream makes it even better.All in all, La Concha was quite good for the price you pay. The people do not speak a lot of English, but they do their best to try and explain their menu which is all in Catalan. Overall, worth a try if you are in the Gothic Quarter.", 
    "3.0", 
    "Sophia H.", 
    "Richmond, Canada", 
    "15", 
    "72", 
    "la-concha-barcelona-2", 
    3, 
    [
        "Spanish", 
        "Galician", 
        "Mediterranean"
    ], 
    2
]