[
    "I relish diving deep into El Born and into the gothic areas of Barcelona. Although I live many thousands of miles away, it's one of my favorite cities in the world, in part for its amazing food, its hundreds of quaint and romantic grotto-like eating establishments, and its vibrant street life and street art. But I have to admit, the tapas, as delicious and varied as it can be, can get redundant and repetitive day after day. So this is why I was so pleasantly surprised when stepping into La Cua Curta on a recent visit to Barça. The ambiance and decor is wonderfully romantic and unique -- sophisticated and quaintly understated at the same time. The menu is loaded with interesting options and combinations. And the service -- provided by none other than the proprietor / menu designer -- is top notch. But most importantly, the dishes we ordered were out of this world. We had two of the fish carpaccios (tuna and cod) and a wild rice dish. The presentation was incredible, and the quality, freshness, and flavor combinations were world class. The tuna carpaccio at this place tops my list of amazing foods I'll remember and crave for years to come. So that was all well and good, and as we decided to wrap up and head out for some gelato, a small twinkle in the proprietor's eye told us to have a look at the dessert menu. The only bad thing I'll say about this place is that he didn't just force us to order the chocolate fudge cake. But by happenstance we did, and I have to say it was one of those mind-blowing experiences that come all too infrequently when eating dessert at a random restaurant. I have no idea what the cake part was made of -- nut flour of some sort perhaps. I'm pretty sure the chocolate sauce was among the best I've had, and I've tried many dozens of chocolates worldwide. So, if you find yourself looking for an incredibly surprising, delightful, refreshing, and delicious experience in the heart of Barcelona, you must check out this gem. You will not be disappointed.", 
    "5.0", 
    "J S.", 
    "Orinda, CA", 
    "35", 
    "34", 
    "la-cua-curta-barcelona", 
    1, 
    [
        "Catalan", 
        "Signature Cuisine", 
        "Mediterranean"
    ], 
    3
]