[
    "A marvellous little establishment that we never would've tried were it not for the other wonderful Yelp reviews.Found in a square but with no signage of any kind this would have been easy to miss were it not for the queue of people out of the door waiting to be seated. Most of them were locals which immediately makes you think two things: 1) the food must be good and 2) it's probably affordable to be a casual lunch venue. Both turned out to be correct as Cova Fumida is exceptional value for money for the amazing quality of food served there. Hint for anyone going: you have to get your name on the waiting list by speaking to the dark haired chap with glasses. We did stand around for a while before we realised that to be the case so were sadly queue jumped by others in the know. Once I side you will find a delightful bustling little place, packed to the walls with people and a family unit running a slick operation from bar to waitressing and cooking. We were seated and ordered a half carafe of Rioja and a Spanish beer. We didn't know what to order and English was limited so we said to just bring five tapas. First dish was a lovely slice of garlic bread each with a rich creamy garlic sauce on top. Next came their house special bomba which was really yummy, lovely fluffy potato with a cream and spicy tomato sauce topping. Whilst eating that they brought out two grilled artichoke hearts each. These were whole but mixed with a rich tomato coating and were insanely tasty and perfectly soft to eat. The outer leaves were hard from grilling so I'd suggest leaving those as it was like chewing cud but they were simply the shell holding the gooey tasty innards. Next came the highlight of the meal: a complete fried squid that was just so tasty I can't describe it. I believe it was cooked in some kind of garlic butter but whatever it was it was simply exquisite: if you can put up with a whole squid including tentacles lying there on your plate you'd be insane not to order this amazing dish. It was served with a piece of white fish coated in a spicy tomato sauce again. This in itself was good but was merely a sideshow for the squid. Did I say I liked the squid?We thought we were done (this was a filling selection) but then we had a final surprise, a couple of baby squids, also whole, cooked in a butter sauce. These were good though couldn't compare to the main squid. It was a strange final dish following a big squid but were still good and in no way distracted from what was a truly authentic and wonderful tapas bar in a city loaded with cheap, rushed tapas. Amazing.", 
    "5.0", 
    "Carl T.", 
    "Birmingham, United Kingdom", 
    "8", 
    "6", 
    "la-cova-fumada-barcelona", 
    1, 
    [
        "Tapas/Small Plates"
    ], 
    1
]