[
    "I was debating between four and five stars, and then realized I was being an ass.Came here on a Friday afternoon at about 2PM with a friend and her lovely 7 year old daughter.  This spot had come highly recommended from friends, and in my Google searches of what to eat in Barcelona La Cova Fumada kept on popping up.  Lofty expectations are usually deadly.Upon walking up to this unsigned establishment, you'll see throngs of people waiting outside as well as a packed interior. It's a cozy place with a bar and maybe eight tables.  To get one, put your name on the waiting list by speaking to the wonderful and patient owner  (???) --- he's the tallish guy with glasses with a wonderful sense of humor and a great command of English.  I also noticed folks just standing and eating at the bar where you do not have to wait.While waiting about 30 minutes for the table, I watched two women (probably 70 and 40 --- could be related?) bustling about the small kitchen. It was pretty fun watching them work --- adding aioli to bread, sautéing up some sardines, and piling up bombas up in a pyramid.  Food looked excellent, and I eagerly anticipated amazingness (again, likely setting myself up for disappointment).Upon sitting down we got a few beers and a couple of small bottles of water.  I asked the waitress to bring us whatever she felt like.  She smiled, and she did.We were immediately served their bread (pan) with both tomato and aioli.  The bread was perfectly crusty yet chewy, and both sauces were excellent. I'm pretty sure the secret ingredient of the aïoli might be crack.We also got a plate of muscles, octopus, sardines, bombas, and calamari.  I pretty hefty portion for two adults and a child ... but it was perfect.  All of the seafood was fresh and tasty.  The bombas were my favorite --- crispy fried exterior with a wonderful garlicky spicy interior.  And when it came time to pay it cost €45 in total, a steal.I usually fear local places that have been discovered, like this, as quality tends to go down once the tourist wave continues to hit the restaurant hard.  Perhaps it may have, I have no way of telling.  But what I can say is that it's a great sign to see a large local contingent eat here, that the food is excellent, and it's a bargain.And if a gray-haired Catalonian woman is preparing any of the food, there's no doubt that it's going to be damn tasty.", 
    "5.0", 
    "Farooq K.", 
    "Denver, CO", 
    "65", 
    "128", 
    "la-cova-fumada-barcelona", 
    4, 
    [
        "Tapas/Small Plates"
    ], 
    1
]