[
    "Thank you Rick Steve's for recommending La Cova Fumada!!!We risked being possible victims of pick pocketing finding this place, but it was so well worth the adventure. I brought my boyfriend to Barcelona as a surprise gift for his 30th birthday. I researched every square inch of Barcelona before our visit to ensure it would be a memorable one for years to come, and by G-d did this place make it just that!After a full day of climbing Montserrat, we showered, changed, and headed to La Cova Fumada for some much needed chow down. Upon entering we were cheerfully greeted by the owner. He picked up on our indecisiveness and immediately began to order for us. I kept my cool on the outside, but was covertly worried about the bill to come. The Carafe of white Catalonian wine quickly distracted me from the check (we're on vacation right)?! That's when a fisherman straight off a shipping vessel came in wearing rubber boots, overalls, carrying a net of 10 lbs. worth of freshly caught Mediterranean Sea Clams. He handed the net over to the same man who greeted us and took our order in exchange for some Euros. That's when we knew, this place just got real! Everything from the baked artichoke, homemade aioli on toasted loaves of bread, small lemony sweet clams, whole octopus legs, calamari, Spanish crochets, and dry white wine, was out of this world delicious! Not to mention, my bill came out to only 28€!We were the only Americans in this small cramped space and yet felt right at home. Though La Cova Fumada is not the fanciest of restaurants we experienced during our time in Barcelona, it sure was the most flavorful and authentic. La Cova Fumada is an absolute must do when in Barcelona!Tip, For those new to the city of Barcelona: Barceloneta and El Raval, though commercial, are known for their pick pocketing. I recommend tourists keep a low profile and stay on main streets. It's not particularly a violent place, but you should keep yours eye open.", 
    "5.0", 
    "Emmanuel L.", 
    "Miami Beach, FL", 
    "1", 
    "6", 
    "la-cova-fumada-barcelona", 
    29, 
    [
        "Tapas/Small Plates"
    ], 
    1
]