[
    "How was I not aware of this fabulous restaurant until today?! The staff is friendly and bilingual, the food is creative and delicious, the atmosphere is relaxing with the dim light, and everything is cooked in the traditional kitchen but assembled in the opened kitchen! I had the lunch menu (€15) with carrot soup, oxtail with potato and couscous. All three dishes are assembled in one big plate. The carrot soup is creamy with a hint of orange flavor; the oxtail is flavorful with potatoes gnocchi; the couscous with nuts is refreshing. For dessert, I had a cafe con leche and honey lavender tart. I was amazed by the texture of the tart but the honey becomes too sweet after the third bite. This is my first time drinking coffee so can't give much opinions but it went in pretty well for me LOL. However, it is known for its coffee so definitely give it a try!---------------------------------------------------------------------------------------------------------------------¿Cómo es que no sabía nada de este fabuloso restaurante hasta hoy? El personal es amable y bilingüe, la comida es creativa y deliciosa, la luz tenue crea una atmósfera relajante, ¡y todo está elaborado en la cocina tradicional pero emplatado en la cocina abierta! Tomé el menú del día con sopa de zanahoria, rabo de buey con patatas y cuscús. Sirvieron todo junto en un mismo plato. La sopa de zanahoria era cremosa, con un ligero gusto a naranja; el rabo del buey estaba muy sabroso acompañado de gnocchi de patatas; el cuscús con frutos secos era refrescante. De postre tomé café con leche y tarta de miel y lavanda. Me encantó la textura de la tarta, pero la miel resultó demasiado dulce después del tercer bocado. Es la primera vez que bebo café, así que no puedo daros una opinión fundada, pero se dejó tragar bastante bien. Sin embargo, este lugar es conocido por su café así que, sin duda, ¡probadlo!", 
    "5.0", 
    "Jennifer F.", 
    "Barcelona, Spain", 
    "71", 
    "31", 
    "la-esquina-barcelona-2", 
    1, 
    [
        "Cafeteria"
    ], 
    2
]