[
    "S kindly took me and my friends out and we ended up at La Fonda. We luckily did not have to wait long until we got a table. Usually, La Fonda has ridiculous line ups, because it is actually a well known restaurant for tourists. Inside, the restaurant looks extremely fancy, and at first, I was worried S had taken us to some sort of fine dining. However, after we looked at the menu, we realized the prices were very reasonable and actually much cheaper than many other restaurants. We first started with a pitcher of Sangria. This is a must order in Spain, since it is basically the Spanish cocktail. The sangria at La Fonda is actually pretty good, compared to some other ones I have tried. It has a good amount of red wine and enough fruits to make it slightly sweet. We started off with a mixed plate of appetizers. It started with grilled cuttlefish, which was one of my favourite. The seasoning was just so good and the cuttlefish was grilled perfectly. To the right was a ham and cheese quiche, which was decent. Not the best I've had. Next, was a baguette with brushed tomatoes and a slice of a type of sausage. The sausage was similar to chorizo and was rather hard. Typical sausages the Spanish eat though. Next, was the calamaris fried in a Romanian style. I didn't like these calamaris. The oil seemed rather old and the batter was not fluffy or crunchy. Next, were the croquettes, which were filled with ham and cheese. These were also one of my favourites. Last, was the grilled red peppers, which are also a common appetizer for the Spanish. The whole platter was under 8 euros, which is great if you want to try a bit of everything. Quite difficult to share between four people, but perfect for two. We ended up trying the Paella served Valencian style at La Fonda. It was basically served with chicken drumsticks and lots of veggies amidst a flavourful sauce. You have to order a minimum of two servings, but this is perfect to share if you just want to try some paella and leave room for other dishes. The paella here is extremely well done for the price, as most restaurants charge ridiculous prices. Here, the each order is around 8 euros, so it costs around 16 euros for the minimum two orders. Not bad at all, since lots of places charge at least 16 euros for one order. Lastly, we shared a main meat entree, which was under 12 euros. This was also one of the most expensive entree for the meat section, with most entrees costing around 8 or 9 euros. We chose the Grilled Lamb with Rosemary Potatoes and this was really good! The meat was so tender and just flaked off the bone. The sauce was flavourful, with the rosemary aroma.In the end, we were completely full with just ordering the three dishes between the four of us. If you want some taste of Spanish food and a reasonable price, La Fonda is the place to go. You will see tons of tourists here, and the best thing is that the waiters can speak perfect English. They are just so used to dealing with tourists, that it is a tourist friendly restaurant. But it's not one of those that rip you off with unauthentic and poor quality food. Be ready to wait unless you start lining up at 7pm for the first seating. They also have great lunch menus at a reasonable fixed price. It is tucked away near Placa Reial and accessible after a long day walking around La Rambla.", 
    "5.0", 
    "Sophia H.", 
    "Richmond, Canada", 
    "15", 
    "72", 
    "la-fonda-barcelona", 
    32, 
    [
        "Mediterranean"
    ], 
    2
]