[
    "After a period of eating all the Spanish food, a fella could really go for a burger. So, I typed some information into my handy-dandy Yelp app and I was soon at La Informal and ready to sit down to a decidedly-American burger, fries and beer. When I happened upon La Informal, I was surprised to find it empty. It's in a good location in a trendy neighborhood. I have to imagine that Monday nights aren't the busiest for them. All the better for me. I liked having the place to myself.The process is fairly easy: walk up to the counter, peruse to the menu, ask for suggestions, order, pay, get a number, take a number, sit down, and wait for delicious food to be brought to you. The woman who waited on me spoke excellent English but I chose to speak in Spanish. Why should she cater to me? I'm in her country. I shouldn't have been so in my head. I don't know whether it was for my benefit or how they roll at La Informal but during my stay, I listened to Beyonce, Usher, Bruno Mars, and other English-singing hitmakers. I loved the playlist. It definitely put me in the mood for my meal.My beer was ready first. Again, since I was in Barcelona, I had to have an Estrella. When paired with a burger and fries, the beer was a great match. I tried to sip it slow so as to enjoy the bulk of my beverage with my meal. I didn't need to worry too much about it because my food was made (to order) quickly. I can get used to this. I ordered the Blue Burger without mayonnaise (it's everywhere... like cockroaches). As you might imagine, the star of the Blue Burger is bleu cheese. As you might not imagine, it's gigantic. I was duly impressed by the size of my burger. This was not a flat, sad patty. This was a sandwich to be respected. Also respectable, my CONE of fries. Yep, cone. I think I prefer my fries served/delivered in a conical receptacle. They were well-seasoned, medium-cut and extremely plentiful. My plate ranneth over with fries. Between the service, music and food, La Informal was one of my more enjoyable meals in Barcelona. Does that mean I'm an ugly American or does that mean that they serve really delicious food you should make sure you eat while in the City of Counts? I'm going with option B.", 
    "4.0", 
    "Johnny T.", 
    "Nashville, TN", 
    "4798", 
    "1790", 
    "la-informal-barcelona", 
    1, 
    [
        "Burgers"
    ], 
    2
]