[
    "Really good seafood. Enjoyed it a lot. Be prepared to spend at least 15 euro per person and for a long line. We ran over after our tour ended at 1:30 and showed up to a line that took us 50 minutes to get through just to place the order -- and we only had like 6 groups of people in front of us. If we had showed up any later, our wait in line to order would have been more like an hour and a half, for sure. We waited another ~15 minutes to get our food (which came out in phases, not all at once) and were out by 3 PM. Hours for lunch: 1 PM - 4 PM. No line by 3 PM.We ordered:-Gambas, grilled (about 11 euros for 8 medium to large shrimp -- really tasty, but could have been incredible if had been grilled with salt, garlic, and butter)-Baby calamari, fried (we asked for a small handful and got way more, like a whole giant plate of it -- good, but fried calamari lacks the flavor of, say, fried clams)-Razor clams (can only buy them in packets of 6 for 5 euro -- this was a highlight)-Mussels, half steamed, half with \"marinara\" sauce (not sure if you can get a half bag, but my impression was you have to get the whole bag, which is a lot of mussels. It was like 7 euro for almost 2 lbs. Fresh and yummy. I preferred them steamed rather than with the tomato sauce, though the tomato sauce made for good dipping with the bread)-Baby octopus, grilled (I did not enjoy these, but I think that's just because of the type of seafood than the restaurant's prep/freshness)-2 sauces (\"Cocktail\" sauce which is actually some gross version of Russian dressing and \"Garlic butter\" sauce which is whipped butter with a gentle garlic flavor -- it's not melted or hot. These are .80 euro each.)-2 pieces of bread (They charge .50 euro each)Our total cost was somewhere around 31 euro for all of this -- note that we did NOT order anything to drink -- which is a good price, but we would have preferred to get less and pay less. We wanted to try a bunch of things but their minimum quantities/scoops are quite large so we ended up with more than we wanted to eat (I was so full I didn't even eat dinner that night). Note that there is NO english on the menus.", 
    "4.0", 
    "No N.", 
    "New York, NY", 
    "3", 
    "65", 
    "la-paradeta-sagrada-familia-barcelona", 
    39, 
    [
        "Seafood"
    ], 
    2
]