[
    "I absolutely loved the food here!First off you have to know that this place is hidden. They have a sandwich board with the menu outside and a dude who chills by it and escorts you to the elevator that will take you up to the restaurant. We were lucky to stumble upon it.When you walk in you are greeted by the lady behind the desk and seated quickly. They have interesting artwork including a naked couple holding an apple...a bit strange but hey, you're in Spain.Now lets get to what really matters, THE FOOD!We ordered croquets which were a bit over priced, (8 croquets for a bit over 8 €) but still delicious. We also ordered a salad that I shared, and to be honest I forget what it was called but it came with goat cheese and walnuts, some fruit and what tasted like carmel. A very odd assortment but it worked! As my main course I ordered the \"hamburger\" with goat cheese. To my surprise it was a hamburger patty covered in melted goat cheese served over seared potatoes. It was AMAZING! I was actually really happy it didn't come with bread. The service was great and the food was over all reasonably priced. I must recommend this spot.And now...in Spanish========================================¡Me encantó la comida aquí!En primer lugar tienes que saber que este lugar está oculto. Tienen un tablero con el menú al exterior y un tipo que se queda por ella y que te acompaña hasta el ascensor que le llevará hasta el restaurante. Tuvimos la suerte de encontrarnos con él.Cuando entras estas recibidos por la señora detrás de una mesa y nos sentamos rápidamente. Tienen interesantes obras de arte incluyendo una pareja desnuda que sostienen una manzana ... un poco extraño pero bueno, estás en España.Ahora vamos a llegar a lo que realmente importa, la comida!Pedimos croquetas que eran un poco caro, (8 croquetas para un poco más de 8 €), pero sigue siendo deliciosa. También pedimos una ensalada que he compartido, y para ser sincero no recuerdo cómo se llamaba, pero vino con queso de cabra y nueces, algo de fruta y lo que sabía como el Carmelo. Un surtido muy extraño pero funciona!A medida que mi plato principal que ordenó fue la \"hamburguesa\" con queso de cabra. Para mi sorpresa, se trataba de una hamburguesa cubierto de queso de cabra fundido servido sobre papas chamuscados. ¡Fue increíble! Yo estaba realmente muy contento de que no vino con el pan.El servicio era estupendo y la comida era sobre todo un precio razonable. Tengo que recomendar este lugar.", 
    "5.0", 
    "Eli Y.", 
    "Santa Clara, CA", 
    "980", 
    "368", 
    "la-pomarada-barcelona", 
    4, 
    [
        "Spanish"
    ], 
    1
]