[
    "This place is a must try place if you are visiting Barcelona! They basically serve Spanish tapas but with a contemporary twist. It's a tiny restaurant but the ambiance is quite charming and quirky (all at the same time). We had a reservation for 9 pm but the place was so packed that we had to wait to be seated. The place was so crowded that we barely had any place to stand and wait to be seated. After 10-15 minutes of side stepping people going in and out of the restaurant, we found a place at the bar and ordered our drinks. We both ordered gin and tonics, there are several varieties so you can take your pick. I have to say - these were the best gin and tonics I have ever had (and I have had quite a few!). All the gins they have are unique both in color and taste and they pair them in several different ways. After 45 minutes of waiting, we were a bit frustrated with the service and spoke to the server who got us seated right away.  As a lot of people mention in the reviews, after eating tapas all day long - my taste buds were craving for a bit of variety and this place hit the spot perfectly. As we sat down, the waiter served us complimentary foie gras with white chocolate, being vegetarian I couldn't have these but my boyfriend described it as the best foie gras he has ever had and we weren't even in France yet! (We were traveling the following day to Nice). I ordered the hummus dish which comes in a tuna can and is topped with beets and herbs. So genius and delicious! I also ordered the potato bravas which comes with aioli and spicy sauce. They were crispy and greasy enough to hit the spot since I had been starving for the last hour. This place was a little light in vegetarian options but everything was delicious and prepared & presented with care.  My boyfriend ordered the crema Catalan for desert which was delicious and our server also got us the chocolate pepitas as a free dessert. My boyfriend said it was one of the best chocolate desserts he had ever had! Highly recommend trying out this place if you are in Barcelona!", 
    "4.0", 
    "Akrati J.", 
    "New York, NY", 
    "993", 
    "156", 
    "la-pepita-barcelona", 
    31, 
    [
        "Tapas Bars", 
        "Pub"
    ], 
    2
]