[
    "First let me just say this place should be named OH-LA-LA!!!!!!My husband and I walking around lost on the Ramblas, first night in Barcelona. We rented a flat and when we asked our landlord where was a good place to eat he said anywhere except near the Ramblas. Starving and knowing the chances of finding something good were slim we of course turned to our good friends at yelp.We put in tapas/small plates and this resturaunt was one that popped up so off we headed.This place was SUPERB!!!! We had such an amazing variety of little tapas. The meatballs were just of so good especially since we added them with a side of white beans. The croquettes were crunchy squeeshy balls of deliciousness and the lambs neck confit was like nothing I had ever had before. They had a special that night which was a sea bass prepared with asparagus, being from Hawaii, I am particular with how my fish is prepares and this was perfect. The skin was crispy and the inside moist and cooked to perfection, not to rare and not to overcooked.If nothing explains how good thisnplace was let me end with the fact that we ate here on Wednesday and then returned the following night with three of our friends who all loved it the same.Some might say pricey but when you consider how much we paid earlier in the day for the crap we ate at another place then Oh La's was a bargain!!!!!Plus the wait staff spoke English and were just oh so kind, after we had ordered our waiter actually came back and told us he thought we might have ordered too much. He actually suggested out of the variety of things we ordered recommend cutting one or two items based on what he thought would pair well together and what would not be in line with the other flavors.That combined with when I asked him to suggest a nice white wine to go with what we had ordered he surprisingly suggested the cheapest bottle on the menu at only16.95€, when there were other bottles of the same kind for 60-80€ just below. He said this wine is from our region, the others are nice too but this has Flo Ora like no other and is difficult to get outside of our region.All and all I loved this place. A little to the fancy pants side so if you are dressed up you will feel at home however if you are casualy dressed it's not so over the top that you feel uncomfortable or out of place. I was dressed up the first night, second night I wore shorts and was greeted with the same smile.Enjoy yourself I did......P.S. I met an old cowboy in the bar from Texas that said it was his third night in the bar because they made the best gin and tonic of his life, had all these fancy steps and herbs in a glass marinating, I don't understand anything outside of wine but if an older gentelman from Texas swears by it then it must be good.", 
    "5.0", 
    "Anna p.", 
    "Honolulu, HI", 
    "4", 
    "18", 
    "la-plassohla-barcelona-3", 
    18, 
    [
        "Tapas Bars", 
        "Gastropubs"
    ], 
    3
]