[
    "I found this place looking for a place to have a quick dinner, never really had seafood in mind but I started to check out the pictures and some of the reviews, I had decided where I would have my next dinner.Conveniently located about a 5-7 minutes walk from Barcelona-Sants train station or the Gran Torre Catalunya Hotel, it's in a place that feels like old Barcelona, tucked between tapa bars and a few other restaurants.You basically check out what you would like first, get in line and order, when your order is complete they'll take it to the kitchen, you then walk like 5 steps to the drink ordering station, order your drink and pay. They assign you a table number and you wait at your table for your \"mesa\" to be called, this means that your food is cooked is ready for pick up, no waiter service.Some of the seafood takes longer to cook or they'll be busy with multiple orders so be patient. When your food is cooked, you take it to your table and devour every single mouth watering piece of seafood that you ordered. The place is not fancy it's just a regular self service restaurant that has a bunch of tables where you can sit and eat either by yourself or your friends, except that the people behind the counter assigns your table.I read a review that about this place from some guy that probably has no idea what traveling abroad is like. He writes that they tried to sell him mayonnaise, that the portions were not enough and that Red Lobster is better. Let me make something clear to a few of my fellow American travelers, before you decide to go on vacation somewhere that will be different from the U.S. please use your smartphone to do some research, that helps.Everyone has a different culture and in Europe things like mayonnaise, ketchup, marmalade, butter, mustard and a few other things that in the U.S. are free they will sometimes not be free here.", 
    "5.0", 
    "German P.", 
    "Staten Island, NY", 
    "2", 
    "28", 
    "la-paradeta-barcelona-5", 
    1, 
    [
        "Seafood"
    ], 
    2
]