[
    "If you love seafood, you'll simply want to live in this place. SERIOUSLY. I can surely tell you that I did! I came here with a group of friends after hearing some pretty good recommendations. When we arrived, on a Sunday afternoon, there was a huge line outside of the restaurant and my first thought was \"is this really gonna be worth the wait?\". As soon as I walked in and saw all of those marvelous fresh seafood itens on display I understood that it would definitely be worth the 45 minutes we waited in line to get in.Imagine that you are shopping at a fish market: there are tons of beautiful, tasty, raw species right in front of you and all you need to do is order whatever appeals to your heart: \"I will have some of this shrimp, a little bit of that octopus, a large piece of tuna, some calamari, etc. etc.\". Literally, you can pick almost any seafood you've ever wanted to try cause everything looks beautiful and fresh. The staff will then weigh all of the different things you ordered and send it to the kitchen where it will be prepared to arrive at your table a few minutes later, properly and amazingly cooked.Do not forget to order some of their sauces, especially the alioli, which is simply superb! Also, make sure you come here with a group, as you'll want a bit of everything and it will certainly be too much food for one. To sum it up: this is the place to have an unforgettable seafood feast with your loved ones. The best part? I was here twice and spent less than 15 euros (beer included) both times. The worst part? They don't take cards, so make sure you hit the ATM first (also, I was a bit sad when I noticed the lobsters were still moving, poor things, but hey, that's how they have to be cooked, right?)That being said, this was definitely one of my favorite spots in Barcelona and I highly recommend that you try it out if you're a seafood lover.", 
    "5.0", 
    "Gabriele J.", 
    "Rio de Janeiro, Brazil", 
    "1350", 
    "870", 
    "la-paradeta-born-barcelona", 
    17, 
    [
        "Seafood"
    ], 
    2
]