[
    "There's nothing fancy about this place, but this is where you would go if you want (what I can only assume is) an authentic, local, Spanish dining experience.We found out about La Plata from one of the partners at Montiel (which, by the way, you HAVE to try!) when we were quizzing him about his favourite places to eat.  He did preface his recommendation with the disclaimer that this was simple food, a place that only served three or four different dishes a night.  But warned we were, and we loved it.The unapologetically minimally English-speaking proprietor came to our table and simply asked if we wanted \"fish, meat, bread, and salad\".  Thankfully, we had been in Spain long enough to competently order beer and wine, so that appreciably smoothed out the process.The beer was San Miguel, and the wine was served in a bottle filled from one of three kegs (white, red, and rose) propped up along the far wall.  With no clue as to the vintage or varietal of the wine, all we knew was that we had a smooth, easy drinking house red that just went well with everything.Since we basically said, \"si\" to everything he offered us, we each had a delicious plate of crisp, deep fried sardines; a plate of the standard tomato-brushed bread; a \"salad\" of tomatoes, onions, and olives dressed in olive oil; and a nice, juicy sausage perched atop more bread to finish things off.  There was no pomp nor circumstance to the delivery nor the meal, but just a refreshing experience to be crammed into a corner amidst a crowd of locals and some simple, tasty food.And the cost for 3 plates of sardines, 2 plates of \"salad\", 2 sausages, 1 plate of bread, one bottle of wine and 1 beer?  25 euros.  Awesome.Honestly, the food is really only 3 stars, but the simplicity and joy of the entire experience, and my willingness to recommend it to others traveling to Barcelona, is what has me bumping it up to an enthusiastic 4.", 
    "4.0", 
    "Dan T.", 
    "New York, NY", 
    "116", 
    "430", 
    "la-plata-barcelona", 
    21, 
    [
        "Tapas/Small Plates", 
        "Wine Bars", 
        "Tapas Bars"
    ], 
    1
]