[
    "Highlight of Barcelona had to be La Pepita.  Why?  Fusion tapas mofos, that's why.During my one week here, I stuck to the traditional tapas.  Because I thought, I was wayyy too cool for fusion.  Thank god we didn't have a choice on our last dinner option, courtesy of a local coworker.  This establishment, albeit with a limited seat capacity as I've come to expect from many places here in Barcelona, was superb.  The atmosphere was hip and trendy.  For example, go write on their wall.  Seriously.  Do it.  Cause there's a whole bunch of toddler doodles all over the wall, so go at it and relive that childhood no-no.  The wait for five on a Friday night at 8:30pm (typical dinner time in Barcelona.. so we were worried getting here LATE!) was only about 15 minutes.  And what can you do while you wait?  Why, sip on some cheap wine and beer at their sister bar two stores over!  GREAT!  But those points above are far out shadowed by the main star of the night - the fusion tapas.  Now, after having Spanish food for a full week, I found myself to be a Spanish tapa connoisseur by the end of the week.   Seriously, chefs were fangirling for me to come and sign their chef hats (enter pompous exaggeration).  So, I knew the basics pretty well, and although I found them to be tasty, it was fairly repetitive.  So you can only imagine how I felt looking through the menu, seeing these traditional tapas with a twist.  Everything we had on the menu was super solid, but the most notable ones of the evening were the following trio:  Oh the glorious invention of foie gras micuit topped with a smudge of white chocolate.  And then there was the crunchy and tender fried calamari with the most delicious kimchi mayonnaise ever blended.  And last, surprisingly, the most simple and common of tapas, the hearty and perfectly fried potato bravas, was accompanied by a tangy and almost marinara-like sauce that gave a splendid kick to my palette, the essence of sauce perfection.   All in all, a MUST visit.  They don't take reservations, so either come early (LOL early. That's super easy if you're a foreigner that isn't used to eating dinner at 10PM like most Spaniards)  or drink away at their spacious bar, since alcohol is just as cheap as water anyways.PS:  Don't rate any Spanish place by their service.  It's really unusual to tip, so servers can sometimes be indifferent and slow.  You'll find this everywhere, so I threw service out the window of this review.  That's all I wanted to PS.  Bawston, out.", 
    "5.0", 
    "Jimmy B.", 
    "Waltham, MA", 
    "260", 
    "154", 
    "la-pepita-barcelona", 
    1, 
    [
        "Tapas Bars", 
        "Pub"
    ], 
    2
]