[
    "This place is the BOMB!!!!!! They served some of the best food that we had while we were in Europe. This place is so good that we went twice during our 5 days in Barcelona. It's been two months since we ate here, but it feels like yesterday.It's right around the corner from Sagrada Familia, which might make you think that it's a tourist trap or something. However, it's the exact opposite. They serve some of the freshest seafood available. I swear that some of the seafood was still moving when they weighed it out for us.For those who have never been, this place is a no frills type of restaurant, which is my wife's and my favorite type of joint. Both times, we showed up right when they opened. There was a line out the door, which is always a good sign.When you get to the front, you pick from a bunch of fresh seafood chilling on ice. They weigh it out for you, and you pay for it by the pound. When applicable, they ask you how you would like it cooked. Some items can be cooked in a tomato sauce, but by default, most of the seafood is stir-fried in olive oil with parsley.Over the course of the two meals, we tried shrimp, prawns, clams, razor clams, mussels, calimari, fish and crab. We may have tried other items, which I've since forgotten about. All of the seafood was very tasty. You can't really go wrong.The razor clams and shrimp were the standouts. The mussels are the most affordable, and possibly the best value. The calimari was tasty, but an entire squid can be a bit too much fried goodness. The giant prawns are badass, but look more impressive than they taste. The crab is served cold, and tastes like a typical steamed crab. The fish was a little undercooked, but was still yummy.After you've picked out your seafood, they ask if you want bread or drinks. I don't give a shit what you order for drinks (we ordered Coke, and it tasted fine). BUT MAKE SURE THAT YOU GET SOME BREAD! It's critical for sopping up the sauces later in the meal.The food is served cafeteria style. Once your food is cooked and ready to eat, they'll call your number for you to go up to the window to pick it up. Make sure you brush up on your Spanish/Catalonian numbers, but they'll also announce in English as well. However, during our meal, we saw many people get confused by this simple concept and go up to the window repeatedly before their food was ready. Come on, people! It's not that hard!In summary, this place is fantastic. Go there if you like seafood. You won't regret it.", 
    "5.0", 
    "Nathan C.", 
    "San Mateo, CA", 
    "189", 
    "57", 
    "la-paradeta-sagrada-familia-barcelona", 
    34, 
    [
        "Seafood"
    ], 
    2
]