[
    "La Panxa del Bisbe (\"The Bishop's Belly,\" a famous mountain in Catalunya) is a solid choice for those looking to try inventive and ambitious departures from traditional Catalan cuisine, and at prices that won't break the bank. The cuisine here is a fusion of typical Spanish flavors with varied global influences, and with the most expensive item coming it at 14 euros, you can afford to be daring, and there is also a tasting menu. The prices are slightly higher than what you might find at a typical local tapas restaurant, but this is more than made up for by the imaginative approach of the chef, Xavi Codina, who was formerly with the gastro-tapas restaurant Santa Maria in El Born. I tried the ceviche, which was exceptional, consisting of anchoas marinated in citrus served with an avocado puree and topped with a gazpacho sorbet. The slightly more oily anchoas stood up well to the intense, vibrant citrus flavors, and the rich avocado balanced both well, while the chill of the frozen gazpacho provided an intriguing textural counterpoint. I also had the bacalao, which was cooked to perfection, flaky and moist, and served with ratatouille and a potato puree. Unfortunately, the ratatouille didn't stand up to the saltiness of the bacalao, and the potato puree seemed to be more of an afterthought. All told, with two plates, a beer, a glass of wine, and a coffee, the total tab was still less than 30 euros. The ambiance is a sort of industrial minimalism, with polished concrete floors, metal shelves, and mostly bare walls. Also, the wine list leans pretty heavily towards whole bottles, with a rather limited selection of wines by the glass. All in all, if you're in the mood for something more on the innovative side at reasonable prices, this neighborhood gem is for you. Just one warning: even on a mid-week evening the restaurant was full, so apparently the word has gotten out, and reservations would be strongly advised.", 
    "4.0", 
    "Paul S.", 
    "Los Angeles, CA", 
    "0", 
    "7", 
    "la-panxa-del-bisbe-barcelona-2", 
    2, 
    [
        "Catalan"
    ], 
    2
]