[
    "Spanish-English-French review:--------ES---------Amo este sitio y su gente, no hay mucho más que decir. A lo largo de mis estudios en Barcelona no había un sitio más iconico al que ir con un par de amigos mexicanos que a la misma taque, donde me hinchaba a tacos al pastor y gringas chonchas, acompañado todo por una rica agüita de Jamaica.A esta gente le gusta lo que hace y se nota en su servicio y en los platos que puedes probar. Desde luego, si lo tuyo es la gastronomía mexicana o quieres probar la auténtica, la de verdad, déjate caer por esta callejuela sorprendentemente tranquila al lado de la Sagrada y déjate guiar, la gente de la taqueria siempre está encantada de aconsejarte y explicarte en caso de que tengas curiosidad o alguna duda.Todo delicioso y con un servicio excelente, para los que vayan por primera vez recomiendo los tacos al pastor, los de bistec, las gringas chonchas y los nachos!--------EN---------I absolutely love this place and the people in it, there's not a ton more to say, it's simple. While studying in Barcelona, this became the place to hang out and have delicious food with two Mexican friends. Now, how do you know a Mexican restaurant is good?When there's mexicans eating inside!And it is delicious, I couldn't stop myself once I got there: the tacos al pastor, the gringas chonchas, everything. Plus, the people from the restaurant are all really nice and will explain everything if you have any doubts or need any guidance there.It's maybe not 1$ taco truck like those you find in California as mentioned by others, the price is higher. But I dare you, I double-dare you to find another Mexican place as nearly as good as this one.Al pastor tacos, nachos and gringas chonchas my favs, give it a try!----------FR----------J'adore ce restaurant et les personnes qui travaillent là-bas. Pendant que j'étudiais à Barcelone, une fois découvert, La Taqueria est devenue mon resto de préférence ou avoir deux-trois verres et de la très bonne et authentique gastronomie mexicaine avec deux copains du Mexique.Comment reconnait-on un bon restaurant mexicain?Quand on voit des mexicain dedans qui mangent!Un excellent service avec des serveurs très sympas et qui n'ont aucun problème à te guider ou t'expliquer les plats en cas de doute et des tacos (entre autres plats) à faire saliver rien qu'en y pensant, c'est définitivement LE resto mexicain à Barcelone.Les tacos al pastor, les gringas chonchas et les nachos sont absolument délicieux!", 
    "5.0", 
    "Max V.", 
    "València, Spain", 
    "6", 
    "4", 
    "la-taqueria-barcelona", 
    18, 
    [
        "Mexican"
    ], 
    2
]