[
    "Look let's just get this out of the way now - I don't like tapas. I've just honestly never understood the appeal. To me, they are just a food that comes in tiny portions, are normally overpriced and that, no matter how much you eat, usually leave you feeling somehow a little unsatisfied. So obviously, Barcelona isn't an ideal city for me food-wise, given that it's a Spanish tradition. Luckily even while excluding tapas from the equation, I still had found a way to find foods that I liked in Barcelona for the most part. However, as much as I enjoyed trying seafood paella, churros etc. while in Spain, as a California native who had been traveling through Europe for just over three weeks, there was only one thing I was craving like no other: Mexican food. So when we had a few hours to kill around lunchtime before going on our Sagrada Familia tour, I gave it a shot and looked up \"Mexican\" on yelp. To my surprise, La Taqueria came up as the first result, had great ratings, and was only a short walk away (5 minutes). I knew there would be no stopping me now. So when I walked over and saw that the place didn't open until 1pm, I was anything but fazed, even though it was only half past 12, as I was more than happy to sit and wait outside the restaurant. Even as my friend, unable to stand the wait, went off to grab food at a nearby restaurant, I held strong for the full 30 minutes, even as my hunger started to really kick in. This was just too good of an opportunity to pass up.So was it worth it? Hell yeah. Kicked it off with the guacamole, which I had been craving for weeks, then went for the Tacos al Pastor. I literally STILL remember how tender the meat was - definitely a great recommendation by the waiter. I'd eat that all day.Funny enough, whoever said the food reminded them of \"taco truck food\" was spot on in retrospect, because that's exactly how the food was prepared, except in a sit-down restaurant. The tacos, almost unequivocally, are similar to the kind you'd get out of a classic California taco truck: Simple soft tacos that consist mainly of fresh meat, with a dash of cilantro and onions - and taste great with a squeeze of lime. But guess what? Taco trucks are dope, and that's exactly how I felt about the food at La Taqueria. The place definitely isn't perfect (very small, unusual hours - who doesn't open until 1pm for lunch?, don't serve tap water - so you need to overpay for a tiny bottle of water), but the food makes up for it. Plus, you can't beat their location. And it can't even be properly quantified how difficult it is to find good, authentic Mexican food in Europe (aka the place Mexican restaurants go to die). Seriously though, twice on this trip I've seen people order nachos at restaurants just to get served what looked like DORITOS. Yup.Here on the other hand, I'm confident that if I ordered the nachos, that's what I'd get - real, authentic nachos. This place might only get 3.5/4 stars at home, but in Barcelona, this was easily one of the best meals I had.", 
    "5.0", 
    "Brian S.", 
    "San Francisco, CA", 
    "453", 
    "147", 
    "la-taqueria-barcelona", 
    9, 
    [
        "Mexican"
    ], 
    2
]