[
    "I was really looking forward to this place after reading the reviews and was having a lovely experience until I got the bill.After waiting a little while to be served [they were pretty busy in fairness] I finally got to order and I ordered the morcilla [which was really good, blood sausage with rice] and the cheese croquettes which were OK, not the best that I have had. He did warn me that it was blue cheese which I was fine with as I do love blue cheese but they were lacking in something. The guy serving me asked me if I would like some tomato bread with my meal and I said sure why not!I had a glass of cava, a beer and a vermouth to wash all this down.The tomato bread was very average quality bread for what I am accustomed to getting in this city and was dripping in oil. Pretty tasteless but I was hungry and ate half of the portion.I asked for the bill and realised the tomato bread was costing €3.80!! Completely over priced and quite obviously a ploy to make some extra cash on the tourists walking in here and asking them if they would like some tomato bread without informing them of the price! It was not on the menu!There was a North American couple beside me who were asked the same question and went with it and a South Korean couple beside me who were also asked.I questioned the guy serving me about it and told him it was very expensive. He said he did not make up the prices. I told him I understood that and told him it was a very sneaky thing to do to try to make extra money off unexpecting customers. He very quickly avoided the conversation and ran off after I had paid. He was obviously aware that both couples on either side of me were listening to what I was saying to him.This really spoiled the evening for me in this place. It had such potential but if they do not have the common courtesy to not try and rip off people then I do not hold them in any high regard whatsoever.Yiz sneaky little gicknahs!", 
    "1.0", 
    "Brendan W.", 
    "Dublin, Republic of Ireland", 
    "302", 
    "184", 
    "la-vinateria-del-call-barcelona", 
    4, 
    [
        "Wine Bars", 
        "Catalan"
    ], 
    2
]