[
    "In the heart of the hackneyed, narrow and beyond romantic streets of Barcelona's Gothic quarter is a square dominated by the cathedral of Santa Maria del Mar. After taking in the beauty of the church's entrance, be sure to do a 180 degree spin...and behold La Vinya del Senor, a charming wine bar serving some of the most delectable morsels and wine that we enjoyed on our weeklong stay in the city.   This tiny, two-level venue (climb a narrow circular stairway to access the second floor) was filled to capacity at the time of our Sunday night visit, around 9:45pm. Five of us snagged the only outdoor table remaining, and we settled in to watch hip city folk out for an evening with friends, or couples lingering over small plates, small talk, and the ubiquitous glasses of wine that are at the center of Spanish social life. With a setting this evocative, it's almost a crime not to come here with a significant other; I arrived with a merry band of friends instead, but made a mental bookmark to return someday with the Mister.We shared a bottle of dry cava rosado and several plates of interesting tapas ranging from olives to cheeses, jamon iberico, chorizo and sausage. Each dish was rich and amazing: \"just enough\" bites that took the edge off of meandering for miles through this beautiful and ancient city, without being overly filling. The entire experience totaled only about 12 euro per person: well worth it, not only for the outstanding food and wine, but also feeling as though you're in an enchanting dream-movie. The only thing keeping this review from five stars is the somewhat begrudging reaction we got from our server as we took our seats about twenty minutes before the kitchen closed, and thus had to place our order quickly. For a VERY nocturnal society, the place does roll up the rug a bit early on Sundays -- but then again, many other places are closed altogether on this day. As we left at 10:30pm, our seats and table were practically pulled out from under us as the waitstaff scrambled to shut down. I felt rushed (not unlike lunch at home during the workday, except with wine!), and that the staff was less than happy to see us. I understand the desire to leave work after a long day (story of my life). But at the same time I felt this to be completely at odds with the long, lingering Spanish dining experience. Come on, people, we're tourists with money to spend: fake it a little. I envy those reviewers who got to experience La Vinya del Señor the proper way: over an entire languid, delicious and carefree afternoon or evening, without a single thought given to the tick, tick, tock of the nearest clock tower.", 
    "4.0", 
    "Rebecca H.", 
    "Providence, RI", 
    "197", 
    "187", 
    "la-vinya-del-senyor-barcelona", 
    11, 
    [
        "Tapas/Small Plates", 
        "Wineries"
    ], 
    2
]