[
    "Not worth its starsPros: the food was tasty and freshThe tea was made with care, and my water glass kept fullThey didn't charge for breadCons:not memorable food.Waiter swept bread crumbs right into my lap, TWICE! Bathroom doors don't lock; women's / handicap bath doesn't even close securely or fullyVery cold dining room; they turned it down at my request, but it started blowing on me an hour laterTried to carry my husband's sport coat to closet?! He put it on me because 1 hour into dinner I was cold; they rushed over and offered me a shawl(good), but instead of helping my husband back into his dinner jacket, they said they were going to hang it.A little noisyDidn't handle food intolerance well.Details: as with the other low review raters (on trip advisor) we have dined at other Michelin starred restaurants and found this one lacking. The food and service were not impressive. Go to ABaC instead. I have some issues with lactose, and have found a chef's ability to adapt his offerings very telling about his skill and creativity, and never more so than here.When making and confirming reservations, we indicated 1 person had lactose intolerance. All the other fine dining we did in Bcn---indeed, all this caliber restaurant around the world--asked us about dietary needs. At Lasarte, I had to bring it up, and the head waiter's reaction was as if nobody has ever needed this before. Basically he said \"gee, there is cream in everything \" and after seeing this was actually going to be an issue for me, said he'd ask the chef. He came back with the chef's proposal. Since I only liked 3 of the choices, we decided to do a la carte instead of the tasting menu. Then the waiters start bringing the amuse bouche--most of which have cream--and when I asked about the contents they actually said, \"sorry you can't eat that\". This is rude. The three items I got (shrimp, risotto, tuna) had no cream in the descriptions, so he didn't need to modify much; again, not a challenge to his creation as much as a limitation for me. ABaC and Pakta both altered the chef's menus in ways that made me feel fully involved in the gastronomy experience. For dessert, he substituted mango sorbet for ice cream. Then come some small bonus desserts-- like the extra appetizers, this is standard practice now at such restaurants--and the first one is-yes- mango. Both were very good, but the repetition speaks to a lack of creativity and willingness to consider my dining experience. Other food notes: we like such restaurants because we enjoy cooking and eating. Part of what makes a restaurant's food memorable is a unique, artful, balanced combination of flavors and textures. There were several dishes that my husband or I thought missed the mark. The lamb was fatty. A hazelnut petit four was average in taste and texture. Some shaved foie gras in one dish was more livery than complex and smooth.", 
    "2.0", 
    "s t.", 
    "Oakland, CA", 
    "0", 
    "21", 
    "lasarte-barcelona", 
    12, 
    [
        "Spanish", 
        "Signature Cuisine"
    ], 
    4
]