[
    "Though I'm not of theMonte Carlo/Burj Al Arab set, I have eaten at a few Michelin-starred establishments in my time. Lasarte produced the finest exhibition of food and service I've had the pleasure of experiencing.  We made it a point to book well in advance in anticipation of our European vacation. We arrived as the restaurant opened its doors at 8:30 pm (remember, this is Barcelona). A family that arrived at the same time was turned away due to inappropriate attire -- Dad was wearing shorts. Don't worry, he went next door and purchased loud yellow trousers. They were eventually admitted for dinner. The ambiance oozed elegance and the place settings were twinkly, but  somehow it still seemed understated. Our waitstaff, consummate professionals all, provided impeccable service with moderately-accented English. My companion and I had the tasting menu and I (in the spirit of splurging) I had the wine pairings. I think the zenith of the evening came when the lids were lifted from the serving vehicles of the smoked oysters in perfect synchrony. The aromatic smoke that issued forth was swooningly good. The oyster dish featured a gelatinized ball  containing concentrated oyster essence. You have to see it/taste it to believe it. The other courses were invariably refined, creative and downright tasty. There were five flavors of butter for the bread for Pete's sake! Five! The floral salad and pigeon were the highest of the many highlights.  The wine pairings seemed dead on, though as I'd essentially lost my mind over the food, I couldn't fairly evaluate the libations.Of course we paid a king's ransom, but this was one extravagance I will never regret. Thank you Martin Berasategui and team!!Aside: If you are visiting Barcelona and have more than one day, go hiking in Montserrat. It's neato and has natural air conditioning.", 
    "5.0", 
    "AJ S.", 
    "Cambridge, MA", 
    "42", 
    "8", 
    "lasarte-barcelona", 
    8, 
    [
        "Spanish", 
        "Signature Cuisine"
    ], 
    4
]