[
    "Important things to know...1. You will have a hard time finding this place unless you've got it locked down with an offline map app (thank you maps.me)2. The servers here have limited English, so be prepared to fuse English, Spanish and Italian to get through.Le Cucine Mandarosso is a very tiny Italian place tucked down a tiny Barcelona alleyway.  When we arrived late one April night, it was the only place open in the alley.As we sat down, the server came over with the day's menu written on a chalkboard.  She did her best to translate into English as she went down the list.We started with a plate of three different burratas (16.50 €).  Because of the language barrier, we're not entirely sure which was which, but we believe one was a standard burrata, one had onions in it and one had a very smoky flavor, possibly with some meat(?) included.For my entree, I went with trofie with pesto (12 €) - a dish I'd first had in Cinque Terre.  You don't see trofie much in the U.S., but it's a tiny pasta noodle that's kind of corkscrew shaped.  I really liked it.  The basil in the pesto tasted fresh.We ordered a bottle of the house white wine (12 €), which was fine.  It was delivered to our table in a kind of frozen sleeve, like a beer can coozy or whatever.Total damage for two - 56.70 €One weird thing about Le Cucine Mandarosso is that there's really nowhere for the servers to hang out behind the scenes, so we had the three employees standing behind the counter, just inches away, kind of staring at us while we ate.  It's not their fault.  Seems like they have nowhere to go.  My fiancee was oblivious, since she had her back to them, but it just felt a little cramped.The servers were all very kind and patient as we worked through our various language barriers.If you're looking for a good Italian option in Barcelona, this definitely qualifies.", 
    "4.0", 
    "Ben B.", 
    "Chicago, IL", 
    "196", 
    "776", 
    "le-cucine-mandarosso-barcelona-2", 
    3, 
    [
        "Italian"
    ], 
    2
]