[
    "I went on a month long trip in Europe - Italy, Spain, and France - and Leku was one of, if not the best, dining experiences that I had. And I ate out every night.  What I wanted was a chance to sample some traditional Catalan food, and luckily a friend of a friend was native to the area and took me to Leku. It certainly had that, and more. First, you may notice that it is a completely family run business. It feels that way. One waiter had a lengthy conversation with my friend about who knows what in Catalan. There were no bright line distinctions between who did what. The chef who also runs the place is part owner with I believe his mother. He was at times our waiter, our bus boy, and also of course the concerned chef who asked how each course went. And the food sure was fantastic and new. The ingredients were fresh, and almost entirely made in house. Some dishes were more traditional, while others were inventive but still inspired by the Catalan palette. For example, I had a fish dish that was paired with a mayonnaise dressing mixed with bacon! Apparently the people of Catalan mix meat and fish all the time, but it was a completely new flavor for me. A more traditional dish I had were these fried shellfish, something between a shrimp and a lobster, purchased fresh from the fish market that day. Ox tail wasnt weird at all, and it was very juicy and full flavored. The squid-ink croquets were probably my favorite, could have eaten ten of those. For dessert, I had a mojito flavored whipped cream and a cheesecake flavored yogurt. Maybe the greatest part of this restaurant was the quality combined with the authenticity of the Catalan culture. I know some spanish, but Im not sure I heard a lick of Spanish in that place. There was a large group celebrating what seemed like an anniversary. There was another older couple having dinner, and young couples perhaps on their first date. This place was not a place that tourists swarmed, which is something that by that time I had enough of. This was a place that a person native to the area would suggest, and it was a wonderful serendipity that I was introduced to it. They say you may not know how people treat you, but youll always remember how they make you feel. Well, not only did Leku treat me like an upper-class man, but as an outsider they made me feel welcome. I'll remember that most of all. Thanks guys", 
    "5.0", 
    "Ed Z.", 
    "San Diego, CA", 
    "11", 
    "2", 
    "leku-barcelona", 
    1, 
    [
        "Spanish", 
        "Mediterranean"
    ], 
    2
]