[
    "This was our first restaurant in Barcelona (and Spain for that matter)! Our apartment stay was less than a five minute walk from here and we were so grateful to have found this place and it being so close! We would have eaten here twice but our time was limited in Barcelona and we wanted to try as many different restaurants as we could in this beautiful city!Our favorite moment was really in the beginning, we checked when the restaurant would open and it stated 8pm, so we headed out around that time being it so close to our AirBnB apartment. When we got there the restaurant was still closed. We waited outside and people watched for a while, 15-20 min later, one of the workers unlocked the door, looked at us with a smile and said they would be opening soon. We were amused with her laid-back and unhurried attitude even though the restaurant was suppose to be open... it's hard to explain but that's the first time we encountered how different their culture was. My husband and I said to ourselves, I guess opening times are \"suggested\" here in Barcelona...Our dining experience was nothing short of amazing! The waitress explained everything on the menu. She explained the food with such passion, it was really entertaining to hear her talk about their food. We ordered the oysters and pate for appetizers. She suggested to have the oysters first, she said \"oysters need their own alone time :)\" She was right! We really had to have them on their own to appreciate how good they were. We then had the pate followed by our entrées, eggplant parmesean and their special of the night - some beef stew. The wine and food were all wonderful and filling. The restaurant is a little small, but it all worked with its intimate and romantic charm. Our first dining experience here in Barcelona was amazing and very memorable. If you are staying near the area or happen to be in the area, it is a definite must to eat here for dinner. The food, the people, the memories are worth every penny... euro...whatever!", 
    "5.0", 
    "Hazel P.", 
    "Santa Clara, CA", 
    "61", 
    "44", 
    "lo-de-flor-barcelona", 
    4, 
    [
        "Mediterranean"
    ], 
    2
]