[
    "I would give it negative stars if possible. Agreeing with another yelper below, the worst food we had in Barcelona. We saw all the Yelp reviews for seafood paella and were specifically coming here for that, and we walked to the restaurant all the way from La Sagrada Familia. We were seated quickly, and our first waiter automatically announced he didn't speak English and left. No one else came to help our table for at least ten minutes. Finally another waiter begrudgingly came over and took our order. We wanted to split the paella between the four of us and he announces the kitchen has run out of paella for the rest of the night. Sorry, what?! How is that possible? We all grumpily return to our menus and pick other things we didn't really want. What we should have done is gotten up and left. After we are brought our food, nothing is remarkable, noteworthy, or decent, two other tables of people are sat in front and behind us. Both are speaking Spanish, and both order paella. Within the next twenty minutes they are both brought large servings of paella. I flagged down the waiter, extremely pissed off, and ask why they are being served paella when we weren't able to order it. He says they called on the phone and ordered it before they got here and they saved it for them. Really.... both separate parties ordered paella and you saved it for them? Yeah... okay. We ended up chatting with the table behind us when they heard we didn't get paella. They admitted they hadn't called ahead and had no idea why they wouldn't serve us the dish. They were even nice enough to put some on a plate and let us all try a little. Thanks, guys! It was good, but not good enough to even give this place even one star.Our waiter came over and brought us each a slice of honeydew to make up for the \"mixup\". Keep your stupid honeydew and learn some professionalism and manners. I don't know if they wouldn't serve us because we didn't speak Spanish, if we were Americans, or what, but here's a newsflash. In America it's customary to tip well because servers rely on those tips. Most Americans are accustomed to this and tip well all over the world, and our server would have been very happy at the end of the meal if he didn't treat us like dirt beneath his shoes.", 
    "1.0", 
    "Abi B.", 
    "Chatham Township, NJ", 
    "15", 
    "39", 
    "los-toreros-barcelona", 
    6, 
    [
        "Spanish", 
        "Mediterranean", 
        "Tapas Bars"
    ], 
    2
]