[
    "Barcelona's Barri Gotic made me feel like an explorer, a kid at heart again.  The narrow, cobble-stoned streets and alleys that blend into one another and eventually into plazas teeming with life, make you want to throw away the map and revel in being lost.  Well, that is easy to do if you are a crazy American, who fails to bring a cell phone that has ex-US coverage or have limited minutes on your unlocked iPhone with pre-paid SIM card...Alas, my travel buddy, Rosa, and I found our winding and bewildered way to Los Pergaminos thanks to yelp.com.  We had tried going there on a Monday night after much walking.  We were exhausted and disappointed with our unsuccessful first attempt.  Yet, Rosa would not be thwarted.  She had read the rave yelp reviews, saw that it was family owned and operated with a warm and cozy ambiance and she was focused.We returned a few days later and to our surprise, they were open.  Our experience there, thanks to CLAUDIA, was the most amazing.   She suggested a very solid red-wine pairing the first night and dishes that made our stomachs happy.  (please see the photos).  Claudia actually spoke to us in ENGLISH (thank you) with occasional small discussions in Spanish (thanks to all of my Spanish college professors and high school teachers!!!! Spanish has become my go-to language)I would highly recommend this place and my favorite was the dessert:  Crema Catalan.  DELICIOUS!You have to try the jamon iberico and pan con tomate.   The paella...(we had the chicken and non-seafood one b/c of shellfish allergies) was delicious and I'm sure that the seafood one would be equally so.  To die for was the foie gras layered with goat cheese and topped with apple and caramelized sugar (yummmmers)We were so pleased that we returned again another evening.  The price is moderate, but tapa, family style sharing keeps prices rather reasonable.  I think that we ended up spending about $60 with wine for 2 people the first night and a little more the 2nd visit.   Barcelona is definitely a city for all senses...so enjoy!!!!!!!", 
    "5.0", 
    "Hiromi N.", 
    "San Francisco, CA", 
    "357", 
    "945", 
    "los-pergaminos-barcelona", 
    21, 
    [
        "Spanish", 
        "Tapas Bars"
    ], 
    2
]