[
    "We got a great server, who was very patient with all our questions and gave us great advice. Ordered the seafood and meat paella to share between three, the aubergine with honey as a tapas choice as well as jambon croquettes. Finished off with the Creme Catalana to share for dessert. We shared a bottle of Sauvignon white wine - the Jane Ventura label- as a compromise, since I like sweet and the guys I was with liked dry. We arrived right at 7pm, and considering how busy it got super quickly, I would totally recommend doing the same.  It does really take a minimum of 30minutes for the paella to cook, so we got x2 tapas to share - the aubergine with honey and the jambon croquettes. Of these two, I really would absolutely recommend getting the aubergine with honey. These were creamy and salty and sweet and tempura-like, when I first bit I thought we had ordered hot potato fries by mistake, but a very classy variety, before being corrected by my dining companions. I also like the jambon croquettes, as the potato hash was just perfect, but the aubergine won my palate over.We loved our tapas, but the paella outdid anything we have ever eaten before. Each bite was a medley of rich and comforting flavours and there was a lightness to the food, which made for a smoothness, almost as if drinking from your favorite whisky.  The serving size was generous as was the portion of seafood - I finished off my last bite, feeling both content and satisfied. We took a breather for 10minutes and then ordered the Creme Catalana dessert to share. I have had this before (for the first time, in Venice) and loved it there, but there was a mellow sweetness with crunchy almonds and the cold meeting the burnt sugar, that we all agreed this was infinitely better.One final word - the service was superb here! Felt like had come to a friends place and our waiter was just excellent. We ended the night with a herb after-dinner drink, a perfect end to a perfect meal.", 
    "5.0", 
    "Kanchan B.", 
    "Memphis, TN", 
    "144", 
    "637", 
    "los-pergaminos-barcelona", 
    6, 
    [
        "Spanish", 
        "Tapas Bars"
    ], 
    2
]