[
    "Los Pergaminos means 'the scrolls' in Spanish.  We passed this restaurant many a time in our wanderings around Barcelona.  One night we were craving paella but then it was too late to eat it since most places serve it at certain times.  So we tried again the following night for a different place and found out that it was closed on Sundays.  Just our luck.  Enter Los Pergaminos.  We had passed by previously and noted the menu board outside.  They had paella until 10:30pm.  We walked in.  The decor is dark and dusty like pirate scrolls.  We ordered sangria, duck foie gras stuffed figs, shrimp in garlic butter, and mixed paella.  Let me just tell you, the duck foie stuffed figs are AMAZING.  I want to retire somewhere and pop those little babies all day long.  Yes, please.  The shrimp in garlic butter was good too.  We had to ask for bread just to dip it into the garlic butter sauce.  So good.  The paella is for a minimum of 2 people.  They won't make it for one.  Well they might if you just happen to be two strangers in a restaurant wanting the same thing.  But then you'd have to sit together and I digress.  The paella was really good.  There was a decent amount of crunchiness and softness to the rice.  The mussels were actually not fishy!  The chicken was cut into large chunks.  The shrimp was perfectly cooked.  The calamari rings were tender.  I'm not sure there was any rabbit involved but if it was there, I couldn't tell.  I was a happy girl.  All I wanted to eat in Spain was paella and I got my wish.  Ok, I know paella is from Valencia, but don't ruin this for me!  I loved it.  That said, I would venture back to Valencia anytime if you want to show me your favorite paella place.  We had excellent service.  The host and servers spoke a decent amount of English, albeit with a sexy accent.  If anything, come for the duck foie stuffed figs, but stay for the paella.  *drool*", 
    "5.0", 
    "Trina D.", 
    "Orange County, CA", 
    "760", 
    "1699", 
    "los-pergaminos-barcelona", 
    29, 
    [
        "Spanish", 
        "Tapas Bars"
    ], 
    2
]