[
    "We went to this restaurant the first night of our visit to Barcelona.  The food was okay, but the server was a somewhat confrontational to a gentleman in our party.  That first night, I went upstairs to go to the bathroom and noticed that the atmosphere up there was quite nice, so I made a mental note to return on another night to have dinner upstairs.  Several nights later, I returned with three other people and we headed upstairs to try and get a table.  To the best of our knowledge, this was a self-seating restaurant. When we got to the top of the stairs, we were approached by an incredibly rude and irritable waitress who proceeded to scold us for having the audacity to come upstairs to ask for a table.  She barked at us to go downstairs and request to be seated by the hostess.  In fact her words (with  a head bob and finger point) were as followed:  \"Uh...normally when you enter a restaurant...you smile nicely and ask to be seated...\"  She then turned abruptly and stormed away.  We stood there absolutely stunned, our jaws dropped at how unnecessarily rude this waitress was.  We then watched as she bent over the wall to yell something down to another employee on the first floor.  We then walked downstairs and attempted to talk to the manager (who I think was the one that she yelled down to), she just smiled and talked over us, only repeating \"its okay, its okay\".  She did not listen to a word of what we were saying.  We finally gave up and just left the restaurant.  We went across the street to The Attic restaurant where we were immediately welcomed with a big smile by the hostess at the front door.  Our company trip to Barcelona included about 70 people, all staying across the street at Le Meridian Hotel.  Needless to say, we spread the word about the treatment we received at Luzia Restarant and advised all to beware of the rude service.  All I can say is BAD BUSINESS.", 
    "1.0", 
    "JT H.", 
    "Irvine, CA", 
    "5", 
    "7", 
    "luzia-barcelona-2", 
    6, 
    [
        "Breakfast & Brunch", 
        "Burgers", 
        "Pizza", 
        "Italian"
    ], 
    2
]