[
    "There were a few days left in BCN, & there was serious shopping to be done. I thought I'd try saving some € by spending less on food. I'd been wanting to try Maoz Falafel since reading the reviews here, so I made my way there in the morning, before doing my shopping. I found myself standing in front of the food joint at around 9:50AM, waiting for Maoz to open. This woman came & unlocked the door, & told me they wouldn't be open until 11 AM. Oh.I really, really wanted to try the food here, so I went back at around 11:30AM after doing some shopping. I saw these girls standing outside, having a cig. I went in & they followed suit, sat themselves at 1 of the 2 tables. There was also a family there (2 boys, & dad), so both tables were taken. Luckily, as it turned out, the family was on their way to the airport to catch their flight (I know this because the dad kept saying \"our chips!\" & had an argument with the Maoz guy, & while all this was going on, the dad with the unibrow kept getting olives directly from the tray & leaving the seeds on the counter.....srsly dude..), & so 1 of the 2 tables was free for me to grab. I placed my collapsible shopping bag there to \"reserve\" my seat. Hehe.If you're going to eat at Maoz & want their salad buffet, you're gonna need to eat in. I ordered the falafel with salad buffet + a soda & paid I think €5+ for everything. I refilled my bowl with sides & sauces a couple of times. I was stuffed, & didn't feel hungry until the following day. Thanks to Maoz, there was 1 day that I spent only around €5 for food in BCN. Phenomenal. Only at Maoz. More € for shopping. Hehe.Note: the falafel with salad comes with greens, & a single (small) falafel. I'm reading reviews from another reviews site, & someone said she got 3 falafels. So I dunno. The sides are the ones you can get as much as you want of, & they are so delicious that you wouldn't know which one to get. I got a bit of everything, & thought the fried broccoli was super (never had that before, I think).", 
    "5.0", 
    "Violet C.", 
    "Las Vegas, NV", 
    "80", 
    "96", 
    "maoz-falafel-barcelona", 
    14, 
    [
        "Vegetarian"
    ], 
    1
]