[
    "I hate  to have to write this review, but \"the truth though the heavens fall.\"Cliff Notes if you don't care to read on: Average food in a city with plenty of good restaurants. Go somewhere else.The fawning Yelp reviews should be a clue. Gaming the system? Looks that way.At a little past 8 p.m. there was no line and no crowd. Approaching the restaurant a man--now recognized as a barker, but perhaps the manager or owner--greeted me at the door in a loud, friendly voice, inviting me in. Another clue missed.\"Wouldn't mind sitting out here on the sidewalk at one of these tables.\" (it being a lovely summer evening.)\"Oh, no maestro, these are reserved.\" For what or whom I didn't know, but didn't press him.I was directed inside.Once seated a lovely young woman approached my table. Did I want something to drink, perhaps some wine. I was thirsty, having walked some blocks to get there. A beer perhaps? Peroni? Yes, I replied, as she pointed to the Peroni patch on her left sleeve. \"Small one please.\"In a few minutes I noticed a pony keg being rolled up the incline to the bar area. Coincidence? Would this account for the weak pour I got? My Peroni was delivered in a thin little glass about 80 percent full, one quarter of that being the carbonation. Is anyone paying attention in this place? Does anyone care?I hadn't eaten since a mid-morning breakfast, so came hungry. One could imagine arriving in that condition that the meal would be begging to be eaten. Burrata antipasto. It arrived as a blob on a plate, resembling an albino sea creature, perhaps nearly a pound of it, covering a couple of thinly sliced, tasteless tomatoes and a little rocket thrown in for good measure. There may have been some basil in the mix. I was hungry, ate everything green and red, but finally had to quit the cheese. My cholestorol count is now likely sky-high. I seriously doubt that the burrata flew itself in from Puglia. Skip this antipasto if you aren't already skipping this restaurant.While eating the first course my ears were assaulted as the half dozen or so waiters pounded up and down the stairs delivering yet another average meal or retrieving finished (we can only guess) plates from upstairs' diners. Those plates must have been as weighted going down the stairs as up, if my meal was any clue, as it turns out.Penne with some vegetables and cheese arrived soon enough. The closest fitting description of this often delicious dish, as prepared and served here is, well, insipid. Over-cooked eggplant, thin, bland tomato sauce--hell, it wasn't tomato sauce, it was akin to tomatoes having been squeezed over a pot of hot water, and the water spooned over the pasta. Has the chef or owner never heard of San Marzano tomatoes undiluted? The wine? Well, mostly bad, that which I tried anyway. The young woman was kind enough to allow me to sample a few tastes before I settled on a fourth, the varietal already forgotten. She had even opened a bottle at my table to try. Corked it was. But this word was not in her vernacular. I couldn't find fault with her--I was speaking English, not her first language, and had no right to expect that she understood what I was talking about when I tried to explain what \"corked\" means. So someone else will be getting that wine before too long. Sorry. Sweetie, you are a lovely individual and you tried very hard.Later, the best part of the meal arrived unasked for. It signaled the end of it: a free spot of lemoncello. How welcome.As I exited, having been inside about an hour, I noticed that the reserved tables for the sidewalk had not yet been filled. Late diners evidently hadn't arrived at nirvana just yet.", 
    "1.0", 
    "Z V.", 
    "Pacific Grove, CA", 
    "0", 
    "8", 
    "margherita-barcelona-3", 
    13, 
    [
        "Pizza", 
        "Italian"
    ], 
    2
]