[
    "UH OH THE BIG 100!!! Can't believe this will be my 100th review! What the hell have I even been saying in all these reviews?! Oh well, here goes!I have been waiting to write this review for YEARSSSS!!!! You see, when I first came to this restaurant 3.5 years ago, I wasn't on my Yelp shit. Then I felt like it would be unfair to review them based on an experience I'd had years prior. So when I revisited Barcelona, this place was at the top of my \"must do\" list. The food here is so different from anything I've ever had. Both at home and abroad. They definitely stand out with a mix of cuisines: Vietnamese, Catalan, and Cajun. Like seriously, where they do that at?!The place isn't big but it also isn't NYC small either. But definitely maintains a sense of intimacy. Would be an awesome anniversary or even engagement spot. On to the food: when we originally ordered, they were out of 3 things we wanted, so we were forced to make different choices. It was the best thing that could have happened. The things we wanted, though slightly special, were very much within our comfort zone. What we ended up with was not. Amuse:*Salsa with yuca chips. So good but definitely not enough salsa for two. Appetizers:*Salmon tartare with crispy salmon skin. The texture of this tartare was everything. The salmon was perfectly diced and the addition of the crispy skin just completely set it off. *Papaya salad with beef jerky. This was probably the most out of our comfort zone. Neither of us would have ordered this under normal circumstances but sooo happy we did! The balance they achieved with this dish was nothing short of magical! Who would have thunk it?Entrees:*Saigon Ribeye with Vietnamese fried rice. Both of these items were delicious on their on, though, I didn't quite \"get them\" together. *Octopus a la plancha. Octopus is like my new steeze. I pretty much order it everytime I see it on a menu. This was some of the best I've ever had. The presentation was beautiful. (Though slightly upsetting since we had just seen a lot of live octopus at the aquarium that day lol).  But it was delicious. Crispy on the outside and super tender on the inside. Nothing gummy or chewy about it. Desserts:*Vietnamese banana bread pudding. A yummy dessert served with fresh coconut sorbet. Yummy as it was, I think it was missing more of a textural element to contrast the softness of the sorbet and bread pudding. *THAT CHEESECAKE THOUGH!! Goat cheese cheesecake with fresh rosemary and cracked black pepper. You would think that the additional of these ingredients would turn the dish savory but on the contrary, it really brought out the subtle sweetness in the cheesecake. The super creamy texture from the goat cheese is out of this world. I am VERY picky about my cheesecake (I kinda worship my Mama's recipe) but this even trumps that! (Please don't tell her I said so!) If you do nothing else here...do this!! When I move to Barcelona...I will be here at least once a week. In. Love.", 
    "5.0", 
    "Salimah H.", 
    "Jersey City, NJ", 
    "87", 
    "114", 
    "me-barcelona-2", 
    1, 
    [
        "Vietnamese", 
        "Asian Fusion"
    ], 
    4
]