[
    "Ok, we have been in Barcelona now for a week of a three week stay. This place by far has been the best meal since we landed. We were in the mood for something different. No more Tapas food as we are tired of different places all offering the same Tapas food. Yes, we are tourists and I understand that is what Barcelona is about, but I wanted to eat real food that makes me say WOW... I want more of that. Ok, they open at 9pm for dinner so do not get their earlier. A reservation is a good idea as they only have about ten small tables, especially if you go in a group of four or more. We got lucky as we strolled upon this place right at 9pm when they were opening so they sat us right away. Basically two people work here, the owner and the chef who may be an owner as well. Two women who just rock. The service was very attentive as the owner, I think her name is Arianna, was just great with us and our two kids. She explained the small but varied menu as everything on it was just slightly unique enough for us to want to enquire. The offerings are not your typical Italian dishes, but versions of, with a special twist of the great chef in the kitchen. We were served bread right away, no butter by the way. Also she brought us a dish of olives which per my wife were some of the best she has eaten period. We ordered a couple of assorted cheese appetizers which were delicious. Then we had several different plates for the main course. My wife had some grilled shrimp, very simple plate, but she said absolutely delicious. They were served in the shell so a little labor was required to de-shell and eat, but she said it was well worth the effort. I ordered the vegetable ravioli... strange for me as I am a super meat eater but they intrigued me and I wanted to stray from the norm in my case. They were out of this world. Great sauce and the ravioli were filled with I think cheese and pumpkin, not 100% sure, but it didn't matter as I was in heaven. I ate every drop and even cleaned the sauce off the plate to get every last savory taste. My kids split an order of the pasta w/ meat ragu or in generic terms a pasta w/ bolognese sauce. When it arrived it looked a little light on the bolognese sauce, but when they did not finish it of course I felt obligated to give it a try. Well, I was amazed at how much flavor the dish actually had. The meat ragu or bolognese was absolutely delicious and once again I found myself scraping the bowl for just one more bite. Next time, and there will be a next time, I will order this dish and double up on the portion as in my opinion it was that good. As for beverages we kept it simple with just water and sodas as we do not drink too much but it does seem that they have a nice offering of wine, beer, and some liquor to satisfy all. At the end of the meal we shared a chocolate pastry type cake. Very simple and yet again delicious. The only problem is that one piece did not satisfy the cravings of all four of us. The location is quite hidden so take care when following your GPS to get there as it is easy to miss. No real sign at all, just a small menu of the day out front and two ladies working hard to get it all right for you. The prices are not your typical \"Tapas\" cheap, but they are not high at all. For the four of us we spent 78 Euros in all which for the quality of the food I considered to be reasonable. Ah, they do not accept credit cards so go prepared with cash in pocket otherwise you will be washing dishes for the next week to work off your bill. Once again, to date the best meal for us in barcelona. Not touristy at all, mostly locals coming in to pay their regards. I love these types of places, a true find in my view. Enjoy the experience and tell your friends. This is the type of food I am willing to pay for. Bon appetite!!!", 
    "5.0", 
    "Peter R.", 
    "Scottsdale, AZ", 
    "0", 
    "81", 
    "meneghina-barcelona", 
    10, 
    [
        "Italian", 
        "Signature Cuisine", 
        "Gluten-Free"
    ], 
    2
]