[
    "Well, what a divine combination of civilized and bohemian.  Understated awesome. I can't think of the last time I experienced a restaurant/bar with this kind of authentic DIY authenticity and talent that hasn't been \"discovered.\"Languages spoken by the owners include English, Spanish, French, and probably more.  Everyone was beautifully multi-lingual.Mirilla is owned by hard working young women (earning their dreams with blood sweat and tears)  who happen to cook up some of the best food I've had in Barcelona (or anywhere) mix a perfect Mojito as well.  The (mid-priced) food is right up there with anything my (sensitive, experienced) palate has known.  Foodies will understand how good it is, and so will everyone else who doesn't put on airs but likes eating and drinking.Not sure how to describe the cuisine.  Spanish fusion?  Not the average tapas, but definitely strongly Spanish.  All the ingredients are very fresh and flavorful.  The veggies taste farm fresh.  (Sliced/layered winter squash, tomato, basil, goat-cheese backed stack!)  Some vegetarian dishes.  I had several seafood dishes that were beyond perfect in freshness, preparation, texture... Well chosen wines by the glass or bottle.  Mojitos with strong mint, good rum, and raw sugar.  The service is good, never slow like other places where you may have suffered in Barcelona.  I mean, don't look for fast food here, but you can expect to be taken care of attentively.  It is a small place and the owners are often serving you-- they are motivated and thoughtful hosts.The customers are mostly local \"in the know\" types at this point I think.  Diverse crowd. Couples, individuals, locals, travelers, various nationalities, languages.  Gay, straight, a very modern cross-section of friendly, lively, non-tacky people.  Younger, older... all with worldly yet unpretentious good taste.  What they have in common is they seem to be unusually attractive, interesting, and full of life.  In short: like Barcelona, just the right combination of grit and pollish.  I am in love with this place! Be good to them and enjoy yourself.", 
    "5.0", 
    "katie s.", 
    "San Francisco, CA", 
    "24", 
    "50", 
    "mirilla-barcelona-2", 
    12, 
    [
        "Modern European", 
        "Tapas/Small Plates"
    ], 
    2
]