[
    "In coming here I thought this would be one of our best meals in Spain to round out trip. It even came highly recommended by one of our friends.  Long story short we came here the last night of our trip and the restaurant just didn't meet expectation. We were seated at a table closest to the kitchen. There was so much noise coming out of the kitchen it was hard to ignore (there is no door only a curtain that was open). For the meal: the first course was fine (sweet potato chips)- not exactly something I come to a fine dining place for. The next 2 courses were good and looking back probably the best of the meal. There was a scallop sashimi salad and a sun choke soup. Now for the bad - the sea bass that was on the menu was substituted with cod. over the course of a week in Spain I ate a lot of cod and it was good, so I was looking forward to something different. Well - so we get cod again, no big deal so long as its well prepared. Unfortunately - it was very fishy smelling and just off putting such that all four at the table couldn't actually eat this dish. The thing that made it even more disappointing was if you're a restaurant that prides itself in quality food - if an entire table doesn't eat a dish you serve - you should at least ask why. But the waiter just took away the plates. The next course was beef. no one specified how it should be prepared. My husband just told him to serve it how the chef thinks its best served. Well 2 of the 4 steaks that showed up were well done and so chewy we couldn't eat it. My sister and I were so tempted to send it back but just didn't have the nerve to do it. Then the desert - just overall unimpressive and fry cake. I'm sure this place it great but my experience sucked. This might have been b/c we went on a sunday night and the regular staff was off. Regardless after a week of eating incredibly well, this place was sub par.", 
    "2.0", 
    "Komal B.", 
    "San Francisco, CA", 
    "67", 
    "145", 
    "montiel-barcelona", 
    32, 
    [
        "Mediterranean", 
        "Spanish", 
        "Gastropubs"
    ], 
    3
]