[
    "This is one of those places where the food is not only exceptional, but the incredible service and staff just put the entire dining experience over the top!But when I say 5-star incredible service, I'm not talking about the well-rehearsed and precision makings of a place like Per Se or Alinea.  I'm talking about the kind of place where the front of house takes the time to sit down at your table and passionately explain the nuances of jamon to a table of foreigners; where the waiter effuses with joy about what is happening in the kitchen serves every dish with pure excitement; and just the overall warmth and welcoming that wiped away any sense of pretense that one might expect with seemingly simple, but surprisingly complex flavours served at your fingertips.But let's not forget about the food.  Unfortunately (for you), our meal was a special \"New Year's\" menu that they threw together that day based on what was fresh, and actually morphed throughout the evening based on the chef's whims and inspirations (now how great is THAT?).  But hopefully some of the dishes they served that night will make a reappearance on future nights, because they were just outstanding.Even with the simplest plate of olives and jamon to start, every morsel was of exquisite freshness and overwhelming with depth and flavour.  A definite favourite of ours was the wild salmon tartare, dressed with a seafood caramel and salmon roe.  The acid and lusciousness of the salmon played so well off each other amidst the smoky notes of toasted pine nuts and sesame seeds, and we felt spoiled to have eaten so well so early on.Foie lovers need not be disappointed, as we had foie that was marinated in bourbon and prepared sous vide, and then served alongside a marvelous quince jelly and candied pistachios; then another piece seared brilliantly alongside a piece of filet mignon and showered in black truffle shavings.But does the truffle madness end there?  Certainly not.  A deceptively simple dish of wild mushrooms, egg, and black truffle just oozed decadence and could not be any more delicious, with each component shining as it should.The chocolate desserts may not have been as visually arresting as you might come to expect at places of similar calibre, but the flavours and textures of chocolate mousse, iced raspberries, and chocolate foam were playful and definitely satisfying.Amidst all of this great food and brilliant service, I think it is also worth giving them a plug and highlighting the fact that the folks at Montiel pull off what they do by committing themselves to local produce, including a commitment to sourcing 80% of their wines from Catalan, and have been awarded recognition as a \"Slow Food Movement\" restaurant.  Not that they needed these extra kudos to convince anyone to come eat there, but I figure they worked hard for these accolades, so someone should brag about them!", 
    "5.0", 
    "Dan T.", 
    "New York, NY", 
    "116", 
    "430", 
    "montiel-barcelona", 
    19, 
    [
        "Mediterranean", 
        "Spanish", 
        "Gastropubs"
    ], 
    3
]