[
    "We booked this restaurant for our second night in Barcelona.  This has to be one of my favorite restaurant.  Similar to  many of other restaurants, they were small but this one actually had a second floor.  We had waited all day around the area and were getting tired.  We didn't want to go back to our hotel only to take the metro all the way back so we lingered in the area.  We even got seated early too.  Even though we were a bit tired from the long day, we loved our nearly 3 hours here.  I tend to eat everything fast but I savored every piece that came my way.First Course: Iberian ham with tomato toastSecond Course: OysterThird Course: Melon soup with extra virgin olive oil ice creamFourth Course: Prawn Tartare with guacamole and lime's airFifth Course: Albacore on thin toasted bread with romesco and capers with edible flowers6th Course: Lobster's Rice7th Course: Ceviche (complementary dish)8th Course: Duck and pears raviolis with foie poele and wild mushroom in Oporto's sauce9th Course: Suckling pork with pumpkin puree (was not on the menu but we were lucky they had it for an upcoming party)10th Course: Alcohol free beer (palate cleanser)11th Course: Peaches, yogurt, and celery ice cream12th Course: Figs, Baileys, Tonka Bean13th Course: Complementary TrufflesWe also got the wine pairing that came with this.  I highly recommend this as it made every dish seem more enjoyable and it complements it very well. As a result, I now think highly of Spanish wine.  A great way to experience Spanish wine.Everything was great.  My favorites were the Prawn Tartare, Ceviche, and Suckling Pork.I would definitely come back!  Loved it.The service was amazing as well.  Both the host and waiters were knowledgeable and very nice!  They were all beautifully prepared.", 
    "5.0", 
    "Kaylin O.", 
    "Los Angeles, CA", 
    "192", 
    "858", 
    "montiel-barcelona", 
    17, 
    [
        "Mediterranean", 
        "Spanish", 
        "Gastropubs"
    ], 
    3
]