[
    "Beautifully appointed, modern, trendy restaurant in the Born neighborhood.  On our last evening we decided to celebrate with our friends, Argentine expats living in Barcelona, with some traditional Argentine fare.We started with appetizers, Provoleta, usually grilled, similar to Haloumi, but served here in a clay cassoulet, with chimichurri or sun-dried tomatoes, was a big hit at the table.  The Empanada de Pollo, was tasty and savory, and warm goodness filling your stomach.Parrillada, again, not served on the traditional tabletop hibachi grill, but plated.  Tasty, and grilled, as ordered.Tagliatele con Camarones, beautiful dish, generous pasta and prawn portions, stacked in a shallow bowl, almost too pretty to eat.  Almost...Ravioli de Espinaca con Bolognese, this is the one dish that disappointed, Argentines are very particular with their pasta, and this just didn't meet the expectations.  Sorry guys, it just doesn't do it for this crowd.Entrana, I don't like my meat rare.  In fact, anything more than a sliver of pink showing through my steak, is too much for me.  And why do servers constantly argue with me for this?  I don't care if its' the 'proper' way to enjoy meat or not.  I like my meat well done.  While the portion was generous, and the cooked part, delicious, it wasn't cooked through and I left about a third of it behind.  Restaurant staff, please listen to your patrons, it will be much better for everyone involved.Cuba Libre con Havana 3 Rum, and Pineapple juice with Havana 3 Rum.  I wish we could purchase Havana 3 Rum in the US.  This Cuban spirit was smooth.  Very smooth.  It would do well stateside, especially with the current craze for Rum drinks.The prices match the locale and the neighborhood, so be ready.  Go for the meat dishes, stay away from the pasta.  And have plenty of rum.  Buen provecho!", 
    "4.0", 
    "Gianna A.", 
    "Boynton Beach, FL", 
    "134", 
    "350", 
    "morelia-barcelona", 
    7, 
    [
        "Argentine", 
        "Mediterranean", 
        "Steakhouses"
    ], 
    2
]