[
    "I LOVE THIS PLACE!This has got to be on the top of my list of places to go at night. Too bad it is in Barcelona rather then my home Toronto.This place is divided into 4. One being a wine bar for the more quiet and intimate. The focus only on wine. The next is the actual bar itself where they server small tapas and their own craft brew. This is also the waiting area to be seated for dining. The staff are very nice during the waiting process and some how remember who you are without even taking your name. Left of that is the main dining area where you simply sit, order and eat. And finally there is their store where they sell their own cool beer related products. They also sell their own beer and a special 1L bottle with a special case so you can take home. They pour it fresh from the tap, cap it and label it for you. They also sell knickknacks and great souvenirs. As for the food, they are very unique. Typical hipster joint. One dish I complete will never forget is the seafood platter. It's a 2 tier platter with enough seafood to fill up 4 people. One thing on the platter that never existed in my life was the Goose Barnacles. What the heck are Goose Barnacles? I found out that they are little snail like creatures that leech off of the side of the piers. I'll never find those again in Canada =(The staff are fast, friendly and interesting. Their uniforms are car mechanic onesie suits with matching shoes. Looks like they are all on duty to go fix the next set of cars at a automotive factory.If you ever get a chance to go here, go to the washroom. You'll be walking towards some very trippy flooring. Clear glass floor that shows the spanish ruins underground. it's eerie but very interesting. It leads you down to their basement where they have a separate room for private events and their brewing factory. You see the giant tanks and their beer being brew live.Oh and for the boys washroom, don't get confused by the urinals. They look like sinks. So don't be washing your hands in the urinal =)Overall, best place ever. Love the crowd, atmosphere and service.They have another location in the U.S. so hopefully I'll be able to hit up this place again some time soon.", 
    "5.0", 
    "Kenny L.", 
    "North York, Canada", 
    "380", 
    "78", 
    "moritz-barcelona-2", 
    2, 
    [
        "Seafood", 
        "Tapas Bars", 
        "Beer Bar"
    ], 
    2
]