[
    "It possible to go to Barcelona and just do tapas tapas tapas and tapas. But this would be a mistake.Sure there are plenty of good tapas restaurants and a million tapas to try.However one of the most crowded and justly popular places in Barcelona is this old beer factory - Fabrica Moritz.Fabrica Moritz is frankly a magical place ... and it doesnt hurt that the food and the beer are absolutely top notch.The end of the review has the kicker .... but lets talk food and beer first.They have tapas and they do have wine and sangria for those people for whom nothing but the spanish stereotypes will do.But you are there for the beer - and for their very original house take (recipes only to be found in their kitchen and nowhere else) - on the dishes found in the rest of the world.Moritz makes three kinds of beer - a lager an amber and a dark - and frankly the stuff they sell in bottles - or on draft at their customers' establishments is nearly undrinkable.However the different between what they serve in the bottles and what they serve in their home brewery is like the difference between dead and amazing.Their Epidor served in their home brewery is one of my favorite beers of all time - and it does not travel - even across town.Their menu is gargantuan; you could eat there for months without repeating a dish.Their Catalan variation on an Alsatian choucroute (Spanish rather than German sausages - and this is a huge upgrade) is a total winner.Their breakfasts and their coffee are superb.(They have very interesting and exotic toppings for fried eggs)(Plus the place is nearly deserted for breakfast - and they have great wireless.This is one of my favorite places to work in the city during the day.)They have lots of excellent fish dishes - and killer mussels.Now what's the kicker?The place is in an old 18th or 19th century brewery with an incredibly baroque structure. Staircases winding into nowhere - rooms going off at crazy angles. The place is huge and each separate part of the building has its own complexities.Inside this maze - and the building really is a maze - is the basement which is can be seen from various places in the brewery including the upper stories .the basement is one of the strangest places on the planet.it is a three dimensional hall of mirrors,  pyramids, lighted plinths in golden amber light reminiscent of beer, glass floors over cryptic depths that dive down a yard below your feet, glass floors over cryptic depths that dive down huge distances below your feet, catacomb entrances, vaults to the roof, windows on the brewery vats themselves, and one of the oddest but prettiest bathrooms i have ever used.the basement is as hallucinatory as a 60s acid trip - but it is beer themed and catacomb themed.the mirrors and the pyramids make the vertical horizontal, make the horizontal vertical, toss everything you see into a 90 degree skew, or toss everything you see into a 180 or 270 degree skew. Then the floor seems to cave away under your feet while you look left and right into vast distances that might be up down or sideways.and this is where you have to go if you need to use the john - and you are already drunk from the beer.add terrific and highly original food -and beverages you are going to want to drink a lot of -and you can see why barcelonans love this place.this is an experience not to be missed - and one that rewards multiple return visits.", 
    "5.0", 
    "Samuel C.", 
    "Austin, TX", 
    "48", 
    "379", 
    "moritz-barcelona-2", 
    12, 
    [
        "Seafood", 
        "Tapas Bars", 
        "Beer Bar"
    ], 
    2
]