[
    "Great food with a great view! And don't forget to do a little shopping before and after if that's what floats your boat.There's a large circular building (blanking on the name) but it's near the 'magic fountains'.  Every Thursday, they have this fountain show with lights, water, and music (think Bellagio fountains in Las Vegas).  The restaurant is located in what used to be a stadium and was converted into a massive retail and dining venue - honestly, I was very impressed with the building conversion (I come from a development background, so I geek out a little when it comes to this stuff). The go-to place is the sky deck where you get an amazing view of Barcelona.  I stumbled across Mussol by just walking through the different restaurants and seeing the menu.  This one had seating outside and a decent price, so Mussol it was!  We were seated immediately to the outdoor patio area (NOTE: customer service really isn't a concept like in the US, so I won't be too harsh).  I was traveling with my family throughout Europe, so we ordered a half pitcher of the Sangria (~15 Euros) - definitely cheaper than getting per glass.  It was made well, but a little watered down in my book, the sangria could have used more red wine.  Now on to the most important part, the food.  I was really craving some sort of meat, so I ordered what was titled a \"lamb burger\".  In the US, it's a patty with at least 2 buns in between but what I got was like a patty (almost like meatloaf), roasted vegetables, and fries.  The patty had an interesting gravy sauce on it but the fries weren't that good (USA you win this one!).  I wouldn't say my dish was amazing but it was good.  What I really enjoyed was another dish I tried, a meat sampler - it has an assortment of different meats from lamb to chicken.  That dish was really cooked well.  Overall, it was a good restaurant experience with good food and great views.", 
    "3.0", 
    "Todd N.", 
    "Los Angeles, CA", 
    "319", 
    "433", 
    "mussol-barcelona", 
    2, 
    [
        "Spanish", 
        "Catalan", 
        "Brasseries"
    ], 
    2
]