[
    "Where does the time go!?  I feel like we just returned from the beautiful city of Barcelona yesterday! Unfortunately, that's not the case and I am super behind on my reviews!  Oops!  I'd like to preface by disclosing the underwhelming feeling I had leaving 85% of restaurants in Barcelona.  As a United States native, I am aware of the stigma Americans get for being narrow-minded in regard to other cultures.  However, I feel I truly do my best to learn, understand and appreciate as many cultures as I can.  I don't know where along the path I dropped the ball, but when it came to Spanish cuisine - I will be the first to admit - I missed the memo that every restaurant would be serving the same variety of tapas/pinchos just on different platters and sometimes at different costs.... with the exception of one restaurant in L'Eixample called \"NAPA\".  And here's how we discovered it ... After an exhausting day of sightseeing, my husband & I reluctantly got ready and hit the streets of Barcelona to celebrate New Year's Eve.  Without a plan in mind, but \"hangry\" tummies on the line, we passed far too many dining opportunities and started to become discouraged.  Not but a couple minutes later, my husband pointed out a sign across the street that simply read \"NAPA\".  I asked him \"Could it be? Could it be Napa as in California 'Napa'?  Like, American Napa??\"  It didn't take but a few more steps to recognize the grapes etched on the streak-free glass doors to confirm we finally found a place we'd both enjoy!  Like many other restaurants in Barcelona, NAPA displayed the evening's menu outside the restaurant: Starter:  Crab-Stuffed Avocado Roll   -YEPFirst:  Grilled Lime Shrimp Skewers   -YEPSecond:  Peanut Butter & Jelly Foie Gras Bombons   -YEPThird:  Iberian Bacon-Wrapped Scallops with Sweet Pea Puree   -YEPFourth:  Miso-Marinated Alaska Black Cod with Wakame Seaweed Salad   -YEPFifth:  Steak Sirloin with Truffle & Trompetas de la Muerte Sauce   -YEPDessert:  Housemade Cannelloni   -YEP... Using the menu as a fair foreshadow, no one had to ask me twice to try it out!  I gathered NAPA to be a New American concept fusing the likes of fresh Californian ingredients with traditional Spanish/Catalan family-style cuisine (aka:  best of both worlds) and they proved my theory to be correct!     The trick was to see if they had room for us.  Sure enough, we arrived late enough that after a very short wait, we were seated in their cozy main dining area.  We were greeted right away with a warm, creamy Truffle Risotto amuse bouche!  It was lovely and everything I needed!  Honestly, all courses served featured the perfect balance of flavors from both cuisines to satisfy my 'wanderlusting' palate!  #happygirlBut the food wasn't the only aspect of NAPA that harmoniously fused American & Catalan ideologies... and we have the owners to thank for that!  The female owner is American and the male owner is Catalan.  Around 11:50pm, the female owner dropped off party supplies and a plate of 12 grapes.  Adam & I chuckled because we had no clue what this was for!  We hoped maybe NAPA turned into a club after midnight.  Haha.  Moments later she returned with the male owner who educated us on the Catalan tradition of consuming one grape per second leading up to the turn of midnight.  They explained the wanted to stay true to all NYE traditions... and attempting to do it all made for the best comic relief for both us and the young German couple we met in the restaurant.  So how did we ring in the New Year?  Wearing brightly colored masks on our face, a glass of champagne in hand, and a mouth-full of grapes barely allowing our lips to kiss at the stroke of midnight, aside the most hospitable group of service staff ever!   In conclusion, if you too want to experience the flavors of Catalonia but with a wider variety of plates, head to NAPA next time you're in Barcelona.  I can honestly say - you will not be disappointed!", 
    "5.0", 
    "Ann F.", 
    "Denver, CO", 
    "79", 
    "230", 
    "napa-barcelona", 
    1, 
    [
        "Tapas/Small Plates", 
        "Catalan", 
        "Tapas Bars"
    ], 
    2
]