[
    "Um, wow. Just...wow. I'd always thought Los Angeles had the best sushi out of all the places I've sampled it in, but no. Barcelona has completely redefined my sushi expectations. All of their food is pure culinary magic, but their seafood is something else entirely - the stuff of foodie dreams. Excuse me, I'm getting a little teary with nostalgia.We actually found Nomo by accident. We were cluttering along the beautiful streets of Barcelona, on our way to another sushi joint. My friend and I, along with her boyfriend (who's a bit on the picky side, although he denies it...bless him) realized we were lost and asked a friendly local for directions. He told us where the place was, but helpfully added there's another great place just a few doors down from where we were standing: Nomo.We graciously accepted his advice and headed to Nomo instead of the other place. And we were so glad we did! The interior had us sold - beautifully dark and modern, littered with baby bonsai trees and a rainbow of sake bottles. To order your food, you simply stick numbered magnets (for quantity) onto a board with the number of whatever item you'd like. It was very innovative. So even before we ate, we were finding reasons to love Nomo.But once the food arrived, that was when we really fell head over heels. We ordered a complete buffet of incredibly fresh and expertly sliced sushi. Rainbow rolls, spicy tuna, toro, salmon, yellowtail, and some of the best eel I've ever had the pleasure of eating. My friend's boyfriend got a cooked steak entree and actually finished it (you don't understand how happy it makes me to see a light eater finish something). My family and my best friend loved it too. The staff was super friendly, and the owner even chatted with us.Great food and great experience. If you're ever in Barcelona and appreciate sushi, make sure to stop by Nomo. I will definitely be back someday!", 
    "5.0", 
    "Natasha D.", 
    "Los Angeles, CA", 
    "650", 
    "283", 
    "nomo-barcelona", 
    7, 
    [
        "Japanese"
    ], 
    2
]