[
    "Onna cafe is one of the few outposts on the speciality coffee scene in Barcelona. In Spain and Catalunya, as in many southern European countries the coffee quality is horrendous (low quality beans, usually a lot of robusta). Among the average consumer there is no willingness to pay more than something like €1-1.5 for a cup and that of course makes it difficult to deliver high quality coffee. The lack of quality coffee has often been one of my main dislikes about Barcelona but something is really changing here. There are a few places that are doing a pretty decent job of it. Onna is one of them but on the list is also the 'veteran of the bunch' Satan's coffee corner, Nomad Coffee, True Artisan Cafe and Skye Coffee. Most of these will be reviewed in coming coffee Monday posts.[gallery size=\"large\" columns=\"2\" ids=\"1294,1295,1299,1304\"]Back to Onna though, it is in the fancy neighborhood of Grácia. On a small backstreet and I would not just have stumbled upon on it but I am glad I went looking for it. The place is not big and it has been packed with people on my visits. They do however somehow manage to keep the service fairly quick, and it is usually possible to find a table or seat somewhere. There is also free wifi so it is possible to sit and slack here for a longer time but be prepared that it will be full.The staff are very friendly and are passionate about coffee in general and Costa Rican coffee specifically. All the coffee served is from Costa Rica as are the staff and owners. It is a nice concept and while I do not want to have Costa Rican coffee everyday it is a nice niche.They offer well-executed espresso based beverages. They are not world class but very good and looking at the competition in Barcelona they are awesome. The filter coffee selection varies between two to four different Costa Rican coffees and it is also possible to select the method. I would recommend the Aeropress as it has been the best cups I have had there. The V60 is in general more tricky and quality varies more but even when on the V60 it has mostly been very good here. They source their coffee directly from Costa Rica and they also roast it themselves.There is a nice selection of pastries, light dishes and sandwiches. Food is decent but to be frank I do not come here for the food (it is not bad but I have other places I rather go to in Barcelona for food) so would stick to coffee and some pastries.", 
    "4.0", 
    "Mathias H.", 
    "Stockholm, Sweden", 
    "201", 
    "869", 
    "onna-coffee-barcelona", 
    4, 
    [
        "Cafeteria", 
        "Vegetarian", 
        "Sandwiches"
    ], 
    1
]