[
    "KenScale: 7.5/10Pakta is a project from Albert Adria of ElBulli fame showcasing the \"Nikkei\" cuisine, a fusion between Japanese and Peruvian cuisine. A somewhat random combination, but historically, many Japanese people emigrated to Peru beginning in the late 19th century. Both Japanese and Peruvian cuisines have very high standings in the world's culinary pyramid, so I was very excited to see what the kitchen (led by Peruvian chef Jorge Muñoz and his Japanese counterpart Kioko Ii) will bring. Unfortunately, while the food wasn't bad at all, I'm not sure my dining experience would be in the realm of memorable.There are only two tasting menu options at Pakta: shorter Fujiyama course and longer Machu Picchu course. We opted for the shorter one, which started with an assortment of dishes from tamago-dofu with salmon roe to horse mackerel to kumquats. They were pleasant enough, followed by market fish that was also OK. A couple of nigiri pieces followed, of which I preferred the salty fresh anchovy. Tuna tartare with yucca chips was also serviceable. The best dishes were the sea bass ceviche with fresh green almond \"leche\" that had very interesting, milky flavor, as well as the pork jowl sandwich that worked wonderfully with the pickles inside. On the other hand, the suckling pig Xiao long bao (steamed bun) was confusing (why a steamed bun in Japanese cuisine, and I didn't taste any suckling pig inside), as was cancha chulpi soba whose texture was funky and not necessarily in a good way. Grilled chicken is the predictable chicken skewer (although it was nicely cooked), and rock fish with \"escabeche\" Nikkei sauce was a bit over-seasoned. Desserts came in a variety of fruits, and they were in general delightful. Overall, I felt that compared to the concept and technique that the kitchen is employing, the execution and overall satisfaction level feel short to my expectations.The restaurant has a dining area as well as a bar area with modern Japanese settings. Getting a reservation wasn't particularly hard, but the restaurant was nearly fully booked in the course of my meal. The restaurant has full bar, with some Asian-inspired cocktails, but I would stick with wine (I'm always a bit wary of trying cocktails in Europe when New York has so many places that make incredible ones). Overall, I liked the concept of Pakta, and the dining experience was meaningful in a sense that it was my initiation to Nikkei cuisine. Pakta, however, also made me feel like it is probably a good idea to stick with classics when dining in Spain instead of some fancy marriage of different cuisines.", 
    "3.0", 
    "Ken S.", 
    "Manhattan, NY", 
    "204", 
    "356", 
    "pakta-barcelona", 
    3, 
    [
        "Nikkei"
    ], 
    4
]