[
    "So we dined here on July 19th, 2015.  To be honest, I'm still unsure if where we dined is the same restaurant that everyone else has reviewed.  We ended up at the address that Yelp lists, and there is an restaurant with just the name \"Alfonsina\" on the outside and on their menu.  We walked in and I kept comparing the Yelp pics with the surroundings and while structurally, they matched up, there were notable differences - e.g., no tile floors / instead wood floors, and brick walls, but fully bricked, instead of the part-brick/part-stucco that's in one of the pics.  But like the reviews say, there's a teeny-tiny bar area when you first walk in, but opens up to a nice-sized restaurant at the back.  So we stood around looking like confused idiots and finally asked if this was an Argentinean steakhouse and when the hostess replied \"Ci\", we just decided to go with it.  We are 99.99% sure this restaurant changed ownership recently.  They are still an Argentinean steakhouse, but the website that's linked in Yelp is not accurate and does not belong to the Alfonsina we ate at (which is probably why I didn't receive an email or text confirmation when I made a reservation online...) - So finally, on to the review!The menu seems to be VERY similar to what was offered before.  We had the pleasure of being waited on by (I believe) the owner, and while he spoke little English, we managed well - He was a true and complete delight!  He even warned us when he felt like we were ordering too much food, which he would have been spot-on about.  Unlike the old restaurant, this one does not serve pasta, but they have a grilled veggie started that's HUGE and DELICIOUS, so I ordered this - Comes with grilled eggplant, sweet potato, zucchini, asparagus, and a couple of baby potatoes.  The hubby ordered the rib eye, medium-rare.  We also partook in a lovely bottle of Malbec.  You will receive complimentary rolls and chimichurri sauce.  The chimichurri sauce is to die for good, and combine it with the soft, dinner rolls (a very nice break from all the hard breads) - You will be in heaven.  Hubby reports his ribeye was extremely good (he ate all of it, which is rare) - and stated while the the meat was more 4-star worthy, the service we received makes it a 5-star experience.  We also ended up ordering the tiramisu - While it was tasty, I think it was a store-bought brand that had been de-thawed a bit too much - the bottom layer was soaked with water.So while this may not be the Argentinean steakhouse of previous reviews, you should absolutely make it a point to check it out!  And if you're worried about a vegetarian dining companion, don't be - Their grilled veggie plate will leave them stuffed and smiling.", 
    "5.0", 
    "Helen C.", 
    "Oklahoma City, OK", 
    "12", 
    "110", 
    "parrilla-alfonsina-barcelona", 
    1, 
    [
        "Argentine", 
        "Steakhouse"
    ], 
    2
]