[
    "If you don't make it to Pinoxto during your visit to Barcelona (and La Boqueria) you are doing it wrong. The first day my boyfriend and I arrived in Barcelona we walked over to try and grab some tapas, to our surprise they were completely sold out of food by 2:30pm on a Monday, so come on the early side and grab a seat in order to experience the splendor that is Pinotxo! That being said we knew we had to make it back and scheduled our second day in Barcelona around eating at Pinotxo. We arrived around 1pm and still had to wait, but it was worth every minute because once we were seated we had a really great time. We lucked out and got seats near Juanito's section of the bar and though his English wasn't excellent he still steered us in the right direction. He started off by asking us what we liked \"Carne or Pescado\" and we opted for the fish route. He then walked over with a tray of what was fresh or the day which at the time had squid, clams, lobster, langustine and two types of shrimp. We opted from the larger shrimp and waited patiently. He came back shortly after yelling out our order to the chef and asked us what we'd like to drink. I snagged a glass of white wine (and actually he set a whole cold bottle of white in front of me and let me pour as many for myself during my meal as I saw fit) and my boyfriend ordered himself a caña. We are a little bit obsessed with garbanzo bean dishes (I feel like they are severely underrated when done right!) so of course we ordered theirs. The dish itself was excellent and very flavorful. It clearly had some morcilla (Spanish blood sausage) but it wasn't over powering and I think even the more discerning palates would enjoy this dish as it was both well seasoned and had nuances of thyme and other light herbs. When we finally got our gambas we were blown away. For something so simple, they were executed perfectly. They were probably the most perfectly cooked shrimp I've ever eaten. Just perfectly snappy, tender-- but not chewy and when you twisted off the head there was still plenty of that salty delicious 'liquor' left inside for you to slurp right up. Overall it was probably one of our more expensive meals in Spain (35 Euros) for just two items and some drinks, but the experience was well worth it and I'd go back again in a heartbeat if ever given the chance. Go for the food, stay for Juanito and the fun experience!!", 
    "5.0", 
    "Siobhan F.", 
    "Sunnyvale, CA", 
    "171", 
    "944", 
    "pinotxo-barcelona", 
    7, 
    [
        "Spanish", 
        "Basque", 
        "Tapas/Small Plates"
    ], 
    2
]