[
    "We went to the famous La Boqueria Market to check out Pinotxo Bar. This tiny bar counter located inside the market doesn't look like much but it has been showcased in a number of publications worldwide including Food &amp; Wine and the New York Times. Once we actually were able to grab some seats (there are only about a dozen stools present so expect to wait a bit), I was ready to dig in. Upfront, it amazes me the quality of food that comes out of a space that small. The pictures probably don't do it justice enough. Every tiny inch of space is used to its maximal capacity. Somehow 5 cooks and the owner, the very jovial fellow in the pink and blue vest, fit and crank out great stuff.First up, a chick pea salad with some garlic, parsley and a few other spices that I didn't catch as the owner who ended up serving really doesn't speak English. Amazingly fresh and flavourful, I am really not a chick pea fan but this dish turned me around. The chick peas were cooked to the right consistency and the mix of spices and herbs really enhanced their natural flavour. Great starter.Next up, a plate of snails cooked with a mixture of tomatoes and garlic amongst others. Once again, great combination of freshness, texture with simple but strong flavour. I have never eating so much snails at one time in my life and it was great to try them in a preparation other than one involving tons of garlic butter.Following that, we got a plate of fresh grilled squid with some chick peas, olive oil and a balsamic vinegar reduction. The squid was perfect, the chick peas provided a nice earthy balance to the squid and the balsamic added a nice touch to the whole time. Great plate of food.Lastly, we went with fresh langoustines boiled, slightly grilled and with garlic butter. Simple but perfect overall. As was true throughout my time in Spain, the seafood was amazingly fresh and of high quality, so the natural flavour of the langoustine shone here beautifully. All in all, a great experience that I highly recommend anyone who goes to the market check out. I don't think you will be disappointed.", 
    "5.0", 
    "Michael P.", 
    "Montreal, Canada", 
    "46", 
    "113", 
    "pinotxo-barcelona", 
    44, 
    [
        "Spanish", 
        "Basque", 
        "Tapas/Small Plates"
    ], 
    2
]