[
    "Oh, Pinoxto...why did I leave you to my last day in Barcelona? I would have gladly eaten at your cute booth 5 days in a row, although I suppose destiny saved the best for last. Ok, I'll stop being dramatic now, but if you're in Barcelona, come to Pinoxto for your first meal (and last...and a few inbetween). You won't regret it.Everything at Pinoxto gets 5 stars. Service was flawless. We felt like we were having dinner at an old friend's house. The small staff make time to have fun with their customers, despite being busy in the kitchen. We got lots of winks, laughs and smiles from the crew throughout our lunch. Ambiance and decor also gets 5 stars. It's a prime location, right at the entrance of Boqueria. You get to people watch, see your food get made and interact with everyone at Pinoxto. Food also gets 5 stars. Fresh ingredients, beautiful presentation and simple cooking in the best way. We got the Chickpeas (6 euros), which were tender and full of flavor from the garlic, parsley and spices. I've come to realize that my favorite foods are made from chickpeas...hummus...falafel...I digress...We also got the Baby Squid (12 euros), which were sauteed with small cannellini beans and topped with a light balsamic glaze. Baby squid make me happy. Bite-size, tender, a bit chewy with a pop and healthy! I can't eat veal or lamb because...I know they are babies...but I eat baby squid :/. I'm sorry conscience...I just can't resist!Our last dish was a plate of four Langostinos (18 euros), which were steamed and finished off with a dash of garlic and olive oil. They were incredibly sweet with a bit of that salty ocean taste. They are prickly little things, so be careful pulling apart the shell! It's a fun dish to order since you really get to work for your meal, but trust me, it's worth it.Get a glass of cava (3.50 euros) or whatever floats your boat and enjoy a leisurely meal at Pinoxtos. The bread (1 euro for your entire party and unlimited) that is lovingly tossed on your place-mat is top quality and perfect for mopping up the savory sauces from your dishes.", 
    "5.0", 
    "Lauretta L.", 
    "Los Gatos, CA", 
    "226", 
    "471", 
    "pinotxo-barcelona", 
    42, 
    [
        "Spanish", 
        "Basque", 
        "Tapas/Small Plates"
    ], 
    2
]