[
    "Very Busy little bar located in the Boqueria Market. Seating is very limited, as the bar only seats about 15 people plus 4 little hightop tables on the side that seats 2 people each. The owner and the staff is very good at seating people as you walk up, make sure you stand behind someone seated so the staff is aware that you are waiting. Once you make it known that you want a seat, they will point to you the seats that are opening soon and you just stand around and wait until those patrons are done.My husband and I arrive around 12:15pm and it was so packed but we only had to wait about 15 minutes and were seated. Of course there were those people that tried to take our seats but the staff made sure we got them. So make sure the staff knows that you are waiting!!!We ordered:Snails- very light with the sauce coated on the outside. They give you toothpicks to pull them out. We were told to put the whole snail in your mouth to get the flavor on the outside, and then pin and pull them out afterwards. It was light, fresh and yummy!Croquetes- There were 3 different types, Ham, chicken and cheese. We decided to try the Ham Croquetes and it was OK. It was kind of plain and mushy.Grilled Prawns- There shrimps were very fresh. So fresh that they tasted like they were still alive. Could have cooked a little bit more. seasoned salt on the topFried Artichokes- This was the first time I ever tried artichokes fried. it was different, and a bit salty. Tasted and looked a little bit like fried onions.Fried Octopus- it was seasoned with olive oil & salt served with some lettuceVenison (Deer) Kebabs- The meat was very juicy and tender but it was very plain Lamb- The lamb meat was covered in batter and fried that was also very plain.They put a lot of seasoned salt on top of all of these dishes AFTER the food has been cooked so it made some of the dishes very salty. I also had a glass of cava and husband had an aqua. We paid 65Euros for our meal. It was a good experience and expect to have people rub and stand against your back as they hover around you like Vultures for your seat. Great experience but not Amazing.", 
    "3.0", 
    "Lisa M.", 
    "Orlando, FL", 
    "21", 
    "40", 
    "pinotxo-barcelona", 
    79, 
    [
        "Spanish", 
        "Basque", 
        "Tapas/Small Plates"
    ], 
    2
]