[
    "Pintxo is Basque for spike, thanks Wiki!We didn't have anything that was held together with a toothpick, but Pintxo at the Boqueria was one of our favorite meals in Spain. As seen on No Reservations, this place was always packed. It was by sheer luck that the first time we walked by, two seats at the small bar opened and we swooped right in instantly. Ordering is simple, just point at what you want, or ask, they speak English. They have a lot of food in the display case and they're constantly cooking new things. In the 45 minutes we sat there, we saw a number of new items come out.We started off with one of each of the three croquettes they had; cheese, meat, and other meat. All were hot, crispy, and filled with good times.yelp.com/biz_photos/z-8N…Up next was hands down the best damn foot I've ever put in my mouth. I've had pig feet and pork knuckles before but none like this. It was finished on the grill but they must braise it for days. The fat, connective tissues, collegian, etc. were all melty and amazing. I couldn't get over how good it was and had to restrain myself from getting another.yelp.com/biz_photos/z-8N… I'm pretty sure feet have more bones than this but who's counting?yelp.com/biz_photos/z-8N…One of the things we saw them starting to cook when we arrived was a huge batch of little snails. As soon as we saw them we put in an order and mid-meal they were ready for us. Generally, it's not about the snails but the sauce that compliments the small bit of meat and the smaller bit of wonderfully bitter guts. Here the sauce was rich and packed with flavor. It was a match made in heaven.yelp.com/biz_photos/z-8N…Lastly was blood sausage. Unfortunately it came with stewed broad beans (I think), meh. The blood sausage was good, not great, and the beans were meh. The dish did however come with a handful of chunks of mini pork belly cubes to give it more fat. That was a nice touch.yelp.com/biz_photos/z-8N…Overall it was a great meal. I just hope they're around in a couple decades for the next time we're in Spain.", 
    "5.0", 
    "Eli G.", 
    "Los Angeles, CA", 
    "2886", 
    "1293", 
    "pinotxo-barcelona", 
    54, 
    [
        "Spanish", 
        "Basque", 
        "Tapas/Small Plates"
    ], 
    2
]