[
    "Walking through the Mercado de la Boqueria, you see all these wonderful sights of Spain: legs of jamon iberico hanging from the ceiling, rows of colorful fresh juices on ice, boxes of different kinds of nuts on display, .... and Asian tourists.  Asian tourists everywhere.  My boyfriend and I had a suspicion that a tour group was let loose for free time in the market. Pinotxo Bar was kind of a touristy selection for our first ever meal in Barcelona, but there was a reason why there was a long line to wait here.  You have to stake out a side of the counter, stand there, and swoop on the first seats to become vacant.  Sitting at the counter is most fun (I believe there are other seats at a side table), because you see staff cooking and scrambling around, and there is an elderly gentleman dressed in a satin vest, collared shirt, and dress slacks making everyone's coffee.Once we got a seat, my boyfriend and I ordered two cafe con leches.  The menu, posted on the wall, was completely in Catalan, so we asked what was most popular.  Most all of the dishes are out on display, ready to be served, or visibly cooking in the back.  We had a good selection, which set the tone for the very meat heavy diet we would be eating for most of our trip:Beef stew (they also had a tripe stew option) - so flavorful, with peas and potatoes.  Like an American pot roast flavor.Fried cod with ratatouille - the cod was not freshly fried and was a tad greasy.  The ratatouille gave it the flavor it desperately needed.Chickpeas - one of their most popular dishes.  Not memorable, but tasted fine.This wasn't the best meal ever, but I think it was one of the better selections for a sit-down place to eat at the Boqueria.  Great for people watching and enjoying the spirit of pointing to things and ordering them.", 
    "4.0", 
    "Christina G.", 
    "Walnut Creek, CA", 
    "42", 
    "204", 
    "pinotxo-barcelona", 
    4, 
    [
        "Spanish", 
        "Basque", 
        "Tapas/Small Plates"
    ], 
    2
]