[
    "Loved it. After 8 straight days of delicious tapas and fresh fish, my girlfriend and I wanted to try something a little different. This place was near the hotel and had a concept we both liked - all pork! Pictures and reviews seemed good so we headed over. It was a Tuesday night, we were one of only three or four tables. We speak enough Spanish to get by but the waitresses were all happy enough to talk to us in English and explain the cryptic menu. Conceptually speaking, it's everything I like: narrow and deep. That kind of attention to a single category nearly always offers knowledge that you can't find in a more generalist approach. And at a restaurant, that translates to more flavors and attention to detail. \"Pork, Boig Per Tu\" is a study in pork and they differentiate by regions of Spain. We had flavors there that were richer and more exotic than anyplace previous. Standouts for me were the Leon, from Bierza (cold cut) and the Morcilla from Tolosoldea (grilled over their wood stove). The pork belly was melty good and the ribs were moist and chewy and more defined of a taste than your typical barbecue. But in a way, the real treasure is discovering the tastes of Spain, some more bland, some more exotic, and not attempting to pull a favorite, all the while receiving an education in the varied approaches to preparation throughout the country. The singularity of it all being pork is deceiving in that way as the meat itself serves as a constant that allows flavor and preparation to take more of the stage. And while their wine selection is minimal, their regional approach to the meats puts most wine selections to shame. \"Pork, Boig Per Tu\" could exist seamlessly in the coolest areas of Los Angeles or Brooklyn and nobody would bat an eye with its artisan touches and home spun bread, signage and drinks. But while that somehow feels slightly inauthentic in a city so culturally affected by tourism currently, in fact, it felt more \"of Spain\" than much of the Spain I've encountered. And the irony of it all is that those particular flavors couldn't be replicated anywhere else. \"Pork, Boig Per Tu\" means\"Pork, Crazy for You\" and the phrase \"Boig Per Tu\" echoes the chorus of a Catalan song by the same name. Like much of Barcelona, it's quirky and different. And despite only being open for a few months, one of the places where I felt I really got to know the city. And my beautiful company didn't hurt either. :)", 
    "5.0", 
    "Josh R.", 
    "Santa Monica, Los Angeles, CA", 
    "78", 
    "5", 
    "pork-boig-per-tu-barcelona", 
    1, 
    [
        "Spanish", 
        "Mediterranean"
    ], 
    2
]