[
    "This was one of the best - and certainly the most intense - dining experiences I've ever had. We thought we'd get there right when they opened to beat the crowds we read about  and actually arrived 10 minutes before they opened doors. Sweet! Yet by the time they opened there were 8 people already waiting outside! I do suggest you get here early, as the place is tiny and fills up super fast.Do you have a walk-in closet at home? If you do...that is probably bigger than this restaurant. It's literally one tiny room with maybe 2 tall tables, a bar and another ledge on the wall to put plates down. You will be standing while you eat.The dishes are all tapas style - and you order by the bite. Salmon, yoghurt and truffle honey montadito is life changing. If you don't order anything else, get this! The salty and sweet mixed with the cream...I don't usually curse in reviews (I certainly do in real life) but holy shit these were amazing. I ended up ordering a second one. And really wish I had ordered a third.Mushroom croquette - the one bite I had was actually cold...but the wife said the rest of it was warm. Nice subtle mushroom flavor.Cured ham and tomato - this was the last bite I ordered and I'm not sure if I liked it or not. You see at this point I had already had two salmons...and it's hard to follow that. This was still solid, with some nice flavors.Langostino - prawns with greek yogurt and caviar over a roasted red pepper. Delicious as well!I washed it all down with a delicious beer. It's actually their own beer that they brew and it was solid. You can also get wine by the glass or bottle.Now the intensity in the flavors of the food - are paired very well with the intensity of ordering here. It's intimidating and it WILL give you anxiety. Basically there are 3 people behind the bar taking orders. Guests shout out what they want and they make them on the spot. Tracking orders? They have little notebooks and jot down everything you order by hand. NO IDEA how this is efficient. The problem comes when you are down with Round 1 - and want to order more...when do you jump in? Do you wait to get eye contact? Do you just shout it out? We waited a good 10 minutes between rounds...wondering when it was ok to order again - and we were right in front of them at the bar lol. It was intense - but a very unique experience I guess. It reminded me of being in an auction.Overall these were some of the most memorable bites I've ever had - and deff a highlight of our Barcelona trip. I'll recommend this place to anyone visiting - and be very jealous of anyone who lives in Barcelona and can go often.", 
    "5.0", 
    "Blue A.", 
    "Sunrise, FL", 
    "1471", 
    "798", 
    "quimet-and-quimet-barcelona", 
    6, 
    [
        "Tapas Bars"
    ], 
    2
]