[
    "I feel as though we stumbled onto a secret place with Recasens, so I - as per usual - grapple with sharing it.  But I'll be generous!  Here!  Go HERE!Recasens is a beautiful spot in the Poblenou District of Barcelona.  In December, arrangements of apples and winter squash and cabbage were put together as decoration, with tea lights interspersed.  So beautiful *tucks in mental filing cabinet for Thanksgiving decoration 2013*.Just beyond the tourist fray, Recasens, to hear it described by my Spanish friends, began as a deli, then expanded to a restaurant serving many of its goodies.  It is a delicious business model, with a menu centered around salads and big wooden boards of, to use North American trendy food speak, charcuterie.  Our table tried an orange salad with mint and pine nuts (lovely) and (even more delicious) a foie gras salad topped with fine shavings of the liver.  Not usually being a fan of foie, I was surprised by how regularly my fork returned to that plate: this salad was a perfect mixture of greens, and tart, and crunch, and fat, and sweet.  YUM DASH OH.  We couldn't have the board of meats and cheese (a selection of both Spanish favourites and others, with the stand-out being the white pork Catalan sausage) without some pan tomate.  Vine-ripened tomato rubbed on bread with some seasoning and olive oil?  It makes a great base for any and every kind of tapas, trust.With a bottle of wine, ample food for all, our bill came to 50 very affordable Euros for 4.  Affordable high-quality eats earns Recasens a 5 star two-forks-up rating from me.  Yelp note: seriously recommend making a reservation here.  It took me a good while to wrap my mind around the 9PM Spanish dinner time, and at Recasens there are two dinner seatings: 9PM and 11PM.  Keep this in mind - if opting for the earlier time-slot - you will likely need to limit your on-site schmoozing to 2 hours.", 
    "5.0", 
    "Alex S.", 
    "London, United Kingdom", 
    "60", 
    "449", 
    "recasens-barcelona-2", 
    10, 
    [
        "Mediterranean", 
        "Spanish"
    ], 
    2
]