[
    "Spectacular food with a great ambience. This is where you should go to in Barcelona and experience this incredible molecular gastronomy.My boyfriend and I stayed at Hotel Omm - amazing hotel, and the restaurant is just at the ground floor. We ordered Joan Roca Menu and it began with cucumber and tomato soup with olive sorbet. The next course was excellent - mackerel with the celery noodle just placed on the bottom. The mackerel was perfectly cooked and very soft, with a soft creamy flavor of the flat and thin noodle. Oxtail and Palamós prawn ravioli has got to be my favorite course in the menu. The prawn is perfectly cooked, I reckon it must be tricky to have it just perfectly cooked like such - accompanied with oxtail wraped in a ravioli. It was very delicious because it had the juice/liquid that is filled with the rich taste of the oxtail, and it was beautifully tender and words cannot describe how delicious it was. Wild turbot with the lentils cream and curry was a very interesting yet an excellent one - the accent of the curry was really the highlight of this course. It really gave it a kick because it was something different from the rest, let alone it was a great complement with the soft texture of the turbot. The duck with apple, cider and calvados was rich in my taste buds, working really well with the sweet sauce which was a great balance between the two opposing tastes; sweet and the savory taste of the duck. Lastly, we finished our menu with 2 delicious deserts; pear, lemon and thyme & chocolate, red fruits and flowers. For me, chocolate, red fruits and flowers is my favorite dessert which was served last. It was the perfect taste because it was the combination of chocolate and fruits, a little bit sour but mostly sweet, and the flowers which made the whole dessert have an earthiness sort of taste. Loved the presentation - it almost looked like a beautiful messy garden. The presentation alludes to the taste and definitely is a magnificent one.", 
    "5.0", 
    "Kun S.", 
    "Orchard, Singapore, Singapore", 
    "16", 
    "21", 
    "roca-moo-barcelona", 
    4, 
    [
        "Mediterranean"
    ], 
    4
]