[
    "Do not book on restaurantes.com! They sent a cancellation email 15 minutes prior to the reservation time.  We didn't get the email and showed up on time.  Luckily, the restaurant had a no show, and we were seated after about 10 minutes of waiting on whether or not they would give up the table.The restaurant is lovely.  Located in the back of the hotel lobby, behind the bar area.  The restaurant has an open kitchen, and a nice garden behind a glass wall.  Service was very attentive.  Our bread plate was often refilled, and my boyfriend and I even joked that we had to leave a little bite of bread on our plates so as not to receive a brand new slice that we didn't want.We ordered one of the tasting menus (the less expensive one).Raw mackerel dish was excellent and refreshingRavioli with shrimp, topped with foam and a fish head was rich and tastyCod was topped with popping boba that was filled with carrot juice - so cool!Suckling pig here was a bit rich for my taste, served with an acidic sauce and avocado puree.  We had suckling pig at Gaig, which served it with fresh strawberries.  I found that to be a better dish.Their golden egg dish was best thing ever!!  Gold colored caramel \"egg\" which you crack open to reveal a raw yolk over corn nuts.  Salty, sweet, everything wonderful in the world!!Cloud, guava puree and ice cream topped with cotton candy, was so delicious and beautifully presented - just like a cloud!Chocolate forest dessert was meh for me.  I'm not big on fudge, and this was a fudge dish with some fruits, purees, and ice cream.  It looked gorgeous, though.Tray of turrons for dessert were a good variety of fruit and chocolate flavors.The only downside was that it took about half an hour to get the bill because their computer was broken.  I'm not sure why we couldn't have just been rung up with manual math.  The food, however, was incredible.  Do not miss the Golden Egg!", 
    "5.0", 
    "Christina G.", 
    "Walnut Creek, CA", 
    "40", 
    "202", 
    "roca-moo-barcelona", 
    2, 
    [
        "Mediterranean"
    ], 
    4
]