[
    "It's just okay. They call themselves a Tex-Mex restaurant so that gives them a lot of latitude. First, they are playing samba and salsa music. No Mariachi music or any kind of real Mexican music. Second, a lot of reviews mention their mojitos. Mojitos are more part of Cuban cuisine. The food was decent overall. The service was poor to terrible. Don't let them sit you upstairs or you will be ignored. I ordered chicken in mole. Mole sauce was very good. Lots of chicken breast meat. The rice was similar to Rice-a-Roni style. Although the menu stated the dish was served with beans there were no beans. A side of beans was 1.5 euros for about 4 tablespoons. The side order of flour tortillas were 3 tortillas the size of a DVD. Another 1.5 in cost. We were seated upstairs and then waited and waited to order. I leaned over the stair railing to see the waitress yucking it up with a couple of guys. The manager (I think) saw me and sent her up. She didn't seem too pleased with me when she found out I spoke  English altough it turns out she did well enough speaking it as well. Luckily my wife speaks Spanish and the waitress seemed to be in a better mood when she heard that. After we finished we waited again for her to come back around to check on us. No sign of her. Again, I looked over the railing and she was laughing it up with two different guys. I got the manager's attention and he sent her up. The tip reflected the lack of service. On the way out she said, \"Ciao\" to us which was weird to me since this was supposedly a Mexican restaurant. Not adios or hasta luego or good bye. Overall this seems to be more of a place to get a cocktail. The entire first two pages are alcoholic drinks. The rest of the menu only has a handful of entrees. Seems more focused on appetizers. Besides no real Mexican restaurant charges extra for an order of tortilla chips. I would not recommend if you want authentic Mexican food.", 
    "2.0", 
    "Tony D.", 
    "Gardena, CA", 
    "1", 
    "7", 
    "rosa-negra-barcelona", 
    47, 
    [
        "Mexican"
    ], 
    1
]