[
    "I can't help but feel that I went to a different restaurant than some of the other reviewers. We walked to the restaurant from Born, and when we showed up at the front, we were approached by workers trying to convince us to enter the restaurant. The restaurant looks very similar to the terrible Italian-American restaurants we have in the US. There were pictures of the owner with locally famous people, or maybe they were just people. There were no labels, so I couldn't google any of them. The lighting was fairly dim, and the wood trim was dark. I started to get a bad feeling.We were seated at a 4-top in a corner. Bread and water was placed on the table (without us asking for it), and we ordered a bottle of the house wine and a salad for starters, and the seafood paella for 3. The salad consisted of 4 anchovies, an under-ripened tomato, and some cheese. It was bland, but OK. My bad feeling was getting worse.As I got to work on the salad on my plate, I noticed movement out of the corner of my eye. I glanced up, and there was a cockroach making its way down the wall and onto our table. I warned by wife, who moved faster than I've ever seen her move, and we called the waiter over as the roach proceeded to walk across her plate and onto my sister-in-law's plate. You could see in the roach's eyes that this was not his first rodeo. He was no longer afraid.The waiter rushed over and grabbed the plate to take it away, but the roach crawled up his arm and he lost it. He flicked the roach onto the floor, and then attempted to stomp on it. He missed. Instead, the roach took shelter under the table behind us, causing the group there to decide it was time to retreat. They left without paying, even though the wine had just been opened. In their defense, they apologized as they ran out the door. As for the roach, I'd like to think he and his friends had a good laugh.I no longer had a bad feeling. The roach had startled me numb. I knew we should leave. Every instinct I had was screaming to leave...except I had read the reviews on here, and this place was supposed to have the \"best\" paella. Against my better judgement, we chose to remain, and I will forever blame some of you for this. We were whisked upstairs to a lovely table next to open doors over-looking the sea. There were many open tables in this area, and I was a bit insulted that it took a cockroach crawling over our table to make us worthy of one of them. They brought out a new salad to replace the one the roach had dined upon, and some more bread - which again, we had not asked for. The paella arrived, and instead of placed the pan on the table for us to dig into, it was served on individual plates. It was also terrible. If this is the best paella in Barcelona, then Barcelona is not the place to go for paella. The rice was overcooked, the shrimp were overcooked, the prawns were overcooked...it was all overcooked. I can handle overcooked. What I can't handle is the fact that prawns and their antennae look incredibly similar to a cockroach when you have been attacked by one merely minutes before. We didn't even bother finishing it.The real kicker was the bill. It turns out that the bread costs money, as does the tap water served in a bottle. They also didn't take off any of the charges or offer to give any discount to account for the attack of heeby-jeebies we were still suffering from. You know it's bad when I can scare my wife days later by telling her my hand is a roach and running it up her arm. In all, the bill came to $105, and will most likely remain the most over-priced, unworthy meal of my life.Seriously, Yelpers...we need to establish some baselines. This is not a 4-restaurant. It's a two-star on a good day, and the roach took one of those stars with him on the way back inside the wall. Absolute tourist trap, and a bad one at that.", 
    "1.0", 
    "Stephen R.", 
    "Raleigh, NC", 
    "6", 
    "4", 
    "salamanca-barcelona-2", 
    33, 
    [
        "Seafood", 
        "Tapas Bars"
    ], 
    3
]