[
    "When visiting Barcelona, one must try the paella, we were told. But at times it felt like that advice came from some tourism pamphlet because literally every corner we turn, we find a restaurant or cafe that serves paella. So it was recommended to us by locals that Barceloneta is where we needed to go for the best paella in Barcelona, because of the fresh seafood that is available to the restaurants in this neighbourhood. But of course, almost all of Barceloneta is filled with restaurants with pictures of paella on the outside. And so, upon the advice of a local tour guide who absolutely loves Barcelona, we came to Salamanca. We're not entirely sure if there is seating inside, but there was a fairly large outdoor seating area, so that's where we sat down. They have a diverse menu beside their paella offering, but we were there to have paella. The paellas listed on their menu is not atypical - seafood, squid ink, chicken, etc. we opted for the seafood with shells off, plus a calamari starter. We wanted some cava, but apparently they only serve cava by the bottle and we didn't want to split a whole bottle between the two of us, so we just ordered water.The calamari came not long after the standard bread and plate of olives. I must admit this was some of the best calamari I've ever had. It was actually meaty and substantial unlike most of the calamari I've had. But then again I'm comparing it to the type of typical America bar plate of calamari which kind of sucks. The paella serves two and the waiter scraped it off the pan and served it in two plates for us.The recommendation that we received was true. This was the best paella we had on our trip, and we went to Salamanca on our last night, having spent a few days in both Barcelona and Madrid. One thing of note was that it wasn't overpoweringly salty like some of the paella we had. The seafood was fresh and aplenty. The rice was soft and smooth. Friends who have been to Barcelona will recommend trying the paella if you've never been to Barcelona before, and personally I would suggest you get yourselves over to Barceloneta, take a walk along the beach, and enjoy some delicious paella at Salamanca.", 
    "4.0", 
    "Radford T.", 
    "Downtown Flushing, Queens, NY", 
    "543", 
    "450", 
    "salamanca-barcelona-2", 
    23, 
    [
        "Seafood", 
        "Tapas Bars"
    ], 
    3
]