[
    "This restaurant has opened its doors to the public more than 40 years ago. I would argue that this is the best terrace in Barceloneta. There are other places in the neighborhood with better views. Besides, a while ago, like even 5 years ago and before, the place was less popular with tourists I guess, and their attitude, I'm not saying about the cooking and food itself, was much better and genuine.  We saw there more locals, especially senior gentlemen and couples. Now it's very touristic and like a conveyer, if you know what I mean: they just serve as quickly as possible without much attention or care to sit more customers. And the quality of food changed to the worse too. Especially that goes to their Paellas. We always ordered seafood Paella and what happened: you don't have much seafood there now, mostly rice and moreover, all the seafood they put is frozen and tasteless. Few shrimps, few mussels and a lot of calamari rings to fill the space and cover it... Why add fresh if people are coming constantly... Tourists, that never return, but who cares... They have good Octopus - Pulpo a la Gallega. But that's Spain, almost every restaurant has it and soft of course, it just can't be bad. Jamon iberico is Jamon iberico. But as for what they cook - I felt a lot the difference. They used to have delicious paellas, but not anymore. Still you'll get tomato bread and a small plate of cut salchichon while you're waiting for your order. And a complimentary limoncello in the end of the meal. But that's not what's for you come there. The wine selection is quite modest, except for \"vino de casa\" their house wine I mean, there are several types of Albariño and Rioja, while prices are quite reasonable.Good thing is they open all day long, you can come and eat late lunch or early dinner if you're not too picky and ambitious. We stroke out this place from our list of regular visits.", 
    "2.0", 
    "MT W.", 
    "Seattle, WA", 
    "80", 
    "193", 
    "salamanca-barcelona-2", 
    2, 
    [
        "Seafood", 
        "Tapas Bars"
    ], 
    3
]