[
    "After trying to get into Quimet & Quimet and discovering it was randomly closed for the staff vacation (this happens a lot in Barcelona in August, so beware) we had the cab driver just take us to a place where he recommended. This is how we ended up at Salamanca.Upon first impression, I would say this place feels touristy, but that is simply because it is on the beach and there are a lot of tourists. There are men working the people passing by trying to get them to come into the restaurant. If this doesn't bother you in theory, you may even get caught up watching them work their game. Damn, they are really good at reeling people into that place.We ordered some white wine which was nice, but over priced at almost 30 Euros a bottle. We had just as good bottle of house wine in other places in Barcelona for under 10 Euros- hence the touristy feel. The waiter, who was super attentive and friendly, recommended the seafood paella and so we decided to go for it. They brought out the finished dish as a whole and then took it a way to spit the dish for two people. It was MORE than enough food for two people- probably more like 3 people. The seafood was fresh and not fishy in that way seafood can get when it sits out too long. The best thing about the dish was the lobster, which was mouth watering. If I went back, I would just order the lobster paella and forget about the rest of the seafood.When we were finished with our meal, the waiter brought out little cakes and some sort of liquor on the house. It was a nice gesture. Our total bill for one bottle of wine and two servings of paella was almost 100Euros. Oh, we also saw, after perusing the bill, that they charged us for the bread that was served to us without asking immediately upon arrival. That always makes me feel weird. If you are going to make me pay for it, ask me if I want it. However, overall it was a very good meal, but we had other meals in Barcelona for half that price that were just as good. If you are a seafood nut, go here and get the lobster. If not, I say skip this place head somewhere where you will get more bang (or tapas, or wine) for your buck.", 
    "3.0", 
    "Carrie G.", 
    "Fort Lauderdale, FL", 
    "4", 
    "24", 
    "salamanca-barcelona-2", 
    42, 
    [
        "Seafood", 
        "Tapas Bars"
    ], 
    3
]