[
    "They have a patio overlooking the beach, but since I came at night, I went into the dining room which was quite formal. Many different patrons were dining in the restaurant, including a family with two small children who were casually dressed, and two very demanding Asian tourists who seemed to have mistaken Barcelona for Paris or Rome because they wanted French wine and Italian pasta in a Spanish restaurant. There was also a Spanish \"Godfather\" who ate in the corner table by himself, catered to by everyone of the staff members. He was served without a menu (no, he wasn't the owner) and he never looked up from his mobile phone aside from acknowledging the staff (yes, I was afraid to take a picture of him)!They served me sliced sausage as an appetizer gratis, and delivered tomato bread to the table. Even though I didn't really want it, I tasted it and I regretted that decision for two reasons, 1) it was nothing special, and 2) once I ate a slice, it was an additional Euro on my bill. They also tried to sell me a half bottle of wine instead of a glass, but relented when I said I could not drink that much, and they added a charge for bottled water which I never ordered. Even though I spoke some Spanish, they knew I was a tourist, so be aware of how they might pad the bill.I ordered a salad before my paella and was shocked at how copious it was when it arrived! It could easily have been shared by four people and the waiter graciously said in Spanish, \"Just eat what you can.\" I could have easily made a meal of this, with tuna, green and white asparagus, olives, corn, tomatoes, and romaine lettuce. I would recommend this for your meal if you want a light repast under 10 Euros ($12 USD).Silvestre, the owner, is known as a philanthropist giving away food to the poor and homeless who came to his restaurants. I ordered the mixed seafood for 18 Euros or about $21 USD. The calamari, clams, mussels and rice were addictive, but I found the langoustine and shrimp over cooked. I might order a mixed meat version next time so that the chances of overcooked shrimp would be eliminated. Nevertheless it was a good paella, not the best I've ever eaten, but certainly not the worst.A wonderful finishing touch were the complimentary limoncello and cake they served me before my bill, to sweeten the memory of my meal :)", 
    "3.0", 
    "Elaine T.", 
    "Paris, France", 
    "43", 
    "156", 
    "salamanca-barcelona-2", 
    3, 
    [
        "Seafood", 
        "Tapas Bars"
    ], 
    3
]