[
    "Okay, so I'm actually still sitting in the restaurant now as I'm writing this review. How? Free wifi (speedy too)! What a pleasant surprise! An automatic star, half for the wifi and half for the surprise. hehe. Back to the review. Having been visiting in Spain for a couple of weeks now, I'd have to say I'm all tapa'ed out. I needed something heartier, something of substance, rather than a little bit of this and a little bit of that. I wanted a meal, dang-it. Anyhoo, after about 5 mins. of meandering about, I stumble onto this place. I see burgers with brie, and I'm immediately sucked in. The ambience is fine. Nice decor. Filled but not too crowded. I sit at a table and notice there are purse hooks at the bar (thank you!). I sit down order my meal and sip my glass of wine whilst I wait. Not more than 7 mins. after ordering I receive a beautifully arranged plate. I ordered the Burger Completa, containing a huge thick cut, juicy and well-seasoned patty done medium, topped with grilled onions, proportionate slices of brie cheese, slices of bacon (served Spanish style, so not thick or crunchy as we like in the US), and a fried egg on top. No fussy bun or produce. Well, I ordered a side of veggies because I was feeling guilty about the heart-attack I was about to consume. The veggies weren't particularly memorable; they were simply gratuitous really (BTW, you have the option between french fries, rice, or veggies). Anyway, getting to the point. First bite... eye-rollingly delicious. Yes, De-lis-i-oh-so!!! Overall, not a single complaint. Note the patty was a bit salty for my taste, but I don't count that really as a complaint. Service is good, attentive but not overly so. Burger and glass of wine only set me back 12.5 Euro. In my heart of heats, I'd give this place a 4.5. But because we all know that half stars dont exist, I'll bump it up to a 5 so that the general average rating will be raised, because it honestly deserves at least a 4 rating overall. Hate me if you will, but I'm doing it. The end.", 
    "5.0", 
    "Iam B.", 
    "Milpitas, CA", 
    "0", 
    "7", 
    "san-telmo-barcelona", 
    1, 
    [
        "Bars", 
        "Tapas/Small Plates", 
        "Tapas Bars"
    ], 
    1
]