[
    "The vacation life is blissfully easy - your OOO message is on, currency starts to resemble Monopoly money due to the exchange (sometimes I'd rather not know, okay?) and your first glass of cava may or may not be consumed before noon.But finding restaurants that are open on Sundays in Barcelona? Not so easy.Undaunted by the challenge of finding fantastic fare our first evening in Barcelona, we put the Yelp app to the test and followed the moving blue dot on my mobile to a little restaurant in the Barri Gòtic neighborhood. Guess everyone else had the same idea, because Sensi was deliciously alive and kicking. Fortunately, they had exactly two seats left at the bar and my friend and I recognized the opportunity and zeroed in.The concept at Sensi is one that celebrates the old and flirts with the new. Though you can certainly enjoy classic Catalan tapas (we did), you can also try Asian-influenced dishes such as mussels swathed in a red curry, grilled prawns kissed by a mango chutney or Iberian pork tataki. Verdict: all are swoon-worthy, though I'd recommend staying away from the paella (a little birdie shared that it isn't made-from-scratch). And if they have the burrata that the local farmer delivers every morning, do get it! You'll find yourself making excuses to come back for the decadent cheese with a creamy center. It's no joke, friends!The vino tinto flowed (the house selection is excellent!) and we became fast friends with the handsome, disarmingly charming barkeep. We were also befriended by a married couple from Rotterdam who in the end seemed to be seeking new friends for a... how do I say it? A casual encounter. Um, no! However, the evening was still crazy and wild and spontaneous and fun by our good ol'-fashioned standards.Though Sensi is definitely more restaurant than bar, if you have the chance to sit at the bar, you will create your own nightlife! Just do it.", 
    "4.0", 
    "Jelena Z.", 
    "San Francisco, CA", 
    "5000", 
    "1732", 
    "sensi-barcelona", 
    59, 
    [
        "Mediterranean", 
        "Tapas Bars"
    ], 
    2
]