[
    "I first visited Sensi back in 2013 when there was only one location, now there are three: Sensi Tapas, Sensi Bistro and Sensi Gourmet Tapas. In 2013 I was immediately impressed by everything on the menu, especially the pulpo (octopus) which I think was the best I've ever had.Fast forward to 2015 and my wife and I arrived at Sensi Tapas. First strike was the manager refusing to speak to me in Spanish. I told him we wanted a table for two and then asked about the old Sensi location in Spanish, he responded brusquely in English. My Spanish does have a hint of gringo/Colombian accent, but I am fluent. I find it condescending and obnoxious to be treated like another tourist who is incapable of speaking in a local dialect just because I don't have an accent that is to his liking. He also came over and filled our glasses with the wrong wine that we had not been drinking and gave us a hard time when we pointed that out. Douchey manager aside, our waiter and service was great. Onto the food. We started with the Mushrooms in Crema Catalana which I found delicious, the mushrooms were mixed together with egg and had creme bruleé type crust on it. Next up was Duck Timbale, which was way too dry and flavorless. It also arrived cold when clearly it is a hot dish. The Paella was equally forgettable. They didn't have Pulpo as I remembered it, this time it was Octopus and Baby Eel layered with paprika vinaigrette. I really liked it, the baby eels kind of grossed out my wife but I loved their pasta-like texture. So, it was 2 out of 4 for the meals with good service excluding a douchey manager. I guess I'm not surprised. The old Sensi in 2013 had an undergound feel with only half the clientele being tourists, now it's closer to 100% tourists. When I'm back in BCN I might try one of the other locations, but I won't be coming back here.", 
    "3.0", 
    "Miles K.", 
    "Brooklyn, NY", 
    "59", 
    "91", 
    "sensi-barcelona", 
    9, 
    [
        "Mediterranean", 
        "Tapas Bars"
    ], 
    2
]