[
    "This place was so good that my husband and I went here twice during our time in Barcelona. We wanted to try as many places as possible but we just couldn't resist coming back.We first stumbled in here our first night in town. It was you, Yelp, that led us here. We were looking for a good tapas place actually opened on Sunday night. After some delightful seafood at a place whose name I can't remember (sad that I can't write a Yelp review, as we kind of stumbled upon it), we landed at Sensi.We didn't have a reservation so we waited 15 minutes, sipping some wine as we did. (All of this cheap and readily available wine was such a novelty to us Utahns. YOU DON'T UNDERSTAND.) We sat down at our table and looked at the menu. We were just going to order a couple of things, but saw we had to order a minimum of four. This was weird, but we just decided we'd be really full when we were done. It's all good. So, our choices: paella (I know...), suckling pig (finally! and in tapas format) and the chorizo and goat cheese salad because we thought they might be small. OH MY GOD.So that goat cheese salad was really good, but it was a salad. I can't say a whole lot. And suckling pig! My quest to eat this had been thwarted up until this point on our trip, and it was so tender and wonderful and the little bit of crispy skin was AMAZING. I wanted more, but i didn't want to be greedy. The paella was definitely the best we had on our trip. Perfectly seasoned with very fresh seafood. But the biggest surprise was the chorizo. It came out looking like a thing of cocktail smokies you would enjoy at your grandma's house while watching football (the American variety), so I may have underestimated it. But that rich, wonderful flavor. It was mind blowing. And then we came back on Wednesday night for our last meal in town. We got some of our favorites from last time (chorizo, paella) with some other delights. From fresh seafood (tuna tartare, sea bass ceviche, squid) to some Asian stir fry, to that wonderful duck they're so known for, it was a treat again. Excellent decision to come back. Our waiter from the previous night remembered us, even. I hope it wasn't because we were obnoxious Americans.Great service, fair prices, amazing food. Lots of English speakers here. It may be a tourist trap but I DON'T CARE. This place is supremely delicious and I already miss it now that I'm back home. That is all.", 
    "5.0", 
    "Monica T.", 
    "Salt Lake City, UT", 
    "273", 
    "536", 
    "sensi-barcelona", 
    45, 
    [
        "Mediterranean", 
        "Tapas Bars"
    ], 
    2
]