[
    "I was in Barcelona for a week and came here twice. I was sober for one of the visits.My man and I stumbled on Somorrostro in an attempt to eat in Barceloneta someplace less trappy than the waterside establishments. Please note the bar there - LESS trappy. Barceloneta is possibly the Mother Hive of Tourism for All Nations, and if you are there, this must be at least partially embraced. However, we hoped that by going down some smaller streets, we might find someplace that served tourists without pandering to them with picture menus in ten languages and taking all their poorly counted Euros.  The place is small, but very comfortable with windows open to the air, though no seating is outside. It is Tapas - what is not in this neighborhood - but we chose it for it's wider menu (read: things we didn't recognize at all/not paella). The wine, as usual, was very fairly priced, and we ordered several waves of tapas including the Duck Ceviche and the Veal Roast (I forget it's exact name, it comes in a little cast iron pan with some variety of onions and potatoes. This description is underwhelming and unfair - it is a delicious, savory, umami dish, and we scraped the pan clean. The dangers of ingesting iron flakes were mitigated by the sheer flavor experience. We were so thorough,  I doubt it even had to be cleaned afterward). These two were definitely the highlights. I got sea snails for the kicks, and thought the flavor was, well, earthy, they were not bad - like softer, mulchier mussels - and goodness, you get a lot of them. They also look quite fabulous in their nautilus shells - I admit I'm a sucker for that sort of thing. We enjoyed the cheese plate as well, and here we come to an important point: After eating a piece of goat cheese, I looked down to discover a wee maggot waving at me from where my cheese had been. Now, I learned later that there is a cheese made in Spain which is INTENTIONALLY full of maggots, and in retrospect, I think that stinky cheese may have been on this plate. Truthfully I am not sure. Maybe the little guy was supposed to be there. Maybe it was his party we were crashing, and he was the VIP. Not knowing this, however, I made the assumption most Americans would make - that bug larvae in my food is a mistake. \"But friend,\" you are now saying to yourself, shaking your head, \"you gave this establishment five stars, and in fact, indicated specifically that you were sober at this point. Why are you bringing up the maggot?\" Because I was enjoying myself so much that I flicked it off and ate the piece of cheese it was sitting on anyway, that's why. It was delicious.If the overall experience outweighed my revulsion with the maggot (again - honestly, he may have been supposed to have been there, so if that sounds reasonably not desirable to you, just enquire about the cheese plate before ordering it) then I must say I recommend the place wholeheartedly.We liked it so much - the food was good, but it also has perks like begin able to get a table at most hours, not being flooded with tourists, and very friendly staff - that we took our friend there two nights later. This is when we stumbled in drunk. Our waitress surely evaluated our status as Overimbibing Sunstroked Americans immediately. Rather than being annoyed, dismissive or patronizing - any of which honestly I would have understood - she chatted with us in Spanish and English, gave us advice about the town, and cracked jokes. I don't know how long we were there - two bottles of wine and three waves of food long - but it was a delightful end to our beach day. If you're looking for a place to go that is enjoyable, low-key, easy and local (enough), I'd go here anytime. It's easily the most welcoming place we went to in Barcelona that week.", 
    "5.0", 
    "Melissa Natalie C.", 
    "Cambridge, MA", 
    "0", 
    "12", 
    "somorrostro-barcelona", 
    27, 
    [
        "Catalan", 
        "Seafood"
    ], 
    2
]