[
    "Went with girlfriend and 2-year-old son for an early dinner at 6pm, having reserved a table. We've spent time in Barcelona every summer for the last five years and so have a decent idea of what kind of food and level of service we can expect. We have our favourite restaurants but decided to go here based on previous reviews on Yelp, which is also part of the reason for this review.On the good side, they were accommodating to our son, serving him with a smile. On first impression, the atmosphere is calm and pleasant and there is a relaxed feeling in the whole place, which is maintained as long as you don't watch the staff too carefully, as they occasionally seemed a bit stressed. Service was slow; not the comfortable slow-food community (which they claim to salute) kind of slow, but rather a kind of poorly-organised slow. Although we didn't order any of the dishes that were indicated to require extra time, the wait seemed to be mostly due the kitchen, which didn't manage to keep up with orders. This despite the fact that there were only 4-5 other tables being served at the same time as us, meaning the restaurant was less than half-full. All dishes were made to order but this goes for many other places, which still manage to serve considerably faster.Food-wise, we had two servings of \"entrecôte with potatoes\", both of which came without potatoes. The meat was OK but not amazing. The fried zucchini flowers with goat cheese and the rice with octopus were nice, although a tad bland. Vegetable pudding with (a very tiny piece of) smoked mackerel was however sub-par. For dessert, the chocolate ganache with olive oil and salt was nice, but again, nothing you can't get in just about any decent place. In general, none of the food was bad but all of our tapas were slightly lacking in taste. The menu is ambitious and the same effort would have been needed in cooking the food itself.Once home, I discovered that we had been billed for two servings of bread that we had ordered but had not been served. My bad for not checking the receipt before leaving but still another minus in the service column. All in all, there were too negatives for us to want to return. See of it as a restaurant rather than a tapas place, bring plenty of time and allow for some misses in service and you may think otherwise. You won't be served bad food, although there are several other tapas restaurants in Barceloneta I prefer better.", 
    "2.0", 
    "Y K.", 
    "Gothenburg, Sweden", 
    "0", 
    "3", 
    "somorrostro-barcelona", 
    44, 
    [
        "Catalan", 
        "Seafood"
    ], 
    2
]