[
    "This place was such a great find near our Airbnb in Las Ramblas. We we were on our way back from the pharmacy when we turned around and saw Taller de Tapas directly across the tiny street we were on. We walked up to the restaurant and we were warmly greeted by the hostess who handed us the menu. We took a look at the menu and we were sold. From the very start everyone was friendly and accommodating. (My Spanish is non existent) The two in our group of four who could speak Spanish ordered first. They ordered the Menus Tapas; which was basically a tapas sampler with croquettes, potatoes bravas, fried calamari, grilled peppers, and a \"Russian\" potato salad. All of it was delicious but the best was yet to come. I ordered the grilled octopus with garlic mash. It was perfectly cooked, tender with the perfect amount seasoning. Another person ordered the grilled squid in a lemon dressing, that was also absolutely perfect. Every dish that came after that was DROP DEAD AWESOME! The muscles, the langostine in aioli,  the octopus and langostine ceviche and a dish so good it was devoured by everyone before I could even think to take a picture. The fried farmhouse egg with chips (fries) and cured Jabugo Ham. It's something so simple with so much flavor. The egg yoke makes this beautiful silken sauce that coats itself over the warm fries and mixes in with the saltiness of the cured ham making this perfect harmony of texture and flavor. It was gone in less than a minute!I also have to call attention to the Mojito Barcelones. I rarely ever more than one drink but this one was so good that I had to. Adding oranges to the traditional mojito gives it an extra depth of flavor. I was so happy with my experience here and I hope everyone can enjoy this restaurant as much as I did.I want to thank Barbara and Richard for the wonderful service.", 
    "5.0", 
    "Stephanie S.", 
    "Vallejo, CA", 
    "25", 
    "100", 
    "taller-de-tapas-barcelona-3", 
    3, 
    [
        "Spanish", 
        "Tapas Bars"
    ], 
    2
]