[
    "I was originally going to give it 3 stars but with the rude waitress who bothered us time and time again, it lost a star. We came here because my husband's friend who lives in Barcelona, recommended this place. It's a chain so there's more than one, but this was the closest to our hotel. We got there around 9pm, when dinner really starts to be busy with two kids, no less.Got down the stairs to stand in line, we were blocking the stairway, so we stood to the corner, out of the line. My daughter got tired of standing so she leaned on the side of the stairs and the lady with red glasses yelled \"she's blocking the stairs!\" when my daughter's little hands were far from the stairs, it was on the edge, under the railing, where the waitress can't walk anyway. I told my daughter to move her hand. Second time, she yelled again \"she's blocking the stairs!\" and so I moved my daughter from that area altogether. Dirty looks and yelling at a toddler isn't going to get her to stop, you crazy lady! Then more people came in and stood in line, so my husband went to stand in line so the newer people wouldn't be served before us since at this point, we've been waiting for 45 minutes. The waiter yells at my husband \"we know where you are in line, you don't need to stand in line\" umm, ok? He came from no where and it didn't look like any of the waiters were paying attention as to who's next to be seated. Again, rude! Finally we got seated, I was already angry and I figured the next rude waiter that bugs me, I'm going to yell back at them. Our waiter helped my daughter up on the chair and was rather nice. Though we shared a table with another couple, we were in the corner. They don't have much selections for wine, it's either red or white and you have no idea what you're drinking. The selections of tapas sounded good and based on recommendations on yelp.com, we went with the recommendations. We were pretty full after a few tapas and decided to leave. Food was ok, it was pricey for what you get. The place is very pretentious and overrated. I know that servers in Barcelona don't work for tips, but it doesn't mean you have to be jerks to your guests. Your food isn't even worth that kind of attitude!", 
    "2.0", 
    "Cindy W.", 
    "San Diego, CA", 
    "1864", 
    "1521", 
    "tapas-24-barcelona", 
    23, 
    [
        "Tapas Bars", 
        "Spanish"
    ], 
    2
]