[
    "We sure did go out on a bang. This was our last meal in Barcelona, and it was a great way to end such a great trip. I set a reservation the day before so we wouldn't have to stress about finding a seat--good call cuz the place was packed. Since it was our last meal in Spain, we went all out. No joke. On top of a few glasses of wine and some vermouth and beer, we ordered (and shared) the following...2 Bombetas--2 breaded and fried balls of Potato & Meat, topped with delicious Sauce. They were little bombs bursting with flavor. A must get. Lamb Skewers--Yo that meat was cooked to its most tender perfection. And then served with a Mint Yogurt sauce that just took it to another level. The seasoning on this entire dish was so on point, I can't even. A must get. Iberico Ribs--If you see \"Iberico\" on any menu, you're likely in for a treat. These were incredible and perhaps (PERHAPS!) my favorite dish of the night. The ribs were smothered in a sweet & sticky honey sauce and topped with fresh mustard. And the meat, oh the meat, it just fell right off the bones. A must get. Cannelloni Stuffed w/Roast Sausage & Wild Mushrooms--Wow. Just wow. The flavor and richness of this was wow. Pasta was perfect. Seasoning, again, perfect. Props to the chef. A must get. Oxtail w/Santa Pau Beans--Another rich dish. And very good. Meat was extremely tender, sauce was a touch sweet. But another hit for Tapeo. A must get. Bread w/Tomatoes--Super simple. Toasted bread w/tomato spread. Always good in Spain. Very good at Tapeo. Foam Crema Catalana--You better believe we left room for dessert. Or, better put, we were getting dessert NO MATTER WHAT. Thankfully this didn't anchor us to our chairs. This dish was a great gastronomic effort, executed perfectly. The outside had that perfect crunch to break through to the foamy, smooth, light center. It was legit foam, but foam that packed a tasty punch. Another must get. Notice the trend? EVERY DISH was a MUST GET. And the bill came out to like 60 Euros. That's it. FOR ALL OF THAT. Amazing meal and experience. Plus the service was really solid. Check it out when you're in Barcelona. I will next time I'm here. Again.", 
    "5.0", 
    "Jon S.", 
    "Campbell, CA", 
    "188", 
    "267", 
    "tapeo-barcelona-3", 
    24, 
    [
        "Tapas Bars", 
        "Catalan"
    ], 
    2
]