[
    "We had planned on having our \"fanciest\" meal in Barcelona, and decided that Tapeo was as good a restaurant as any to try out on our very last night in Spain. Besides being in a super convenient location less than a 5-10 minute walk from where we were staying, it's also directly across from El Xampanyet which makes it super easy to find as it's in a main area in the Born neighborhood. Overall the meal was less expensive than we were expecting, which was a nice surprise as we felt like we ordered the majority of the menu items. In addition to a few glasses of wine, some vermouth and beer we also shared: + 2 Bombas - Not entirely sure what they were filled with, I'm pretty sure potatoes and maybe fish of some kind? But they were super flavorful and delicious. Definitely get 1 or 2 of these to share.+ Lamb Skewers - Probably my favorite dish of the night. The mint yogurt sauce they paired with the lamb was excellent and the meat was cooked to perfection between rare and medium rare.+ Oxtail - This was excellent, the braise was fantastic it was super tender and jam packed with flavor. My only criticism was that it was maybe a little bit on the sweet side for my tastes, but definitely something I'd order again.+ Cannelloni stuffed w/ Sausage + Mushroom - So umami in flavor. Rich, deep, creamy. Holy wow I did not expect pasta in Spain to be good, we even felt like it was a riskier order, but were beyond suprised/pleased by how well cooked and how much flavor they packed into the dish.+ Iberico Ribs - Like bbq? Definitely get the Iberia ribs. They were well cooked (fall of the bone tender) and the sweet and sticky sauce reminded me of home, but with much higher quality pork.+ Foam Crema Catalana - This was a fun surprise. For some reason reading \"foam crema catalana wasn't enough to tip me off on what this dish was gonna be like. For those of you folks who are really into gastronomy this is a really fun and simple dish. Flavors were on point but it was the perfect way to end a very filling meal as it was light as air. Loved that they bruleed the top too so it had a bit of crispiness to accompany the fluffy air bubble dessert.My biggest recommendation for this place would to be to try and book a reservation if you can. While they seemed to accommodate walk-ins, they were very busy and many people were quoted wait times of 30+ minutes.", 
    "5.0", 
    "Siobhan F.", 
    "Sunnyvale, CA", 
    "171", 
    "944", 
    "tapeo-barcelona-3", 
    14, 
    [
        "Tapas Bars", 
        "Catalan"
    ], 
    2
]