[
    "Very small establishment with extremely limited seating. Highly suggest making reservations. We had to wait about 2 hrs for a table after putting our name down so we went elsewhere for some wine to kill sometime. Wide range of tapas that ranges from traditional to modern.Menu on 5/14/2015From Local CountrySprout salad with parmesan & fruit: 6€Aubergines with honey & lime: 5€Vegetables sautéed with mushrooms: 7€Grilled leek confit with 'olivada' olive paste: 7€Asparagus tempura with romesco sauce: 8€Crisps of artichoke or Padrón peppers (depending on season): 6€From Barcelona\"Ensaladilla rusa\" with tuna belly: 4.50€Patatas bravas with alioli, tomato & ñora peppers: 4€Croquettes of Ibérico ham: 1.60€Cod fritters: 2€Bombeta de la Barceloneta: 2€ClassicsSardine coca cake: 4€Dressed potatoes with salmon & wasabi: 7.50€Tomato with buffalo burrata: 9€Free-range chicken legs with soya and ginger: 8€Morcilla from Sotopalacios (Burgos): 5€\"Pincho moruno\" of lamb with mint yoghurt: 5€Beef burger with foie & Bordeaux mushroom mayonnaise: 7.50€Fried Rabbit ribs with alioli: 8.50€Skirt of beef fillet with chimichurri: 8€Ibérico pork ribs with honey and mustard: 8€Oxtail with Santa Pau beans: 10€Beef sweetbreads with mushrooms, bone marrow & figs: 14€Stewed & glazed beef cheek: 9€Acorn-fed pure Extremaduran 08 Ibérico ham*: 12/20€Cured 16-month merino sheep's cheese*: 6/10€*Accompanied w/ Artisan 'Picos' (Bread Sticks)From Calaf No. 1Truffled eggs with foie gras & mushrooms: 16.5€Broken eggs with black butifarra sausage: 9€Spanish omelet with potatoes & chorizo: 6€Spanish omelet of artichokes with ham or cod with Padrón peppers (depending on season): 8€Traditional CatalanEsqueixada (salad) of cod with cop de puny onion: 9€Canelloni of baked butifarra (sausage) with Bordeaux mushrooms: 7€Boneless grilled pig's trotters: 8€Black fideuá with cuttlefish pasta: 12€Stuffed Squid w/ Vegetables: 12€Ibérico Sausage with mushrooms and Santa Pau beans: 9€Dessert: 5€Catalan custard mousseCreamy chocolate with bread, oil and saltTorrija de pan de lechePiña coladaDrinksWater: 2,50€ 50cLSchweppes / Tonic Water: €2Coca-Cola: 2.50€ 0.35 cLVichy Catalán: 2.50€House Vermouth: 2,50€Moritz beer: Small - 1,50€ / Reg - 2,50€Moritz Epidor beer: Small - 1,70€ / Reg - 2,70€Glass of Cava: 4€Glass of white, rosé or red wine: 3€Wine Sangria: Half Liter - 7€ / Liter - 14€Cava Sangria: Half Liter - 9€ / Liter - 18€Our Order:Sardine coca cake: Coca de SardinaFried Rabbit ribs with alioli: Costillas de Conejo Fritas Con AlioliStewed & glazed beef cheek: Carrillada de ternera joven guisada y glaseadaTruffled eggs with foie gras & mushrooms: Huevos Trufados Con Foie y setasOxtail with Santa Pau beans: Rabo de toro con judías de Santa PauIbérico pork ribs with honey and mustard: Costillas de cerdo ibérico con miel y mostaza:Canelloni of baked butifarra (Catalan Pork Sausage) with Bordeaux mushrooms: Canelones de butifarra asada con setas de BurdeosCavaHouse Vermouth: Vermut de la casaThe Rabbit Ribs had very little meat and mostly batter, but made it more palatable for my friends who don't like game meat. I personally didn't care for them because I do like game meat and didn't want just batter. The Sardine Coca Cake only has two sardines on a long piece of bread so you may need to order more than one if you have more than 2 people. There was four of us, but we were fine with a small taste since we had planned on ordering a variety of dishes. We all did enjoy them tho. The eggs in the Truffled Eggs w/ Foie Gras & Mushrooms were poached so the runny yolk was great with the foie gras & mushrooms. Very earthy dish. The oxtail was the favorite dish because it was so tender and loaded with flavor. The Pork Ribs were on the sweet side and also tender. The Stewed Beef Cheek was also very tender and probably another favorite of the group. The Canelloni wasn't very memorable since it wasn't bad or good. Just ok.Service was friendly. Since we came closer to closing time, we didn't feel as rushed from our table (plus we were seated in the middle nook by the kitchen where people can't see you from the front so that helped).Great food. Doesn't beat El Xampanyet (in our opinion) since it is a little bit more expensive but it does have a wider variety. We also thought that El Xampanyet was more lively and fun. Still a great tapas spot! Our 2nd favorite of all the places we tried.", 
    "5.0", 
    "Kitty K.", 
    "South San Francisco, CA", 
    "249", 
    "989", 
    "tapeo-barcelona-3", 
    37, 
    [
        "Tapas Bars", 
        "Catalan"
    ], 
    2
]