[
    "AMAZING AND DELICIOUS! The restaurant itself is not that big so make reservations ASAP because there will definitely be a wait otherwise. I reserved a table for 14 people three months in advance and was fortunate enough to get a great long private table in the back of the restaurant. The servers were super nice and attentive. The food was spectacular. We started with a Magnum (extra extra large) bottle of red wine for 50 Euros and that got the hunger started.We ordered so much food. So much that we had to cancel some dishes towards the end because we could not eat anymore, and the servers agreed haha. We ordered three of each dish so we could share it between the group. A plate could definitely be split between 4 people easy.Aubergines with honey and lime - soft eggplants, crisped a bit on the outside. The acidity from the lime and sweetness from the honey was a perfect combination with the tender eggplantsPatatas bravas- potatoes were perfectly fried and full of flavor from the alioliCroquettes of Iberico ham - one per order. Delicious, perfectly fried, crunchy on the outside, soft on the inside full of mushed potato and a great taste of hamTomato with Buffalo burrata- The burrata was melt in your mouth and super fresh. Olive oil was the perfect touch to the dishIberico pork ribs with honey and mustard- I was at first skeptical on how good this could be but this ended being one of my favorites. The pork was fall off the bone tender and the honey glaze was insanely delicious. The sugar from the honey slightly crusted the pork ribs and added a great mild crunch texture to it.  So good. A perfect sweet and savory combination.Oxtail- Very tenderStewed and glazed beef cheek - the sauce is very similar to the oxtail but the beef cheek itself was more tender and savory. I preferred this over the oxtail. Very well prepared.Truffled eggs with foie gras and mushrooms - I was alittle underwhelmed by this dish. It was good but nothing overly memorable to be frank. The foie gras was delicious but I think the eggs were just slightly a bit too runny for my liking. Worth a try still.Black fideua with cuttlefish - squid ink pasta. Watch out, it will make your tongue black but definitely worth a try. A plate could feed 6 people easy. The pasta is similar to angel hair and a creamy aioli is mixed in the dish. Delicate yet full of flavor. Cuttlefish stuffed with vegetables - The cuttlefish was executed very nicely, soft to the bite, accompanied by mushed vegetables (I think primarily eggplant), accentuating the flavor of the cuttlefish.Steak tartar - a standard well executed steak tartar dishOverall, an amazing meal. A must-try if in Barcelona.", 
    "5.0", 
    "Michelle L.", 
    "New York, NY", 
    "383", 
    "217", 
    "tapeo-barcelona-3", 
    1, 
    [
        "Tapas Bars", 
        "Catalan"
    ], 
    2
]