[
    "Great food, friendly staff fluent in English & Spanish (and probably a bunch of other languages), and a warm, intimate space makes Tapeo a great option.Loved the complementary pan y tomate (so delicious, garlicky and tomatoey with perfectly toasted bread and a slather of olive oil) and the house cava is really light and refreshingWe came here twice during our trip and had the following dishes:1) Patatas bravas - delicious, honestly the best patatas bravas we had the whole trip.  The sauces were amazing - very garlickly mayo and a sweet, thick tomato sauce which perfectly complimented the fried potatoes.  Had to fight the urge to lick the plate (5 stars)2) Pulpo and artichoke - wanted to like this dish but thought it was on the bland side.  The artichokes were a little mushy for my taste but the pulpo (octopus) was cooked well (3 stars)3) Codfish croquetas - delicious!  Deep fried, super crunchy outside and salty, creamy codfish (bacalao) filling.  Each order comes with two croquetas (5 stars)4) Iberican ham - really high quality ham that you can watch the chef shave off once you order it.  The small order (14 euros) was more than enough for the two of us to eat.  The ham was cut so thin that it was a bit translucent, was nicely nutty due to high fat content and deliciously salty  (5 stars)5) Broken yolk with Iberican ham and potatoes - basically sunny side up eggs on top of some ham and friend potatoes.  Unexciting (3 stars)6) Tapeo olive skewers - 4 olives on a skewer each stuffed with fish.  Salty and savory (4 stars)7)  Pork ribs with honey and mustard glaze - one of my favorite dishes.  Fall-off-the-bone pork ribs glazed in a generous amount of honey and mustard, these ribs were finger-licking good (5 stars) 8)  Stuffed, grilled squid - a whole squid, stuffed with eggplant and then grilled.  Tasty, well-cooked squid, interesting combination with the eggplant (4 stars)We walked in both times but they tend to get really crowded by 9pm", 
    "4.0", 
    "Jenn E.", 
    "New York, NY", 
    "217", 
    "269", 
    "tapeo-barcelona-3", 
    78, 
    [
        "Tapas Bars", 
        "Catalan"
    ], 
    2
]