[
    "We went here yesterday and we loved it so much we came back again today.  This place has excellent food, we love this restaurant.Before I cover the food, I should mention a few things:1.  The bathrooms are fantastic.  They are super clean and air conditioned.2.  The wait staff speaks excellent english, and even entertained me when I tried my bad spanish, but the wait staff are awesome and really on top of things.We tried, over the course of two days:Octopus (special menu item) - delicious, if you like octopus.  The main worry was that it would end up chewy and difficult to eat, but they did it justice and it was very tasty and tender, not chewyMorroccan lamb skewer with mint yogurt - my wife loved this.  It tastes exactly as you would imagine it, very good.The bombeta - it is a fried ball of meat, mashed potatoes, spices, and has sauce for dipping and was fantastic.  Americans (like myself) will love this.  I could eat a whole meal entirely just of these.  This is the one that I will order every time I visit.Cod fritters - kind of like a lighter version of the bombeta (with fish instead of beef) and had fewer spices, so the fish didn't jump out as much, it was more subtle.  Truffled eggs and foie gras and mushrooms - Anything that has foie gras in there I am going to like, and that is the case here.  It tastes like how you expect.Rabbit - We were trying to be daring and we tried rabbit and it was one of our favorites on the 2nd day.  It tastes a lot like chicken but with a slightly beefy overtones.  I liked it with and without the dipping sauce, my wife loved the sauce, which was somewhat like mayonnaise consistency with some other flavor we couldn't identify (but was good).Ox Tail - They take the super tender meat from an ox tail and remove the bones.  It is clearly reminiscent of ox tail soup that I have had in asia, but without the bones of course.  On the one hand, I like having it on the bone, on the other, I can see that they are working to save you from making a mess.Iberian Pork Ribs with honey and mustard - Delicious!  Fall-off-the-bone tender and incredibly tasty.  I thought it was slightly sweet, but my wife thought it was perfect, and she doesn't like mustard at all.  Very yummy.Catalan cream dessert - The taste is fantastic, but you should know what you are getting.  It has the consistency of super light whipped gream that is heated on top like creme brulee.  It tastes great, but it's like tasting sweet air.  It was almost like cotton candy (except liquid instead of solid) in the way that it melted and disappeared from you tongue.  I loved the taste, it was a fun experience.  You may not want to order this as your only dessert though.Bread pudding - I loved this.  It was a warm bread with creamy custard center -- it was a perfect end to our meal.", 
    "5.0", 
    "Paul C.", 
    "Santa Clara, CA", 
    "113", 
    "17", 
    "tapeo-barcelona-3", 
    31, 
    [
        "Tapas Bars", 
        "Catalan"
    ], 
    2
]