[
    "What a cute concept for a tapas bar! In addition to menu service (including tapas and meal plates), there is an area set up like a little buffet. Many times, menu pictures don't do a dish justice, but that was no issue here. We got to see many different types of tapas laid out, and made our selections from there.On the \"buffet\" line, each plate has a different type of stick that indicates the price of the dish. The restaurant has a display on the wall with the cost of each type of stick -- very similar idea to those rotating sushi bar restaurants, where each colored dish represents a different price. As you eat, you place the sticks in small metal cylinders at the edge of your table, and the server tallys up your sticks and brings you your check at the end of the meal.There were some wonderful sounding plates available off the menu, but I was so taken with the tapas buffet, I ended up getting most of my meal there. However, I did order the bravas off the menu and I was not disappointed. Delicious!! On Trip Advisor, a reviewer mentioned how most dishes here are on the rich side. As someone who typically follows a stricter diet, I agree. However, when I travel I enjoy trying different kinds of food, food I can't get at home. I really feel like I got that experience at Teleferic (... that's saying a lot because I live in LA and you can get anything here). You can always hit up the local market the next day and get yourself a great serving a fruits and veggies. One decadent meal won't ruin you. :)  PLUS it's tapas, not Claim Jumper.  Small portions, people.This is not a cheap restaurant, but the price point was very fair for the quality, ambiance, and service we received. I walked away from dinner satisfied, not stuffed, for around 48 euros (that included two drinks!).Tip: GET THE CAVA SANGRIA. You will be so happy you did.", 
    "5.0", 
    "Angie M.", 
    "Garden Grove, CA", 
    "4", 
    "3", 
    "teleferic-restaurant-barcelona", 
    7, 
    [
        "Tapas/Small Plates", 
        "Spanish", 
        "Tapas Bars"
    ], 
    2
]