[
    "I count myself fortunate I stumbled onto this place earlier tonight. Chef Jordi Cruz has an outstanding pedigree with his 4 Michelin stars. Let's forget I know this less this shades my review.Ten's menu caught my eye. It hung off the awning leaning into the pedestrian path's center. It highlighted the 15 tapas menu items in 3 languages including English. I quickly scanned looking for something interesting and I found it, but would my friends want to try this restaurant? They did.After checking with management, we sat ourselves outside. As our server was receiving our drink orders, he sung Chef Jordi's praises. For myself, I ordered the foie gras dish with sichuan pepper ice cream (intriguing) and the slow cooked egg dish. I also shared some bread, fried potatoes, and black rice.Onto the dishes. Mine were very attractive dishes, quite well presented. I even added pictures to the Yelp photo section. Overall, the foie gras dish was quite sweet. The crunchy topping alleviated some of the sweetness. I was hoping the sichuan pepper ice cream might lend slight heat, but even that was blatantly sweet. What sat between each foie gras piece was lost in the shuffle.The second presented dish was the slow cooked egg. It sounded really good and again, presented well. However, I was told that to properly eat it, one must swirl it around thoroughly and apply it atop the tomato toast. My gorgeous dish became a seething eggy mass. It tasted nice, the egg overwhelmed everything else. The iberian ham, sobrassada paprika sausage, mature gouda - all lost.Where does this leave Ten's? Merely satisfactory. I appreciate Chef Jordi Cruz's presentation skills and willingness to pair disparate items. However, I am underwhelmed when a dish doesn't elevate any one flavor or masks too many pieces. Also, the service was confusing at times. Our waiter was quite thorough, but sometimes too quick with his suggestions. Customer(s) and waiter must work harder to overcome both language difficulties (he spoke acceptable English, though quick and Catalan tinted) and a challenging menu.", 
    "3.0", 
    "Kenny N.", 
    "Denver, CO", 
    "186", 
    "962", 
    "tens-barcelona", 
    3, 
    [
        "Catalan", 
        "Signature Cuisine", 
        "Tapas Bars"
    ], 
    3
]