[
    "REVIEW #500!!!Has your food ever been presented to you on a tree?  Have you ever eaten a miniature Nordic landscape covered in powered vinegar snow?  Have you ever had ultra tender grilled octopus served on a glass box emitting clouds of smoke?  I have.  And it was glorious.  Yup, Tickets is one of those dining experiences that stays with you for a long time.  And to think it almost didn't happen.Even though we missed the window to make a reservation, my girlfriend and I were so determined to dine here that we booked our Airbnb 2 blocks away just so we could try to walk-in each night.  On the first night, we were told there were no openings and they sent us to Bodega 1900 across the street.  That proved to be a great meal, but our time in Barcelona would not have been complete without a visit to Tickets.  On the second night, we were again turned away.  But after pleading with the hostess, she spoke to the manager who allowed us to sit at the bar.  Success!We opted to let our waiter create the meal for us.  What followed for the next 2.5 hours made for one of the most memorable dining experiences I've ever had.  If presentation isn't your thing, you will not enjoy Tickets.  Each course was something totally new, unique, whimsical, creative, provocative, and special.  There's beauty in the creativity.  But most importantly, the food was overall very good.  I didn't love everything, but I didn't hate anything either.  I recommend:-Summer Tree with Cherry: The presentation is just so fun and unforgettable.  I forgot what the cherry tasted like but it wasn't a normal cherry.-Crunchy Pizza with Bufala Straciatella: Like an air crisp pizza served with buffalo cheese spread.-Basil Air Waffle: Two adjectives I never would have thought to put before waffle.-Tuna: Prepared tableside and served in a nori seaweed cone.-Delta's Eel: Sort of like a mini pork bun but with delicious eel. The brioche is super fluffy.-Nordic Landscape: More art than food.  But it's food so I ate it and liked it.-Crunchy Octopus with Pickled Piparra: The most tender, meaty octopus I've ever had.After the savory dishes came the desert.  The waiter served us 3 amazing deserts and was ready to finish our culinary journey when I asked him how many different deserts they had.  He told me eight.  I then told him I wanted all eight and my stomach had no regrets.  The best and most memorable were:-Lychee gelatin orb served on a real red rose-American \"Pancake\" which was more of a crispy cream filled pastry serve with blueberry jam-Carrot cake shaped like a carrot-Strawberry salad prepared table sideChef Albert Adria deserves all the praise he's gotten for Tickets.  I will always remember my time in Barcelona and Tickets is a large part of the reason why.  Do yourself a favor and pay them a visit.  But try to make a reservation first :)", 
    "5.0", 
    "Peter P.", 
    "Orange County, CA", 
    "314", 
    "503", 
    "tickets-bar-barcelona", 
    6, 
    [
        "Tapas Bars", 
        "Spanish"
    ], 
    4
]