[
    "I have to say first and foremost I could not believe we were able to not only get a table on one day's notice but get maybe the best seat for 4 people at prime time. I had no idea we knew someone in the It's All Who You Know crowd but our friend had a direct 'IN' and there we were the next night. Unbelievable!Now the experience. Before visiting Barcelona we toyed with the idea for the past couple of years of staking our claim at El Bulli and paying the roughly $350 per person dinner. Upon discovering the closing of the world famous restaurant at the end of the month and not really wanting to spend $700 eating for 3 hours we waved the white flag and gave up. Tickets books reservations on a sliding scale 3-4 months out and people scoff and laugh at you if you want to get in as a walk up. We saw that a we times while waiting outside for our reservation. The staff are dressed like   ushers for a high end circus or theatre with nifty fitted suits with the restaurants name in LED lights on the back. Really cool touch. When seated we met the person (unnamed) who would be taking care of us in the way of our experience and ordering and who was responsible for getting us our table. We did a total of 23 courses of the absolute most innovative and incredible food I have had. We toured the menu from Ferran's mind blowing 'olives', foams, pork rind styled seafoods, lemon ice cream that looked like a real lemon and on and on and on. One of the most memorable and enjoyable was the oyster with it's pearl. The oyster itself was maybe the best oyster on earth but the play was all about the pearl and how Ferran used the water from the oyster and suspended it inside of itself to create the 'pearl'. Again whimsical and incredible. If you don't know of Ferran, google him and do a little research. If there is a chance to go and you appreciate food as a whole the experience will cost you around $100 if you go big and trailblaze. I highly recommend it and will go again.", 
    "5.0", 
    "Bryan A.", 
    "Atlanta, GA", 
    "129", 
    "167", 
    "tickets-bar-barcelona", 
    78, 
    [
        "Tapas Bars", 
        "Spanish"
    ], 
    4
]