[
    "Is this your meal of a lifetime? YES! Lives up to hype? YES! EXCEEDS!This place reinvigorated my culinary appetite for more, the whimsical, the daring, and the creative. This place will change how you see food for a long time and you will be spoiled beyond repair. Words won't do this place justice, but I'll still write. If there is one word to describe this experience, orgasmic. There. I said it. Orgasmic.RESERVATIONS: Online only, 60 days in advance. Just try until you score, I managed 2 successful reservations out of 4 attempts. I ended up using both because I loved my first visit so much I decided to go again in less than a week.AMBIANCE: Shockingly casual! Making me LOVE this place morePRICING: UNDER PRICED. Yes, you heard me right. For what you are getting in quality, creativity, and taste, this place is one of the most under priced big name, Michelin starred restaurant around. I've been to many who charged me way more and when I compare them to Tickets, they robbed me! TASTING MENU: First time I went, I did the tasting menu. The tasting menu is customized based on preferences and questions that your server will ask you. Its a surprise, but you can also choose specific items if you have a preference. My awesome server (who I can't remember his name, but he managed the bar seating area and was wonderful!) asked me one question, \"Do you like oyster?\" and with an enthusiastic \"Yes!\" That was it!I enjoyed about 13 courses of deliciousness. My highlights were the: blackcurrant churros, shrimp & fish soup, shrimp fossil, Barcelona & Seoul oysters, pork belly sandwich, and toro. Honestly, each dish was truly wonderful, impeccable crafting, and attention to details. Sitting at the bar was a wonderful experience as you get to see the sous chefs prepare various dishes and also watch the executive chef expedite things. Its a great experience just observing. I loved my experience so much, I came back again! I couldn't resist! AROUND THE WORLD OYSTERS MENU: Second time, I got the same awesome server. He recognized me instantly and teased me about doing the Around the World Oyster menu. I first modestly declined, then it took about 5 minutes before I changed my mind. Go big or go home!14 Oysters with regional flavors and preparations from \"around the world.\" This was an adventure! Texas, Hokkaido, Seoul, and Barcelona were my overall faves. For trying this menu out, I received an autographed oysters menu! No idea this was part of the package, but I'll take it.  In addition to these oysters, I also enjoyed additional ala carte items. The foie gras, spaghetti, and The strawberry basil dessert was so refreshing in the Barcelona heat. Yes. I'm a cow, whatever. I ate like a Queen that day and I have no regrets and will continue to brag to anyone who wants to listen to me about this phenomenal once in a lifetime meal. Foodies this is your calling, do it. Don't even hesitate or think twice. DO IT. Get that food orgasm you deserve!", 
    "5.0", 
    "Winnie L.", 
    "San Diego, CA", 
    "34", 
    "118", 
    "tickets-bar-barcelona", 
    13, 
    [
        "Tapas Bars", 
        "Spanish"
    ], 
    4
]