[
    "First of all the positive, the food was outstanding and the presentation eye popping.  No question at all about the quality of the food, tickets has it right.  The problem that we encountered was with the bill.  Before I get into that, I want to point out we are a Canadian couple living in Barcelona and we have not ever had a problem with overcharging or bad attitude generally until now. So in other words this is not a Barcelona restaurant issue generally, I suspect that perhaps the servers at tickets receive a commission on their food and beverage sales.  Anyway, onto the review.  We decided against the tasting menu and ordered a la carte, our server Alex seemed disappointed that we did not opt for the tasting menu but nonetheless accepted our order.  The first instruction we were given by Alex was that we could not order just one or two tapas/dishes at a time because the kitchen needed an order of no less than three to four starters as well as three to four regular (main) tapas.  Bit strange we thought as we have never been told about this rule at other restaurants, high end restaurant or not it seemed to be an attempt to hurry us along but okay we went along with it. We ordered the olives for a starter, the price being €2.20 on the menu and Alex brought us 4 olives without indicating this was a minimum order. If there was something on the menu that indicated a minimum order of olives or that they were priced per unit, it was pretty small print as we missed it. Then for every tapa we ordered he brought 2, which might be pretty normal for this restaurant but we would have thought you let the customer know your bringing two of each.  The price you see on the menu is €6.80 for a tapa and you think okay I'll share this tapa with my wife/husband/partner.  Nope Alex brough us 2 X tapas each time when we thought we ordered one and please note you will not necessarily notice this at the time as you don't think because there are two manchego cheese airbags on one plate that you will be charged twice the price you see on the menu.  We decided to try one of the \"special tapas\" which in English was \"aged beef\" priced at €14.00 on the menu, so we said to alex we would like to try this aged beef.  What happened next?  A chef came out and cooked up the beef in front of us, served it on a plate for us nice and hot and sliced perfectly.  The price?  Four times €14, you do the math, €56 on the bill.  The pièce de ré·sis·tance of this overcharging party was when Alex recommended dessert.  He said do you like strawberries, we said sure, you can choose a dessert with strawberries.  He then proceed to have his colleague prepare a strawberry salad tableside again, for a cost of €12.40.  Then he brought another desert, and another, and another, and another.  Even after we said that is enough food Alex, he said only two more to go. Desert cost approx. €50.  Now I know what your thinking, take charge and be assertive and tell him your not accepting any more food, call over the maitre'd and argue over the bill.  Sure could have done that but we were enjoying the night and it was not until we received the bill that we saw the damage, €216 euro for a few tapas and a few desserts and a few glasses of wine.  We decided to not get worked up right there and then and fix it later.  More to the point is the unnecessary pushing of the food to crank up the bill as much as possible and in a dishonest manner, tell your customers how it works so they can make an informed decision. If you do decide to go to tickets, enjoy the great food, but watch like a hawk with how that bill is going to add up outside of your awareness.", 
    "1.0", 
    "Kevin B.", 
    "Fort Lauderdale, FL", 
    "0", 
    "1", 
    "tickets-bar-barcelona", 
    45, 
    [
        "Tapas Bars", 
        "Spanish"
    ], 
    4
]