[
    "Amazing.  Our courses:\"The olives by Tickets\" are a classic example of 'nothing as it seems'.  Each 'olive' has a consistency similar to a raw egg yolk.  It slides off the spoon and bursts in your mouth on first bite; leaving you with a mouthful of olive oil.  Clever and inventive, but with a flavor overwhelming.  Jamie made her famous 'I'm trying to like it, but it's just too weird face.'\"Mini airbags stuffed with Manchego cheese\" Exactly what it seems, damned good.  Each puff was like an inflated cracker and you can't really go wrong with Manchego.  Each bite was crunchy, with a little hint of liquid from the pearls on top.  On the side you see the \"crystal bread with spread tomato.\"  Jamie was slowly starting to understand what all the hoopla was about.\"Avocado Galician crab cannelloni with sour cream and light romesco sauce\"  What looked like a Spanish version of the veritable american sushi classic caterpillar roll was anything but.  I wouldn't think to use sour cream with the crab, but it worked.  Our meal was rapidly turning into an all-star tasting menu with each course eclipsing the one it followed.\"Mojado of avocado with spicy loin of cod\"  Prepared table side, this dish consisted of a take on guacamole made with seawater, served under raw cod.  If this was our 'sashimi' course, then I wanted more, more, more.  It was barely even spicy, with just a hint of paprika.  They also served this with a crust of bread to balance the saltiness of the seawater.  Everything is so well thought out.\"Tepid Gallician style oyster\"  This was MY personal course.  First I had one raw.  Just a classic, large perfect oyster.  The next was definitely unique as it was neither hot nor cold and bathed in some sort of tasty oil.  I almost felt lazy ordering oysters with so much haute cuisine on the menu, but I was happy to sample the local mollusks.\"Razor clam with ginger sauce, cayenne pepper and lemon air\"  I think this was my first experience with true razor clams and it was love at first bite.  However, there is a certain way this dish is supposed to be eaten, and it was served with directions in Catalan.  I just nodded and did my best not to drop it in my lap.  Who cares though?  It was freaking delicious and b/c Jamie didn't like the texture I got to have 4.5 of them.\"Joselito's Gran Reserva Iberian Ham\"  This artisanal ham looked too good to pass up.  C'mon, Gran Reserva??  It was a little bit more buttery/creamy than the usual fare and gave us a good reference point for premium Iberico.  I'm not sure my palate is up to the challenge of differentiating the subtleties as of yet.  A few more weeks here, and maybe...Stuffed calamari in it's own ink\" was for me, the quintessential Spanish dining experience.  I remember my high school spanish teacher, Mrs. Rumore, telling exotic stories about eating 'squid in it's own ink' and feeling vaguely curious.  The dish arrived as 4 mounds covered in a black creamy sauce.  This was absolutely to-die-for, possibly one of the highlights of the entire evening.  Jamie even got over the disconcerting hue of the sauce and dipped some bread in.  I wiped the plate clean.\"Confit potatoes in olive oil with pork rib sauce and Iberian boiled ham\"  If the squid was my dish, this was Jamie's.  Melt-in-your mouth goodness.  Everything on the plate was cooked to perfection and the whole combo was a perfect greasy oily harmony.  Hello comfort food, so nice to meet you.\"Sapple of rabbit Salmorejo style\"  I've ordered rabbit before, but never quite enjoyed it so.  The meat was perfectly tender and it was food that I could eat with my hands.  There were actually two on the plate, and we both picked the bones clean.  I don't like carrots, so swing and a miss there, but add points for style.\"Chocolate and hazelnuts cake tribute to Antoni Escriba\" was a delicious and beautifully conceived, albeit somewhat predictable take on a chocolate mouse cake over a hazel nut crust.  To prevent us from demolishing it too quickly, I requested a butter knife to split the portions in two.\"Cold-hot chocolate fritters\" followed and replaced the high bar set and met throughout the evening.  Each bite was gently fried on the outside, warm and gooey inside and cold in the middle.  The interplay of flavor, temperature and texture made this the star of our three sweet courses.  Jamie wanted to order another serving.  I should've agreed.\"Catalan cream roll\" was our swan song.  A crunchy sugar crust filled with cream.  It almost looked like something Gaudi might have designed had he been a pastry chef.Count it off: thirteen courses.  Holy shit that was good.  And Jamie loved it, too.  The bill wasn't that bad either, considering the experience.  I purchased Alan a souvenir copy of the menu and had it personally inscribed by chef Adria.", 
    "5.0", 
    "Chad K.", 
    "San Francisco, CA", 
    "36", 
    "71", 
    "tickets-bar-barcelona", 
    75, 
    [
        "Tapas Bars", 
        "Spanish"
    ], 
    4
]