[
    "I never made it to Spain before El Bulli closed in 2011 so I was thrilled to be able to get a reservation here at Tickets, the Adria brothers' restaurant.Super fun tapas concept with cute ticket booth decor, service staff dressed up in costume, and even an ice cream cart that goes around.Considering the pedigree of the owners, the food is super well priced. Without alcohol, dinner for 2 was 100 euros and we were stuffed!You can order a la carte or simply have them bring you a selection based on likes/dislikes. We went with the a la carte. There was not a single bad dish we had. Some were skippable, but I would order almost everything again if I'm back in Barcelona.Loved:- the famous el Bulli olives!  Yes, they're as good as the hype. I have no idea how they make them thin with the liquid inside, but they are amazing- technique is replicated in some of their other bite sized times like the liquid ravioli.  Mmmm!- crab and avocado 'cannelloni'. No pasta here, just the use of avocado as the wrap- cheese puff things. Great contrast of the creamy center with the exterior crunch- torta of cheese with breadsticks. This is super cool. It's a sheep cheese that has a rind like Brie, but when it's brought to room temperature, the center softens enough to be a thin cream consistency that you dip breadsticks into. So good that we stopped by the market to find something similar to take back home!- desserts!We had 3 since we couldn't decide. There was this chocolate and orange pastry that was on their featured menu and just amazing.  Perfect combo of creamy chocolate in between layers of pastry topped with powdered chocolate, drizzle and orange.Also had their non- chocolate lava cake which was perfectly done with the right amount of liquid. Nice raspberry gelato on the side.We finished with a couple of 'chocolate rocks' which were beautifully presented on rocks!The only thing I would skip is the potatoes with Iberian ham since they were only average. Lots of other dishes looked good but we had no more room.Great service for a Spanish restaurant.  Before you leave, don't forget to head to the back to see the giant chocolate giraffe and giant hamburger at the pastry chefs section.Totally lived up to my expectations!", 
    "5.0", 
    "Katie F.", 
    "Vancouver, Canada", 
    "229", 
    "749", 
    "tickets-bar-barcelona", 
    69, 
    [
        "Tapas Bars", 
        "Spanish"
    ], 
    4
]