[
    "Wow wow wow what an experience we had at Tickets.If you managed to get thru their complicated reservation system and pass the velvet ropes you are treated to an really amazing dining experience.  Tickets was #1 on our restaurant list when we were planning our Barcelona trip.  I won't get into that process because the system pretty much failed us and I was almost going to give up, but luck prevailed and I managed to score 2 reservations on two different days.  We came twice during our week stay in Barcelona because it was that good.  Make sure you have your reservation secured 60 days in advance to the day of your visit, or show up before it opens as I witnessed them letting a few people in with no reservations in this way.  If luck is not in your favor, Bodega 1900 across the street by the same people was amazing as well.We basically let our waiter order for us.  The menu is quite confusing and there are some dishes that we had that were not even on the menu.  It ended up being a 20 plus course meal  over 3 hours and it was out of this world.  Everything dish we tried was amazing.  The presentation and execution was something I have never seen.   Everything was a surprise, dish after dish.  They definitely like their seafood here.  I tried their steak on the 2nd visit and it was amazing.  I came back the 2nd time specifically for that after seeing it served to another table on the 1st visit.   Dessert was amazing as well.  I rather not go into everything dish by dish, since everything served was seasonal and I visited back in May.  I posted pictures so you can see how everything turned out.  Service is the best in Barcelona.  If you have been to Barcelona, you will understand that service is lacking in most places.  It is pricey and things add up really quickly.  If you are a big eater, don't expect to get too full since its all tapas and bites are pretty small.", 
    "5.0", 
    "Margaret L.", 
    "Venice, CA", 
    "43", 
    "15", 
    "tickets-bar-barcelona", 
    24, 
    [
        "Tapas Bars", 
        "Spanish"
    ], 
    4
]