[
    "My sister saw this place on Anthony Bourdain so we had to make a rez. Apparently you need to reserve a month in advance. We were going to Barcelona at the end of a cruise and we were able to secure a rez.Funny layout and decoration, I guess they were trying to get a broadway show kind of look.The servers were excellent, we were told we can order what we want or have a surprise. We decided on surprise.This might be one of the most fun I've had for dinner in a while.We had no idea what dishes were coming and what they would taste like.Sangira infused watermelon - refreshing and differentParmesean crackers with caviar - tasty and interestingSesame seed crusted Nori - wow, yummy, made me think of pork rindsOlive thingys - Olives infused with other flavors like lemon and pepper with an intense olive flavor and no pits, how did they do that?Jamon and tomato bread - pretty good, apparently best Jamon in Spain...hmm OKSardine Crostini - yumCheese Croquet things - I didn't know what to call themBasil Macaroni on heavy cream - interesting and taste goodFoie Gras - do I need to say anything?Razor Clams - taste interestingNori Seaweed cone covered with filo pastry filled with tuna and topped with Salmon eggs - wow didn't expect to get sushi here - yum!Raw Oysters - pretty goodAvocado Canelloni with crab meat fillling - tasted like an intense California RollOctopus - wow, a surprise, expected it to be rubbery, but texture was like eating meatPork Sliders - These were so light and tastyTapanade encrusted pork belly - MmmmAmaretto Cherries with no pit - differentChocolate Wine Corks - interestingChocolate Dumplings filled with Passionfruit ice cream - wow, what a way to end!My first experience with molecular gastronomy, it was fun, some dishes were pretty good but I wouldn't order them but several were incredible. Having it as a surprise menu made it fun and allow us to try different things.The meal was expensive, but well worth it for the experience.Oh if you are looking to fill up here, probably not the place to do that. Each portion, tasty and small.", 
    "5.0", 
    "Jerome L.", 
    "Mountain View, CA", 
    "44", 
    "142", 
    "tickets-bar-barcelona", 
    56, 
    [
        "Tapas Bars", 
        "Spanish"
    ], 
    4
]