[
    "I started my visit to Barcelona with a meal at 41 degrees so it's only right I ended my trip with a meal at Tickets. Totally different atmosphere, some of the same dishes and very similar flavour profiles.I got a reservation through the \"backdoor\", when I was done with my meal at 41 Degrees I asked if it was possible to get a reservation at Tickets for the French Spouse and I for our goodbye meal a week later. The manager was sure I wouldn't want to the only reservation they had very early but I was fine with anything and even happier when it turned out \"very early\" was 7pm. While I have no problem paying top dollar food, I do expect to get delicious food for it and most importantly when I'm with the French Spouse that they love it. Tickets made us both very happy. They had no problem accommodating our lack of alcohol or her pescatarianism. We were at the counter right in food of the kitchen which I personally love as I enjoy watching the skills the chefs display and the dance of a well run kitchen. You can either order off the menu or let the kitchen decide based on your dietary needs and what's good that night. We took the second option since we had never been there before and wanted to get an idea of what they felt were the best dishes.Was it the best meal I've eaten, no. was it totally good and worth the far smaller bill than 41 degree. YES! It was nice blend of technique and really excellent ingredients. It's not at all like any tapas you will have anywhere in Madrid or Barcelona but it was never too frou-frou or heavy handed. In the end all the dishes regardless of what modern techniques were used were all about the taste. The tastes while subtle were amazing. While so dishes were showy, it was never at the expense of the taste. Loved the razor clams, the cheese airpuffs, the gelled olives, the cotton candy tree, and so many other dishes.Another thing I really like was how it was fine dining food served in a causal playful environment. Some people may expect a more posh environment for the level of food and price but I find it really appealing and it reminded me of the west coast style of fine dining without the dinner jackets that I really love.Also our main server was great, he explained everything in detail in English and he seemed excited about the food. The other servers and managers were also friendly and helpful. The only person who gave us any attitude was the door person who must have been having a hard night cause she was rather rude to the French Spouse and I'd like to think it was she was having an off night and not the the French Spouse's hawk or tattoos.All in all, it lived up to the hype. Is it the best place ever or even the best meal I've eaten in the last year, no but it will certainly be one I will remember and I already am planning on going back next year.", 
    "5.0", 
    "DeathandFood H.", 
    "Portland, OR", 
    "265", 
    "572", 
    "tickets-bar-barcelona", 
    60, 
    [
        "Tapas Bars", 
        "Spanish"
    ], 
    4
]