[
    "*No .5 system here but this would be a 3.5 star place for me!*Tickets is one of the most famous restaurants in Barcelona as it was opened by  Ferran Adria, the chef of elBulli, (elBulli for many years the best restaurant of the world before it closed in 2011) and his brother Albert. In order to dine at this restaurant, you need to secure a reservation exactly 60 days in advance via an online reservation system and spots fill up quickly. We were looking forward to this restaurant a lot and pretty much counted down the days until we could dine here. We decided to do the tasting menu which your server helps you craft and we were able to try the majority of the items. Perhaps it was because my hope for Tickets was so high that I unfortunately felt that the restaurant did not fully reach my expectations - the food was delicious but not mind blowing and I did not get wowed by every single dish. That being said, there were some stand out dishes:-Air Baguette and Jamon: This was an El Bulli hit that made it onto the tickets menu. Empty baguette crust wrapped with iberico ham. This was a light and interesting take on the traditional ham sandwich that you can find all over Barcelona-Crunchy Octopus with pickled piparra: The taste of this dish was unique and different than the traditional grilled octopus you get served in restaurants.  The texture was not rubbery at all and whatever made this dish crunchy was fabulous-The Spicy Lobster: the lobster comes cracked for you already and they serve pillowy steamed buns on the side that you can dip into the flavorful lobster sauce.-Crunchy Suckling Pig with its mini ciabatta: This was like a miniature bahn mi. Because I could eat this in one bite you could taste all the flavors of a bahn mi sandwich in your mouth!-The Trip around the World Oysters: I can't remember which flavors our server chose for us, but all the preparations were very uniqueThe cocktail menu was fantastic and you must order the chocolate cocktail drink!", 
    "3.0", 
    "Katie L.", 
    "Manhattan, NY", 
    "8", 
    "44", 
    "tickets-bar-barcelona", 
    29, 
    [
        "Tapas Bars", 
        "Spanish"
    ], 
    4
]