[
    "Lives up to the hype. Although we didn't enjoy every single course, Tickets is a culinary adventure with ups and downs that both please and surprise. Like a circus show with both good and great performances, taken as a whole this was a unique, memorable, and delicious experience!We were in Barcelona for three days and unfortunately we hadn't made reservations for Tickets ahead of time. No matter, we showed up on Friday night at 7:00 pm and walked right in and got a table! We were told we had to be out by 9:15 pm, which seemed like plenty of time for us. It was not!We started with a bottle of Numanthia from Toro, which was outstanding, which moderate tannins, good structure, and deep fruit and chocolate notes. We loved it. The wine list is small, but includes some incredibly good values in the 20€ range.We started off with the tomato bread and iberico ham. The tomato bread was a bit underwhelming as we had had better bread at Paco Meralgo's the night before. The ham was outstanding, and delicious, but of course, this was a departure from the inspiring and creative dishes that Ferran Adria is known for. Our next course was the liquid olives. We found them to be a creative and fun dish, especially because they are served in an olive jar and our server pulled them out of the jar and placed them on a silver spoon in front of us. I found the novelty of biting into a liquid olive to be fun, but the olive was much too salty for my taste and I wish I had a glass of riesling to pair with this course because we each received three olives, when one was plenty for me.The third course was the creamed artichoke, which was my wife's favorite dish. The cream was a superb compliment to the fresh and beautifully ripe artichoke. The manchego cheese slice served on top of each artichoke heart added a nice dimension from a textural standpoint. A simply well balanced and tasty dish.Our fourth course was the cannelloni. This is a \"must order\" on the menu. A fun take on a pasta dish where not a single ounce of pasta is used here. Avocado is used for the casing and the ricotta cheese inside is actually a fish and mayonnaise salad. Topped with parsley, dollops of cream, and olive oil, this was a large serving and truly enjoyable dish.The fifth course was the fish taco, where butter lettuce was used instead of a tortilla. It was a light dish with excellent fish, but just a tiny, tiny bite. We should have ordered at least two.This course was followed by a half dozen oysters. The oysters were larger and served with olive oil caviar. I thought it was a clever touch to include the caviar, but the olive oil actually seemed to detract from the beautiful flavors of the oyster itself. I kept wondering what oyster would taste like without the olive oil. Regardless, it was a an enjoyable dish, but I wasn't quite sold on the olive oil caviar.Our last dish was the hamachi sashimi. Seven pieces of incredibly fresh and superb cuts of hamachi. This was another large and filling dish. The hamachi had been seared very lightly, which gave it a slightly firmer texture, but it was a fabulous way to end the meal.Overall we had an excellent meal at Tickets. Our server was very friendly and helpful and each course was both memorable and unique. We enjoyed ourselves so much that we ordered a second bottle of wine to continue our wonderful meal. I must say that although it's expensive, I never felt like it was over priced. The portions were large considering the format is in the spirit of molecular gastronomy. In fact many would consider Tickets a bargain from that aspect. They have really embraced the casual and fun aspect of this culinary movement.Our bill came to 200€ including two bottles of wine, which I thought was a bargain. Although I did not enjoy 100% of every course, each course was a unique take on it's typical nature and was an adventure with ups and downs, which adds to the excitement of the evening, much like a circus act. Bravo Ferran!", 
    "5.0", 
    "Pete V.", 
    "Alexandria, VA", 
    "248", 
    "407", 
    "tickets-bar-barcelona", 
    38, 
    [
        "Tapas Bars", 
        "Spanish"
    ], 
    4
]