[
    "I have a good friend who is living in Barcelona, and we finally managed to get out there from London. When planning the trip, he told me about Tickets. I didn't even know it existed. So as soon as he told me that his supervisor said it is how El Bulli used to be when it started, I knew it was definitely a place to go. So I got online to reserve. (Sixty days before you want to go, the bookings open up at midnight, so just make sure you log on then and get your table. Easy as pie!)I was really looking forward to this meal on our first night in Barcelona, and it really lived up to expectations. We ordered several of the bar snacks (false peanuts, tempura pistachios, the \"olives\") and we were really satisfied with all of them. My favorite was definitely the pistachios. Fried nuts? Yes and yes. The false peanuts were really interesting and not at all what I expected. For tapas, we had the Jamon, the manchego airbags, the baby squid, pork ribs, several oysters, octopus and kimchee, foie gras and probably others that I'm just forgetting right now. The oysters were heavenly with such interesting flavor combinations (the cucumber was my favorite). But every time something came out it was superb and delicious and we thought the meal had hit a high point until the next small plate of food came out and we were blown away again. It really was spectacular. Throw in some of the best Spanish wine I've ever had, and it really just blew my mind. We had dessert on the terrace and split the Tickets chocolate that looked like Toblerone and I had the mini ice cream cone. Delicious. And some delicious and spectacular dessert wine thrown in and all three of us left the restaurant happy and content (and quite drunk). The service isn't too attentive, which I suppose could really put off some people, but I take it as the relaxed Spanish attitude to eating. We weren't rushed, and we had plenty of time to enjoy our food and catch up with each other. Tickets was definitely a highlight of the trip, and it should be seriously thought about for any foodie heading to Barcelona.", 
    "5.0", 
    "Grant T.", 
    "Enfield, United Kingdom", 
    "216", 
    "723", 
    "tickets-bar-barcelona", 
    46, 
    [
        "Tapas Bars", 
        "Spanish"
    ], 
    4
]