[
    "Oh man.My husband and I just traveled to Spain for our honeymoon with the intention of eating the tastiest food we could find. With the reputation of the Adrias and all that I saw on No Reservations, I knew Tickets had to be part of the trip. So I went to the website at the exact time 60 days before and got us a dinner reservation. One of the best decisions I ever made.Before I get to the food, I want to say that I loved the atmosphere here. So many restaurants with a reputation like this tend to take themselves way too seriously and the whole experience can get a little stuffy. This place was casual, fun, whimsical, and I think that atmosphere really added a lot to our experience. Anyway.As others have mentioned, you can go a la carte here or go with the \"surprise menu.\" That is, let the staff decide for you. Going into this we were all, \"A LA CARTE ALL THE WAY!\" because we wanted to choose our destiny. Then we looked at the menu and every single thing sounded amazing, so we let them choose. This was an excellent idea. Give a bit of guidance, though. We said we wanted a lot of seafood (true test of a restaurant, right?) so we got a lot of seafood. It was amazing. I'm not going to go through every dish because we're pigs and had about sixteen different things, but here are some highlights:--The olives. Yeah, you've heard about them and you're just going to have that experience. I'd had similar olives at Jaleo (the Vegas one) and Jose does his best but you need to have them Adria style. They gave us two different kinds: one garlic and rosemary and one more anise flavored.--The \"air bags.\" Again, another thing they're famous for. But the light, puffy pastry, and the contrast of the hard manchego on top and the explosion of the creamy manchego inside. OH HELL YES.--Foie gras. Melts in your mouth. Never have those words been more appropriate.--Tuna tartare with avocado and mint. This is the one dish we specifically requested, and it did not disappoint. I now want to mix tuna and mint ALL THE TIME.--Razor clams with black garlic and lemon air. I'd never had razor clams before, and dayyyyum. So fresh, and that little bit of lemon and garlic brings this to the next level. --and finally I must discuss the LOBSTER. For a place known for experimentation, this was a wonderfully simple presentation. Just the freshest lobster one could find cooked and split open. No butter. Dip the lobster in the head juice. YES. A revelation. Wine list was excellent without being overwhelming. We got a bottle of a Xarel-lo simply because it was a white we hadn't heard of before and it was probably the best wine we had during the trip (and we, as you might guess, had a LOT of wine) Service was, of course, quite good, and it's damn expensive but you know what, they could charge a LOT more. (We went to Arzak earlier in our trip and it was twice as much.) Worth every penny, I'd say. If you're going to be anywhere near Barcelona, get on that website 60 days in advance. DO EET.", 
    "5.0", 
    "Monica T.", 
    "Salt Lake City, UT", 
    "273", 
    "536", 
    "tickets-bar-barcelona", 
    39, 
    [
        "Tapas Bars", 
        "Spanish"
    ], 
    4
]