[
    "After two months of waiting, last evening was it! And Tickets didn't disappoint. To repeat the sense of what someone wrote, it's fun. There's no pretension. It's not a temple to haute cuisine. The food has a delicate-ness to it without ever losing the sense that you're in Spain, especially Catalonya.I knew we wanted a few dishes and then left it up to them to \"surprise.\" Most everyone got the same surprise but that's fine. We started with the \"olives,\" of course. According to our server it's take about six olives to make one \"olive.\" And then they're put in a jar that has olive oil with some peppercorns, a small cinnamon stick and ???. She was very clear that it's just one bite/swallow. Wow. An explosion of olive taste. (Let me say that if you've already been here, this is probably boring you but I'm still bowled over!) We had four year old jamon Iberico, cut paper thin. The \"ham man\" was slicing when we arrived and didn't stop for a long, long time :) It came out with the pan con tomate which is pretty much ubiquitous here. But, of course, theirs was the best :) The outer parts of the bread were wonderfully crusty and the inside had lots of air pockets. Another must-order were the \"mini-airbags.\" They look like a small gougere but the inside is mostly hollow with a manchego \"something\" (foam perhaps?), a stamp sized piece of manchego on top and some little pearls of something (I assume man-made). Between that and the \"olives\" I don't know which blew me away more. This is in no particular order and far from good explanations but snapping ONE pic was as far as I was going to go. Unlike some, I wasn't going to spend the time making notes and analyzing :) About now we had tuna belly in these wonderful little cones. The inner part of the cone was nori and the outer was some bread-y products that I assume was applied to the nori and then somehow cooked. This was nicely spicy. See the little red 'thread' on the top of each? That was cayenne. A real photo moment was with avocado canneloni with king crab and some kind of cheese (I think). Tasted as good as it looked. A local specialty is butafarra, a Spanish white sausage, served with white beans. Previously we'd had it room temp and super thinly sliced as a tapa. This was even better. Perfect. (I could say \"perfect\" for every dish.) Oysters with pearls. A little (always) contained foam-y thing was the pearl. We were sitting at the counter directly across from the woman shucking the oysters. She smelled EVERY ONE as she shucked it. A little change of pace were pieces of fried fish with little dots of what I believe she said was romescu. Oops, almost forgot the brioche with pork belly (I could be fuzzy on that one but believe I'm right.) Just crazy good. Then we got to what I thought was \"dessert\" but in fact is called \"The Finish.\" They call it ravioli with payoyo cheese and a minute piece of \"toast.\" I could eat 20 of those :) THEN we got to dessert. Lava cake with an almond \"cream\" and a raspberry sorbet. Lord, you can take me now :) OR, if there's a heaven and I make it there, let it be Tickets...PLEASE. Regarding wine, since we've been having at least one glass of cava every day for the last week, we stuck with that. Very nice and modestly priced.I believe I've covered all the dishes. Albert Adria, Ferran's brother, was on hand and it was lovely to speak with him. Our server, only 20 y.o., spoke very good English which was a plus since my Spanish is very limited. From what we could tell a lot of the diners were visitors or transplants from other nations. We had kind loosely set a budget of 150+ Euros and were willing to go up to 180. Tab came in at 145. For us, that's a very expensive meal. Not for The French Laundry crowd but for us. Even with our frugal nature, we considered this reasonable. Our next trip to Barcelona will be built upon getting the Tickets res first and then booking the air :) I could NOT recommend this restaurant highly enough.", 
    "5.0", 
    "Catherine O.", 
    "Carnelian Bay, CA", 
    "2", 
    "29", 
    "tickets-bar-barcelona", 
    72, 
    [
        "Tapas Bars", 
        "Spanish"
    ], 
    4
]