[
    "BEST AND HAPPIEST MEAL EVER.Getting a reservation was kind of crazy because their website would crash every day at midnight Spain time.  In the end, after many attempts, I got a reservation for 1 person, but when I emailed them, they were very nice about changing it to 2 for me (all that was online was availability for 1...).  The place is super whimsical with a theater theme inside (including the red rope and ticket office at the front), and there are open views of all the prep areas. I requested a seat at the bar, so we could watch them. Bar seating is the way to go.For drinks, they had very generous wine pours, and we had some good Spanish wines at around €5 per glass (crazy cheap, right??), and I think we ended up with 8 generously poured glasses between the 2 of us. You can order of the menu, or trust them to surprise you. The menu descriptions do NOT do the dishes justice. They kept asking if we wanted more, and we kept saying yes.1. \"Olives\": the signature El Bulli dish - pureed olives reshaped into olives, with lime and peppers and honey - they basically explode in your mouth 2. Surtido: wonderfully rich Iberican ham and pan con tomate 3. The Spring Tree: Literally a tree with scissors and \"fruit\" hanging off of it.  This was the most elaborate presentation for a dish I've ever seen  - Crispy rice coated pistachio cheese: the crunch from the rice and the pistachio taste were great  - Cherries: coated in a cloud of salt and lime, and surprise - the pit was replaced by a pistachio!  - Churros: light and airy, like freeze dried black currant and yogurt. The yogurt flavor is strong but is cut nicely with the white wasabi dipping sauce4. Green Waffles: warm, in a cute picnic basket, stuffed with carmoza cheese, ham, and crunchy pine nuts. The waffle was made of basil, and it was like a perfect pesto concoction.5. Straciatella: crispy thin brie and oregano \"pizza\" with balsamic jellies.  The straciatella (like burrata) for the pizza was amazing6. Pita: puffed and filled with Manchego cream, topped with cheese - like an air bag that bursts with flavor7. Eel brioche with shiso leaf: served in a dim sum dish. I don't even like unagi, but this was good and not over-sauced8. White asparagus: best asparagus dish ever. Tender miso marinated white asparagus (perfect texture) with crispy garlic and escabeche9. Oysters: fresh oysters with a Thai sauce (actual peanut bits) and tobiko - way cooler than a standard mignonette10. Torched salmo: with salmon skin chips to put the salmon on. You then top it with a seaweed and radish salad 11. Mar y montana: with bread. Super flavorful squid and white bean stew with Iberian sausage. Best beans ever.12. \"Secret plate\": pasta made of Korean king trumpet mushrooms with the most amazing chive and truffle sauce, topped with parmesan cheese. LOVED this.13. Potato confit and Iberian ham: smoky14. Mini hamburger: with cochinillo and sriracha mayo, pickled carrots - it tasted like a high end banh mi (in a good way)15. Chicken: on a stick, lots of spices (especially cumin), topped with foam. I don't even like chicken thigh, but this was amazing. It came with a square of bread soaked in chicken gelatin - AMAZING16. Cheese: Traditional Payoyo and bread, then spoons of a creamy payoyo ball topped with mini breadThey then moved us into a DESSERT ROOM?!  It was like Alice in Wonderland, with berries on the ceiling, an open prep kitchen (we got the bar seats). This room was just... happy!  Ratatouille was being shown in the background17. Edible rose: with a lychee center18. Pancakes: like the sugary top of a creme brûlée filled with the inside of the creme brûlée, maple syrup, a jar of blueberry compote, and pats of \"butter \" (actually caramel)19. Mille feuille: a mille feuille on its side topped with wild strawberries20. Strawberries: prepped tableside on a cart. Basil sherbet, freshly macerated strawberries, freeze dried and wild local strawberries, tiny basil leaves, balsamic, black pepper, brown sugar, and olive oil.  BEST fruit dessert ever!21. Eclair: in a cute Tickets envelope. Chocolate coated with a peanut butter center and crispy rice inside 22. Orange lemonade shots: at this point, I couldn't even tell if there was alcoholAll for only €263 (IVA included) for 2 people. The € was almost 1:1 with the $ when we went.I have never been so excited and literally elated by a restaurant. Throughout the meal, we just kept saying this was the most amazing meal ever.  Each dish was so innovative without doing excessive molecular gastronomy, and each thing had a cool surprise component to it.  i hate to say it, but I'm glad El Bulli closed because we otherwise would not have had Tickets!Definitely the most memorable meal I've ever had. I would fly to Barcelona just for this.", 
    "5.0", 
    "Marilyn T.", 
    "Mountain View, CA", 
    "339", 
    "1488", 
    "tickets-bar-barcelona", 
    34, 
    [
        "Tapas Bars", 
        "Spanish"
    ], 
    4
]