[
    "PARTIAL REVIEW SEE BLOG Solid Watermelon Cocktail infused in SangriaA fantastic boozy-slice of sweet crisp watermelon, adorned with an aromatic selection of orange zest, mint and anise. A fantastic first-bite.Parmesan Pizza with Mozzarella Cream and BasilBy far the most fabulous frico I think I've ever tasted. Light, crisp, and full of flavour and yet, gone in an instant after it hits the heat of the tongue. Alas, all good things must come to an end.Tempura of PistachiosWhat a fantastic idea- I can't believe I've never seen nuts battered and deep-fried before. Salty, crispy, yum.False PeanutsEasily one of my favourite little bites of the night. Imagine a peanut buttery cream surrounded by a light candy shell that bursts in your mouth when it hits your teeth. I wish I had asked for another round of these babies at the end of dessert.Crunchy Nori Seaweed and SesameSuper airy light crisps that deflated in the mouth while the sesame offers that satisfying second layer of crunch. Great party snacks.Tickets' Olive-SThese \"olives\" were made with the briny olive juice suspended by spherification. In other words, it was merely a thin skin holding in the potent liquor so that when you closed your mouth they exploded to coat your palate. A senses-spanking experience- that's for sure.Anchovy with Tomato on ToastThis was one of the more traditional of the dishes, but sensational in all its simplicity. The crispy hearty bread, the sweet acidic tomatoes and the salty meaty anchovy- it's no wonder why this is a Spanish staple.Seaweed Tempura with Seaweed JusPerhaps not much to look at, no, but boy, was it ever tasty. I'm sure Albert wouldn't appreciate my saying this, but if you closed your eyes, it kind of reminded me of \"fresh\" (I'm not sure I can say fresh without quotations in this case) McDonalds fries - in the best way possible. Salty, mildly sweet, crispy and light- addictive, to say the least.Cheese Mini AirbagsLittle tiny pita crisps packed with creamy salty manchego cheese and topped with briny Caviar. We all know airbags are a real lifesavers, and these little culinary heroes really nailed that home. Crispy Bread with Iberian HamIt looked like a heavy, bready dish, but in reality, the bread was hollow, crisp and light, and was wrapped in the most succulent, savoury meat I've ever had. A beautiful way to highlight good quality Spanish ham.Foie Gras Tribute to LucuioTwo generous chunks of foie glazed in a sweet and bright escabeche sauce with little nuggets of sweet and crispy freeze-dried corn. I was a bit concerned about the portion of foie gras as we were told to pop the whole rich bits in our mouth at once, but the light sauce and crunchy corn helped cut the fat. Basil Macaroni in Parmesan Cream with Pine NutsThe herbaceous pasta was cooked to a perfect al dente, paired with a luxuriously nutty creamy sauce and delicate mini fricos for a balanced textural experience. A perfect sized dish for a boldly flavourful dish.Nordic LandscapeWith limited experience of Nordic cuisine, this dish brought me back to the place where I actually met Albert, where our field trip to Niagara on the Lake featured lunch by a selection of innovative Nordic chefs. The combination of rich flavourful raw beef, smoky cheese, bright pickled onions and acidic vinegar powder made for a light, bright, yet simultaneously satisfying course.Oyster with Soba Noodles and Shitake Consomme[39]I've obviously never seen an oyster served like this, but it sure worked well. The meaty nugget of sweet meat was to be consumed first and alone, then the nutty noodles and umami-rich broth was slurped down in one fell swoop. A new oyster experience for me, but definitely something I hope to see more chefs at home adopt.Avocado CannelloniI'm not sure how they maintain such a beautiful shiny coat and bright colour on the avocado, but my goodness, does it ever draw you in. The sweet snow crabmeat was moist and decadent against the vegetal flavour and creamy texture of the avocado shingles. Simple, yet divine.Tomato Salad with Gazpacho GeleeThere is nothing better than ripe, fresh tomatoes- though Tickets really upped their game with this. The already juicy fruit were paired with delicate morsels of a gelatinized clear tomato water aromatized by basil, cucumber and other bright vegetables. A fantastic vegan dish.Mussels in Marinara SauceI don't think that mussels are hard to pull off, nor should be a simple marinara, but to do them so perfectly is undoubtedly skill. The shellfish were flawlessly cooked to retain their delicate texture, and were enhanced by an aromatic sweet and tangy rich sauce. I could easily plow through an entire pot of these.Spaghetti \"King Oyster\"An earthy (gluten-free) take on pasta with mushrooms standing in for noodles. The Kings had been ....", 
    "5.0", 
    "Abbey S.", 
    "Toronto, Canada", 
    "17", 
    "134", 
    "tickets-bar-barcelona", 
    41, 
    [
        "Tapas Bars", 
        "Spanish"
    ], 
    4
]