[
    "THE ENVIRONMENT: was fun and playful. Tickets offers a very laid back atmosphere which allowed for everyone to relax and just enjoy the meal. There was nothing stuffy about the dining room, it was all about having a good time. Your senses are filled with pops of color, interesting displays of decoration, funky chairs and tables, and of course, some of the most interesting food I have ever had the opportunity to eat. THE SERVICE: was great; different than I expected, but great. The server introduced herself to us at the beginning of the night, asked us if we would like to order a la carte or would prefer a type of \"tasting menu\". We chose the tasting menu; then she asked if we had any food aversions/allergies (we told her we ate everything except coconut) and she then began sending out courses. They dont offer an actual \"tasting menu\" so the servers have the ability to send out what they think the table will enjoy based on the few questions she asked. So, the courses you get might be similar to the dishes the table next to you gets; but the entire meals are not the same. The first few dishes came our right away; but as the night progressed there started to be a few lulls between dishes. Not necessarily a bad thing though; as it helps you realize how full/not full you are if you're given a few minutes to process that. Around course #17 she asked us how many more savory dishes we wanted because there were \"several sweet courses to end the meal\". We opted for 1 or 2 and then the desserts showed up. All in all, the service was great, very \"hands on\"; yet she allowed us to enjoy and process the entire meal slowly and without much interruption. THE FOOD: was amazing. Molecular gastronomy continues to be on of my favorite food experiences and Albert Adria is one of the best chefs in that category. From the techniques used, to the incredible flavor achieved, to the unique ingredients- our meal was not only delicious; it was all a work of art. Each dish was delicious, each dish was impressive, and each dish was fun to see as well as eat. My favorite courses? All of them. Every single dish was so good that I would go back and order every one of them again. MY FINAL THOUGHTS: Tickets was easily the most fun I'ver had while eating a meal. From the moment we walked in to the restaurant to the moment we left we had such a great time. If you ever find yourself planning a trip to Barcelona; make sure you get reservations at Tickets. Its a must-visit for anyone who loves and appreciated food.For a more lengthy review, click here: coffeewineandyoga.com/bl…", 
    "5.0", 
    "Tanis G.", 
    "Los Angeles, CA", 
    "87", 
    "129", 
    "tickets-bar-barcelona", 
    15, 
    [
        "Tapas Bars", 
        "Spanish"
    ], 
    4
]