[
    "KenScale: 9.0/10Out of all the restaurants in Barcelona I was visiting, I had the highest expectations at Tickets. How can you not be? After the unfortunate closure of the great ElBulli, the famed brothers Ferran and Albert Adrià opened up this casual tapas bar to worldwide acclaim, and Tickets became one of the hottest (and toughest to get into) restaurants in the world. I was very excited to step into the restaurant that was already bustling with crowd. Short verdict: yes, the restaurant absolutely delivered!We decided to leave it up to the server to bring whatever the best dishes he can bring. By the time we were finished (we weren't keeping track of the price of each dish), the bill including the wines came to whopping 150 euros per person, but I wasn't complaining. I was deeply impressed with the uniqueness of each dish in flavor and texture. If there is one word to characterize the food at Tickets, it's \"playful.\" You wouldn't expect the level of inventiveness at Tickets elsewhere very easily. Churros made of blackcurrant? Check. Basil waffle? You name it. How about cheese and hazelnut? There were three sets of oysters, each called \"Paris,\" \"Rio\" and \"Yucatan.\" In all seriousness, however, it's not just witty plating or combination of ingredients that stood out. I could totally eat anchovy and chicken skin toast or skewered cow and baguette every day for breakfast. Foie gras with garlic was also a work of art with great flavor and texture, as was Mackerel with shiitake mushrooms. I enjoyed the tenderness of octopus with kimchi (although didn't taste much of spicy kick), and the \"surf and turf\" dish of baby squid, Iberian sausage and white beans was aromatic. You wouldn't think the spaghetti with Parmesan cheese that came in was actually made with mushroom, as the noodle had the texture of flour cooked perfect al dente. The last savory course, steak with red pepper, was one of the best steaks you could hope for, with perfect juicy texture of meat that was very balanced on flavor as well. The surprises don't stop there, with outstanding desserts like carrot cone, chocolate éclair and pancake with yogurt inside and cranberry jam outside that capped a memorable meal. First thing on the reservation: Make sure to book the table as early as possible. The restaurant takes reservations exactly two months in advance (and that's exactly how I did it online, counting the time difference between U.S. and Spain). I really liked the casual and lively vibe of the restaurant, which seems to have a nice mix of tourists and locals and weirdly resembled a bit of a classic American diner in décor. There are extensive selections of wine you can obviously choose from that you can complement with the tapas dishes. Yes, the hype for Tickets is well justified, and if you have a chance to visit Barcelona, this is a must-stop-by destination.", 
    "5.0", 
    "Ken S.", 
    "Manhattan, NY", 
    "206", 
    "357", 
    "tickets-bar-barcelona", 
    11, 
    [
        "Tapas Bars", 
        "Spanish"
    ], 
    4
]