[
    "There is no doubt that this is a 5 star establishment, to get a reservation you must book online 60 days in advance and they go on sale at midnight local time. Living in the US makes this a little bit of an easier process. They are closed Sunday and Monday so keep that in mind as well. I went for the tasting menu which they can cater to you, mine ran about $125 a person. Service started off excellent and by the end it was very good, I make the distinction because of the price point it is worth noting. As it got busier we wished we were checked on more.While pricey this is not a \"white tablecloth\" restaurant, so no need to feel obligated to get suited up if you don't feel like it. The ambience is fun and the theme is that of a carnival circus without being childish. Just about all the staff was very fluent in English, which made the menu and experience much less intimidating.The drink menu was good but not gastronomic like their food menu. The drinks were all great, no complaints. I had a Gin Fizz, a Pisco Sour, and some kind of chocolate coffee concoction. Now on to the food. The food ranged from good to great and the presentation and flavor profile of every dish was perfectly executed. I recommend trying things outside your boundaries here as what they can do with the flavors here is quite spectacular, you'll be surprised with what your favorite dish might be, I promise you that.Course 1 - It was a light starter of fish chips, it was almost like chicharon. Tasted fine, we also had a version of these across the street at their sister restaurant Bodega 1900Course 2 & 3 - They were served on the same plate. The cherries on a tree were dipped in some kind of cream and it was quite the work of art. At the bottom of the tree was some pistachio creams in a hard shellCourse 4 & 5 - We were served two versions of their molecular gastronomic olives, they tasted subtly different and popped in your mouth. If you like olives or dirty martinis then you will enjoy this. This dish is really about the science, execution, and presentationCourse 6 - Anchovies on a cracker with tomato, simple and a little salty. Course 7 - The famous mini cheese airbags, I believe it was filled with a whipped and creamy manchego cheese. Course 8 - Beef on a cracker with aioli. It sounds simple but the flavor profile was complex, lots of flavor in what looks like a simple dish. Course 9 - Tuna on a seaweed cracker. If you are a fan of tuna tartar then you will enjoy this dish. Some of the best raw tuna I've tasted.Course 10 - Mini Eel Sandwich. This item was not only a highlight of the restaurant it was a highlight of the trip to Barcelona.Course 11 & 12 - Oysters served 2 ways. The first was with strawberry and kimchi and the 2nd was with vinegar and salmon roe. If you enjoy raw bar these are not to be skippedCourse 13 - Deconstructed Caprese Salad. A mix of all the familiar ingredients found in a caprese salad with hints of pistachio. The foam and tomatoes tasted unreal and I am hardly a salad guy. This is another highlight.Course 14 - Razor clams in some kind of milk sauce, could've been lightly coconut based. I'm not a huge raw clam fan but it was still good.Course 15 - Avocado and sea urchin. It is prepared like guacamole table side. Great dinner theater, not a huge fan of sea urchin but I still enjoyed the dish. If you don't like sea urchin I might pass on this one.Course 16 - Mushrooms in the shape and texture of pasta with black truffle mushrooms to throw on top. It was served with some kind of cream sauce. I'm a huge truffle fan, I loved it.Course 17 - Pork belly on brioche. Another dish that looks simple but tastes outstanding. Another big highlight of the dinner.Course 18 - Confit potatoes with ham. Just like it sounds, we were getting a little full at this point and had tons of ham while in Spain. It was pretty good but not outstanding.Course 19 - I'll call this Deconstructed Chicken Soup and it was one of the biggest surprises of the meal. Chicken served on cinnamon stick skewers with chunks of bread that was soaked in broth then toasted. A side of broth came alongside it. Another highlight of the meal.Course 20 - Ham and tomato bread. You can get this anywhere and I did, but it was especially good here. Another item I could've passed on but it was still good.Course 21 - Manchebo cheese and crackers served 2 ways. Traditional and gastronomic, much like the olives I had earlier in the meal. It is worth trying as well.Course 22 - Deconstructed carrot cake served in an ice cream cone made out of some type prepared carrot. The flavors changed dramatically with each bite. Another highlight of the meal.Course 23 - Gastronomic eclairs. The typical white frosting was actually crunchy and melted in your mouth while it has spurts of chocolate throughout.", 
    "5.0", 
    "Michael C.", 
    "Boston, MA", 
    "817", 
    "1294", 
    "tickets-bar-barcelona", 
    9, 
    [
        "Tapas Bars", 
        "Spanish"
    ], 
    4
]