[
    "My first review in a while and it's long overdue. I was here in May '12 and as I recollect my experience there, i could only do it justice by writing compliments for them.This review is not to describe every dish in detail but to overall give praise to the staff and chef that accomodated me. To start, this is how i got my \"reservation\":As most know, Tickets as name suggests, uses a tickets system to fairly give everyone a chance to patronize at their restaurant. However due to my sudden trip to Barcelona, i was not able to acquire a ticket ahead of time. Sulking as i walked toward Tickets for hopes that i can score a walk-in solo, i noticed 41 degrees next door which i will return to have a drink later that night.  The maitre d' kindly informed me that there was not any cancellations for seats tonight. So i went to 41 degrees to get a drink instead. Through the night I had some amazing cocktails there and some great conversations with other local patrons and staff (even if my spanish was probably insulting for them to listen to). Eventually it was 2 am and Albert Adría came in to greet the guests. A group of 4 regular patrons were about to leave as Albert came to say good bye to them. One of them decided to tell Albert that I came all the way from the US and will be highly disappointed if i couldnt eat at Tickets. Albert took a look at me and said in English, \"come back tomorrow night at 10 pm, you will have a seat.\" I couldnt believe what i was hearing, just to double check, i asked Albert, \"10 pm for dinner at Tickets?\". He replied, \"just come by, i'll make sure you are taken care of\"Next night i came back and as i approached the same maitre'd, i thought to myself if he will believe my story. And even i started my ridiculous story, he responded, \"we are expecting you.\"Going straight thru the service, i had a 1-on-1 service at the counter who explained everything i was eating and made sure i was taken care of. At the end, the manager asked if there's anything he could do for me. I got greedy and asked to see if i cam have dinner at 41 degreed next week. He said sure, for how many and what time. I said 1 at 7 pm? Sadly he replied they only take even number patrons and there's not much he csn do about it. Even so, my night was finishing on a high note as Ferran Adria was also eating there and took a picture with me and Albert.The food was beyond phenomenal, it reminded me a lot of saam in bazaar. Every dish was done to accentuate some aspect of texture and/or taste. God i am jealous of those catalans!", 
    "5.0", 
    "Ho Ching N.", 
    "Oakland, CA", 
    "54", 
    "8", 
    "tickets-bar-barcelona", 
    62, 
    [
        "Tapas Bars", 
        "Spanish"
    ], 
    4
]