[
    "Tickets Bar is definitely one of the hardest reservations to get in Barcelona.  If not, the hardest.  It's sister restaurant, Bodega 1900, across the street was a lot easier to get reservations.  The Adrià brothers have become restaurateurs with multiple restaurants in Barcelona.  Their unique and modern tapas made every tapas/pinotxo restaurant I went to look like amateurs.  Trust me.  I went to about 7 notable tapas/pinotxo bars within a two day period while in Spain. Now, Tickets Bar's accolades:1) 1 Michelin star in 20142) 1 Michelin star in 20153) #57 on the San Pellegrino 2014 World's Best Restaurants4) #42 on the San Pellegrino 2015 World's Best RestaurantsThe service was fantastic especially when you're sitting right in front of the kitchen.  The experience of seeing the cooks being playful with each other and at times yelling at each other was very amusing.  Our waiter did a fantastic job at explaining the dishes and letting us sample practically all the dishes that made them famous.Now, the food.  Tickets Bar has an a la carte menu along with a tasting menu.  Now, I personally wouldn't suggest going with the a la carte menu because it's a waste of time and money.  We went with the tasting menu and added on their cured meat dish at the end.  Everything was amazing but here are my absolute favorite dishes:1) Roasted Octopus - Roasted Octopus had a sushi cut roll presentation and served on a glass box.   The six morsels were extremely tender and had the texture of an A5 Japanese Wagyu rib eye.  The dried kim chi added a crunchiness to the juicy pieces.  The dish was divine.  2) Jamon with Baguette - The Jamon was wrapped in an empty baguette.  The empty baguette made each bite evaporate in your mouth.  The saltiness of the Jamon was pretty much all you tasted.  It was definitely an innovative and creative dish.  Each bite disappeared like someone who owes you money.  3) Pork Rinds - The simple and classic junk food takes a modern twist.  The crunchy and salty pork rinds sounds like your usual stuff you get in a $0.99 bag at your liquor store. However, the presentation was what made this dish stand out.  The pork skin was fried in a way that it looked like octopus tentacles.  Genius. 4) Jamon - This is what Spain is about.  It was served with a slice of bread with a light tomato sauce.  AMAZING.  It was so damn f*cking good that I went and bought a bag of jamon every where I went.  Of course.  It wasn't as good as the ones served at Tickets, Joselito, but it got me addicted like Tyrone Biggums with crack.  It was literally crack.  Overall, I would have to say Tickets Bar is definitely an amazing dining experience.  I've eaten at a lot of Michelin and San Pellegrino World's 100 restaurants from the US to Australia to Asia to Europe.  Tickets Bar easily ranks in my top 5 dining experiences.  EVER.   The others being Ryugin in Tokyo, L'Arpege in Paris, Benu and Saison in San Francisco are tied, and Noma in Copenhagen/Kichisen in Kyoto are tied.US 2015 Michelin 3 Stars Count: 12 Down. 0 More. 2015 Michelin Rated Restaurant Count: 35San Pellegrino 2014 World's 100 Best Restaurants Count: 23 San Pellegrino 2015 World's 100 Best Restaurants Count: 25", 
    "5.0", 
    "Steve N.", 
    "Westwood, CA", 
    "854", 
    "694", 
    "tickets-bar-barcelona", 
    7, 
    [
        "Tapas Bars", 
        "Spanish"
    ], 
    4
]