[
    "We were lucky enough to get a reservation here for our last night in Europe. Heard a lot of hype and hoped it would be worth it. We weren't disappointed.It's a very casual setting -- jeans and a button down/polo are fine. The circus theme is definitely not like most restaurants with food of this quality, but that was fine with us. A really fun atmosphere.You can order tapas à la carte, or they can give you a \"surprise menu\" where you give them whatever guidance you want (more fish, more meat, vegetables, etc) and they will pick out a menu for you. That's what we did, and they chose incredibly well.We started out with some very small plates that were one bite each and got us introduced to a huge variety of different flavors. Just when we thought we were never going to get full, we started getting some heavier dishes that were more meat-based, and then finished off with a few dessert courses. Our waiter was great, explaining very well what everything was, and how to eat it, which is not always obvious. There were somewhere around 15-18 plates that left us not stuffed, but completely satisfied. Too many to remember, but a few highlights:- The liquid olives were unlike anything I'd ever had. You put the whole olive in your mouth and it breaks like an egg yolk with an intense burst of olive flavor. Absolutely worth trying for the experience.- My favorite, and that of most of our table was the avocado-crab cannelloni. Delicious crab wrapped in thinly-sliced avocado came fairly early on and took everything to the next level. Definitely try this one.- The other one which I would definitely recommend is the potato-truffle served in an egg shell. All said and done, our bill was around 60 euro/person not including the wine/cava. That was less than we expected, which left us feeling great. For the price, I don't think you'll find a better meal. If it wasn't the best meal I've ever had (and it very well might have been) it was definitely the most unique. If you can get a reservation, absolutely take a trip to Tickets!", 
    "5.0", 
    "Greg V.", 
    "San Francisco, CA", 
    "9", 
    "5", 
    "tickets-bar-barcelona", 
    74, 
    [
        "Tapas Bars", 
        "Spanish"
    ], 
    4
]