[
    "This was our favorite restaurant in Barcelona, and I wish that we had discovered it earlier so that we could have gone at least once more.  Don't get me wrong, the food was great, but the reason this was definitely a five-star experience was because of our server, who gave us--by far--the best service we experienced on our trip to Spain.  Unfortunately they weren't offering a menu--something that I usually look for--but that ended up being okay because the prices of their single plates and montaditos were very reasonable.  We felt like we ordered a good amount--six plates plus a plate of bread rubbed with tomato, four glasses of wine, two cappuccinos, and a dessert for a little over 60 euro.  I wouldn't have minded paying more, quite frankly.  I really enjoyed the shrimp cooked in garlic and oil (the were flavorful and perfectly cooked), the mushrooms (also cooked in oil), and a montadito with shrimp and shredded crab meat. They offer bread with or without tomato, but it was delicious with the tomato--just the right amount--and we used that to sop up the rest of the shrimpy-garlic oil and soak up the wine.  The house wines were really good and reasonably priced, and the dessert--god damn that dessert--was the most memorable one I had throughout my entire trip.Again, I think all of that sounds deserving of five-stars, but I am very grateful to my server (who's name, unfortunately, has escaped me) who had suggested several of our food/drink options, and had checked on us more times than we had become accustomed to in Spain.  He had highly recommended the shrimp, and had steered us away from one dish to the shrimp and crab one, and had suggested a wine to my friend based off of her preferences; and then finally, he had topped it all off by steering us from one dessert and into the loving, chocolatey arms of another.  I wish I could tell you his name or the name of the dessert, but all I can tell you is that he had steered us away from the brownie.  Anyhoo, this was definitely the best dining experience we had in Barecelona, if not in all of Spain (though to be fair we were only in 5 cities); I would highly recommend this place to any/everyone.  Truth be told, even if I go back to Spain, I doubt I would make it a priority to visit Barcelona again; the only reason I could think to would be to visit some more Gaudi work (I only got to see La Pedrera), and to come to this restaurant.", 
    "5.0", 
    "Johnny V.", 
    "Aurora, IL", 
    "61", 
    "133", 
    "tramoia-barcelona", 
    1, 
    [
        "Spanish", 
        "Mediterranean", 
        "Tapas Bars"
    ], 
    2
]