[
    "I came by here for lunch on a weekday based on all the good reviews on Yelp and Tripadvisor. The street outside this restaurant looks a bit sketchy and there weren't many open shops when I went, but anyhow, found this place without a problem. You order your food first and then are given a number that you hang onto the wall behind/next to your table! I ordered the ravioli with pesto sauce (apparently it's red), and along with it came a drink of my choice (beer, wine, soft drink, juice), and a dessert (brownie, cheesecake, tiramisu). The lady at the counter was really helpful and friendly, and she chatted with me a bit about where I'm from and how I found the place. Apparently I was the second one to have gone in because of Yelp for the day (and I showed up within half an hour of their opening hours!). I asked if any of the combinations came with an empanada, and she said yes but then I realized it's more worth it if I just tacked on my empanada to the meal I was having. So, I had a beef empanada, ravioli with ricotta, spinach, and peanuts, with red pesto sauce, pineapple juice (they have orange juice or pineapple juice for juices), and tiramisu. The beef empanada was served on a wooden cutting board serving plate with a knife, and it was just alright; the beef was very flavorful, although the shell was pretty thin. I actually like that the shell was thin, because then I can have more meat per mouthful! The ravioli came with a pile of parmesan cheese on top, and it was very overwhelming. I wish the ravioli came with more sauce! The inside was delicious and melted in my mouth, and the pasta itself was chewy and fresh. Quite tasty, but needs more sauce and less parmesan cheese. The bread was good too, crunchy outside and soft inside. The pasta needs more sauce so I can dip my bread! I finished my pasta, and then came my tiramisu. It came in a cute little cup, and upon trying to get a piece, the entire cake sunk down. It was somewhat difficult to get. But, it was quite tasty. The cake could be much softer though, and there wasn't much of a coffee taste. There was also a lot of liquid for some reason, though the cream was nice and thick and the dessert overall wasn't too sweet.All in all, I think the food is slightly above average at 3.5 stars, but I gave it a 4 for the friendly staff, nice ambiance, and great price for the quantity! The meal without the empanada would have been €7.80, and the empanada added €1.90. Could do without the empanada, I was really full at the end!", 
    "4.0", 
    "Andrea W.", 
    "Fremont, CA", 
    "73", 
    "1004", 
    "tucco-real-food-barcelona", 
    20, 
    [
        "Argentine", 
        "Italian"
    ], 
    1
]