[
    "DELICIOUS!!! PHENOMENAL!!!! FANTASTIC!!!! AMAZING!!! AWESOME!!! These are only a few words I would use to describe Tucco Real Food run by Juan and his brother. This place is so amazing, we went twice in the 2 real days we had in Barcelona. The (now) fiance (!) found this place on YELP (THANK YOU YELP and YELPERS!!!!) and it was more delicious and great than we could have imagined!It is a phenomenal value for the quality of food and they have their food sold in \"sets.\" You get a choice of all homemade pastas (they make it on premises!!), yummy also homemade sauces, a drink (soda, water - can/bottle - not fountain/tap) and a homemade dessert (Juan makes these :) )!!! This, all for UNDER 10 Euros for the most expensive set (and those sets come with one of their homemade empanadas on top of everything!). We tried the tagliatelle pasta (*droooool) with the putanesca sauce (omgosh) and the pesto sauce (yum yum yum!) as well as one of their special spinach pastas (*running out of ways to describe how good everything was!), the homemade tiramisu (THE BEST!!), the decadent brownies (ooooo chocolate), and the special \"Crema de dulce de leche cigalleta\" which was like this hazelnut yumminess! I can't say enough about how fantastic the food was!!! You choose your set before sitting down and they bring you your food. They also have coffee, espresso, other desserts and more things that we didn't have a chance to experience!The only thing more awesome, was Juan!He was this really cool down to earth guy, running this really authentic reasonably priced restaurant and just totally nice! We got a chance to chat with him and he was just so so awesome! They are looking to open up another place in Barcelona and that area will be lucky to have this wonderful addition to their neighborhood!This place is kind of hard to find and might be scary to maneuver being new in the city/country, but so worth it! I am going to add a picture so that you can see the street to go down to get there! My fiance was able to lead us there using maps he printed at home from google maps so make the trip and get some Tucco Real Food!!!ONLY THE BEST OF LUCK TO YOU AND YOUR BROTHER, JUAN!Thank you so so much again for the brownies, the great time and the impeccable food! We will MOST DEFINITELY be back when we visit Barcelona again! :)", 
    "5.0", 
    "Melissa N.", 
    "Brooklyn, NY", 
    "278", 
    "449", 
    "tucco-real-food-barcelona", 
    60, 
    [
        "Argentine", 
        "Italian"
    ], 
    1
]