[
    "I sit here in Tucca Real Food as I'm writing this review and finishing up my second meal here in 2 days. As I'm doing this I'm slowly falling into a depression because I don't live here and I have no idea of the next time I will be returning to barcelona...Seriously, the food is that good! It's so hard to even know where to start. Last night my fiance and I made our way here after leaving las ramblas. It is not easy to find as there are side streets you need to navigate and at night it's straight up creepy if you're not used to it.Anyway, upon walking in we were greeted by Juan who speaks excellent english. He was so incredibly friend and helpful. Just an amazingly helpful nice guy. He explained the way that everything works there. You order everything up front and it comes with a drink, your main meal, and a dessert for either 6.60e or 8.50e!The first time I ordered the special ravioli made of spinach stuffed with spinach and cheese and had a sauce of chicken and herbs.... Amazing!!! That special cost 8.50e and in addition to what I just mentioned it also came with an empanada... so delicious!My girl had tagliatelle with putanesca and she said it was incredible.  Btw her meal was only 6.60e... Ridiculous! For dessert we had the homemade tiramisu and home made creama de Leche I think (they are known for it). Both of these desserts were delicious. A massive delicious meal (by the way all the pasta is homemade fresh too) and it was about 15e...Which brings me back to why I'm here again today. After walking the barri gotic today we came back and I just finished tagliatelle with cream of pesto. It was unbelievable; seriously... I can't believe I can't find this kind of deliciousness back home in Brooklyn and definitely not Manhattan. And now I go back to my depression of missing Tucca. .......Hope this is helpful for all!", 
    "5.0", 
    "Geoff P.", 
    "Brooklyn, NY", 
    "12", 
    "120", 
    "tucco-real-food-barcelona", 
    92, 
    [
        "Argentine", 
        "Italian"
    ], 
    1
]