[
    "D*mn.  Got this one mixed up with Teleferic.  Was looking for a place near the Passeig de Gracia station and we ended up here (b/c they had vegetarian options and I thought it was a different place that had really good reviews...  So sad to have wasted one of my Barcelona-dining experiences here).  First, let me say I am fairly okay with the whole shared sink space for the bathrooms - Let me warn you, this place's restrooms are creepily uncomfortable.  You go downstairs and see signs for men, women, and disabled restrooms - Then you open that door and realize all of the stalls are in one small room together.  Once you get over that shock, you look at the pictures on the doors trying to figure out which is which, b/c it makes total sense to mark the men's stalks with a pic of a dude wearing a wig-WTF??!.  But then you realize, it doesn't matter - It's disgustingly obvious that men were using the women's stalks and vice versa.  Gross.  And so when you're standing in this god-awful room trying to wash your hands and some dude stumbles out of a stall, and then decides to zip up his fly, your love for Barcelona will start to falter.  So that was strike one.  Strike 2 was when I got back upstairs and while pulling out my chair and looking down, I see a GINORMOUS cockroach scuttling across the floor.  I'm not exaggerating when I say this bugger was the length of my closed fist.  So think about that when you know their eats have been sitting out in a display.  So even then, we ended up eating their.  I know, I think about it now, and it sounds completely crazy, but I thought this was a different place that had really good Yelp reviews.  Plus, I had just gotten off a 2 hour train ride and I was starving.  The food was eh-to-okay - They did have several vegetarian options, so I tried like 5 different things.  They were all edible.  Hubby had 2 meat-dishes.  He ate them.  That's about all I can say on the food.  Our server is what you would expect if you were going to be waited on by someone who works at Abercrombie and Fitch.Avoid this place at all costs.", 
    "1.0", 
    "Helen C.", 
    "Oklahoma City, OK", 
    "12", 
    "110", 
    "txapela-barcelona", 
    8, 
    [
        "Basque"
    ], 
    2
]