[
    "This spot has an old-school feel that washes over you when you walk in.  The bartenders wear these navy admiral like uniforms and are all probably 60+.  The crowd, at least around 6 PM when there aren't swarms of people, seems to be mostly locals who know the bartenders pretty well.  All good signs.Sat down and ordered my favorite bar drink (Clara con limon --- beer with fanta), and proceeded to order the solomillo (sirloin) with foie, Patatas bravas, and boquarones (sardines).  I did have a friend with me, so don't judge!  All of the food was absolutely on point.  The steak with foie was moist, tender, and rich.  The grilled onions work really well with the steak and foie --- makes for some excellent bread dipping once you've polished off all the goodies.  The bravas are excellent --- how can you go wrong with crispy potatoes, mayonnaise, and hot sauce.  The sardines had a lovely tartness from the vinaigrette and were not fishy at all.  My friend, a Barcelona resident, says these are the best sardines in town.  I'll take her word for it.When it's all said and done you had yourself a very fine meal in a pretty cool atmosphere.  For those who can't speak Spanish there is English on the backside of the menu (saw a few folks struggle communicating with the bartenders I Spanish  ... Who then simply turned over the menu to reveal English).  I'm pretty sure they don't accept credit cards and be sure to bring a good amount of cash if you're ordering the steak.  This isn't your typically super cheap tapas place --- The steak with foie will put you back €22 for a good 8 ounces.  It's a decent portion --- but I'm not one to share and can easily finish one plate by myself! It's worth every penny and then some.  I can see why many folks talk about how crowded and cramped it can get.  The bar area is very slim and I would simply recommend coming during off hours (6ish) where you can get a seat and enjoy yourself!", 
    "5.0", 
    "Farooq K.", 
    "Denver, CO", 
    "65", 
    "128", 
    "vaso-de-oro-barcelona", 
    7, 
    [
        "Tapas Bars", 
        "Spanish", 
        "Beer Bar"
    ], 
    1
]