[
    "\"Bon Vivant Tapas\"Exquisitely simple with top quality food that was very flavorful.I found this place on YELP based on YELP's greeting to me that I should try this place as it said it opened 3 weeks ago, I think not. The sign that is on the front of building says, established 2014. I went in May 2015. Yelp didn't have a good pictures of the building either, so I am going to load up my review with some decent pictures of the place from outside.I went on a Thursday afternoon and stayed for over 1.5 hours enjoying my feast dining in the open air of a sidewalk-seating table. Maybe the only downside that I could see, if you are arriving at night it might be a wait to get a table.I am one who LOVES to eat in the open air of a sidewalk and not the confines of sitting inside. Hey, it's my commune with nature side of me.The tapas are very good and varied from classic to the most original. The presentation is very elaborate/ elegant. I ate four different tapas. It seems the food presentation is well thought out to make it as extremely appealing.And, what I really appreciated is that you get extremely fresh and delicious food and that they don't crush you on the price, meaning the food pricing is extremely reasonable compared to other places. 1/2 liter Sangria de vino      : 9.60 (Perfect)1 Gamba Roja Plancha       : 9.75 (very moist and delicious sauce too. Be careful the juice may squirt on you, so be prepared when you cut it)1 Langosti                              3.90 ( Beautiful, I started with one and order another, spectacular! It was a pleasant surprise)1 Langosti                              3.901 Pasta Del Dia                       5.90 (this was good, probably my least fav of all)1 French Hamburguesa       2.95 (this was a daily special, was good, if you like it well done, please make sure to tell them as it is cooked on the medium-rare maybe medium...be sure and ask on this)1 Torrija St Teresa (dessert) 2.201 Café                                            1.75Total                                          39.95What impressed me too was my waiter Antonio provided some great recommendations for dessert and told me to relax and enjoy my meal while others were waiting for my table. Excellent service and attentive staff is my experience here. You will not be disappointed, my favorite restaurant in Barcelona.", 
    "5.0", 
    "Victor H.", 
    "San Diego, CA", 
    "36", 
    "55", 
    "vinitus-barcelona-2", 
    5, 
    [
        "Tapas Bars"
    ], 
    2
]