[
    "The Venetian brothers who run this wonderfully charming neighborhood spot mean business. Rumor has it Woody Allen's reservation was cancelled due to tardiness. So if you go - and you should - show up on time. And yes, a reservation is recommended. We started with the burrata, which comes from a friend's farm in Italy, and we later found out, many of the items come from small purveyors in Italy. The burrata was not like the cheese I've had stateside, which i'm sure is due to the Italian cow's diet. The platter of rich, creamy cheese was served with the sweetest of sweet tomatoes that  nicely offset the cheese. It paired nicely with an Italian white from Livio Feluga.Next came pasta, for which Xeimei excels. They hand make bigoli - the only authentically whole wheat pasta in Italy. It is a thick, spaghetti-like pasta with a hole running through the middle of each strand. The Venice speciality, pasta with anchovy sauce (bigoli in salsa) was simply put, amazing. Yes, amazing sounds like hyperbole, but I'm not kidding, that sweet, briny anchovy sauce over the chewy bigoli pasta was heavenly. I had to ask our waiter how it was made, thinking complex, multiple ingredients, but really it's anchovies and onions stewed for hours, almost to the point of caramelization. I can only hope I either come across that dish again or get my hands on a recipe so I can recreate it at home. My husband's squid ink pasta was also exceptional. Earthy and flavorful, it tasted like no squid ink dishes I've had in the U.S. Next came the grilled octopus, which was a life-changing dish. I've never had octopus grilled or any way, for that matter, outside of a Japanese restaurant. The tentacles were so tender and flavorful, it almost melted in my mouth. Life-changing, I tell you! The evening ended with tiramisu, which happens to be one of my specialties. I make it traditional and boozy and I was curious to see how a \"real\" Italian tiramisu would stack up compared to mine. I have to say, I think I prefer mine, but Xemei's was a nice ending to a special meal.", 
    "5.0", 
    "Lee H.", 
    "Portland, OR", 
    "311", 
    "1081", 
    "xemei-barcelona", 
    3, 
    [
        "Italian"
    ], 
    3
]