[
    "4.5 review. We were in Barcelona this past weekend as my sister in law had come over for a visit and had yet to see Spain. Always up for any excuse to eat tapas and drink Rioja we decided to hop over for a couple days. The past couple times we have visited Barcelona we have met up with J's friend who has grown up there. We always defer to him for restaurant selections and they are always nice but not really worth repeating. For this trip we decided to take the reigns. There were several places I was dying to try but I knew with a party of 4 on a Saturday night we might have some trouble. We stopped by the first place and it was jammed wall to wall so we headed for the Gothic Quarter instead. Ziryab was closest so we headed there next. Upon arrival I thought we would be out of luck again because it was quite busy. After checking with the hostess though she thought a table should open up in 20 minutes so we grabbed some vino and sat outside. In less than 20 minutes time we were taken upstairs. The place probably has 12 tables in total but is so cute and has a wonderful atmosphere. I was sad to hear English and not Spanish at the tables nearest us but I guess that is what happens when a place ends up on Tripadvisor and Yelp :) Having already glanced at the menu online we asked for the Chef's surprise menu and an order of pan con tomate. Our food arrived in the form of 4 trays with about 7 tapas portions each. Each tray had a bowl of some kind of coconut and sweet potato soup but otherwise each tray was different than the next. There was everything from Spanish marinated cheese and olives and patatas bravas to Middle Eastern tapas like hummous, babaghanoush, and this delicious bacon, leek and goat cheese dip. The presentation was wonderful and I loved the combo of Spanish and Middle Eastern cuisine. The pan con tomate was also great - it came with the tomatoes on the side so you could make your own as you like.The chef menu finished off with a few tiny desserts which included a Catalan pastry, some baklava and randomly a chocolate covered strawberry. Wonderful experience. Wonderful meal. Will come back.", 
    "4.0", 
    "Micah C.", 
    "Dublin, Republic of Ireland", 
    "59", 
    "207", 
    "ziryab-barcelona-5", 
    16, 
    [
        "Middle Eastern", 
        "Cocktail", 
        "Hookah Bars"
    ], 
    2
]